{
  "game": "",
  "sections": {
    "cemetery-of-ash": {
      "name": "Cemetery of Ash",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Cemetery+of+Ash",
      "steps": {
        "AC47BDVU": "From the start head right at the first turn and pick up the @soul-of-a-deserted-corpse",
        "IAQ62SLC": "Loot the corpse on the fountain to obtain the @ashen-estus-flask",
        "3XIR0WTV": "Turn right after the fountain and head down the path through a flooded passage. Kill the @ravenous-crystal-lizard to get a @titanite-scale and then pick up the @soul-of-an-unknown-traveler from the corpse in the area",
        "FDDJ0T1F": "The @speckled-stoneplate-ring[Speckled Stoneplate Ring+1] is also in this area",
        "N5VN0L51": "Head back to the fountain and take the path straight ahead. Climb the cliff and rest at the Cemetery of Ash bonfire to receive the Rest gesture",
        "2PWGHC61": "From the bonfire head down the left path and jump from the cliff over to the corpse on the tomb to pick up a @titanite-shard",
        "5NIZZTFV": "Take the side ridge down from the large cliff face on the right to pick up @firebomb[Firebomb x5] from a nearby corpse",
        "93UTEX7F": "Back on the main path head through the archway and take the sword embedded in the statue. Kill @iudex-gundyr to receive the @coiled-sword",
        "RP36AJII": "Congratulate yourself on beating the first boss of Dark Souls 3 and rest at the @iudex-gundyr bonfire",
        "ZRBYRTNO": "Continue through the large door and pick up the @broken-straight-sword from the corpse leaning on the tombstone",
        "EPQQ18MZ": "The @wolf-ring[Wolf Ring+2] is behind the door you just passed",
        "IS778PLD": "Head over to the large cliff edge and pick up the @homeward-bone at the edge of the ridge",
        "DBMED1XC": "Take the left path up the cliff and turn left just before @firelink-shrine and grab the @east-west-shield from the corpse on the tree",
        "8ZKX8GEM": "Kill @sword-master to get @uchigatana + @masters-set and to unlock his summon sign",
        "RRAGGMRU": "Head back and up the path to the left to pick up an @ember from a corpse above the entrance above @firelink-shrine",
        "HY3B7X8J": "Continue across to the other side picking up a @homeward-bone from a corpse behind a tomb and another @ember from the lower ridge ",
        "4R2NRJGV": "Go back to the main path and enter @firelink-shrine"
      }
    },
    "firelink-shrine": {
      "name": "Firelink Shrine",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Firelink+Shrine",
      "steps": {
        "52TF13T6": "Talk to @fire-keeper",
        "XQE4Y3BO": "Talk to @shrine-handmaid",
        "RDTM7FZU": "Talk to @hawkwood to receive the Collapse gesture",
        "GZEOCSIK": "Talk to @blacksmith-andre to receive the Hurrah! gesture",
        "5GPP2Z8S": "Go out the top of @firelink-shrine and pick up the @soul-of-a-deserted-corpse from the corpse next to the small decrepit tower",
        "ZNMFVIF3": "When you have the @tower-key, unlock the small decrepit tower and head up to the bridge leading to the Bell Tower",
        "8XLOHHK8": "Roll off the bridge onto the @firelink-shrine roof and kick down the ladder shortcut",
        "KQN0JQ9Z": "Just behind the roof kill the @crystal-lizard to get a @twinkling-titanite ",
        "95TW1TGF": "Pick up @homeward-bone[Homeward Bone x3] from the lower part of the roof",
        "KQ8SEB2C": "Inside the roof pick up the @estus-shard from up in the rafters",
        "35I0FM05": "Trade a @homeward-bone with @pickle-pee--pump-a-rum-crow crow to receive the Call Over gesture and the @iron-bracelets. For the other trade options see the @- page",
        "UM4L0G1S": "Hit the @illusory-walls at the back of the rafters and drop down to get the @covetous-silver-serpent-ring from the chest",
        "WEKVX8LB": "Head into the Bell Tower, go up the lift and @unbreakable-patches may close the door depending on your progress in the game",
        "RFOEXU8A": "At the top of the Bell Tower, pick up the @fire-keeper-soul",
        "3AHYIB3V": "Go back down the lift and look down the right side. Carefully jump down to the tombstone and pick up the @fire-keeper-set from the corpse ",
        "RFK4D1PB": "Make your way down to the bottom and pick up the @estus-ring from another corpse and open the door"
      }
    },
    "high-wall-of-lothric": {
      "name": "High Wall of Lothric",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/High+Wall+of+Lothric",
      "steps": {
        "QHOGIPN7": "Open the door ahead and rest at the High Wall of Lothric bonfire",
        "MR5HYKXN": "Take the right path onto the rampart and head down the small stairs on the left. Pick up the @soul-of-a-deserted-corpse from the corpse",
        "B2VTMR63": "Head back up the stairs and up the next set of stairs at the end of the rampart. If you want @titanite-shard + @ember, wait for one of the undead to transform into @pus-of-man and then kill it. Also, pick up @longbow + @standard-arrow[Standard Arrow x12] from the corpse",
        "KQDEJORS": "Go back to the bonfire and this time head down the left path. Pick up the @soul-of-a-deserted-corpse from the corpse",
        "OP777073": "Head up the stairs at the end of the rampart and up some more stairs to the top of the turret. Pick up the @binoculars from the corpse",
        "VQBK7VYJ": "Go back downstairs and drop down behind the dragon. Enter the small doorway to pick up @gold-pine-resin[Gold Pine Resin x2] from the corpse",
        "AT1PMD1N": "Drop into the indoor room and pick up @firebomb[Firebomb x2] from the corpse beside the table",
        "SWST8E9T": "Go down the ladder and pick up the @soul-of-a-deserted-corpse from the corpse outside of the cell",
        "E3F6KPVS": "Snipe the dragon until it drops a @large-titanite-shard and flies away",
        "BMSAQ85S": "Grab the @claymore, @club, @ember and @large-soul-of-a-deserted-corpse from in front of where the dragon was",
        "WKUJ84EP": "Open the door underneath where the dragon was. Go downstairs. Either kill the @mimic or hit it with an @undead-hunter-charm to get the @battle-axe",
        "2TSPG4BS": "Head out the door on the other side and pick up the @soul-of-a-deserted-corpse from the corpse on the left",
        "I1LFY6ZS": "Go into the next building and pick up @firebomb[Firebomb x3] from the wooden beam",
        "X9I96MGC": "Go out the side exit and up the stairs and pick up the @titanite-shard from the corpse. Light the Tower on the Wall bonfire",
        "APBUIEFC": "After lighting the Tower on the Wall bonfire, return to @firelink-shrine and talk to @leonhard who gives you @cracked-red-eye-orb[Cracked Red Eye Orb x5]. He'll be by Lothric's throne. If he isn't at this point, try killing Vordt and check again",
        "994CL6BC": "Back inside the building go down the stairs, out the side door, and pick up a @soul-of-a-deserted-corpse from the corpse on the right",
        "9AJABSFW": "Head onto the roof. If you want @titanite-shard + @ember, wait for one of the undead to transform into @pus-of-man and then kill it. And pick up @firebomb[Firebomb x3] from the corpse. Continue on and kill the @crystal-lizard to receive a @raw-gem. There is another corpse on the roof which holds a @large-soul-of-a-deserted-corpse",
        "0P6HSRHL": "The @fleshbite-ring[Fleshbite Ring+1] is on another roof that can be jumped to",
        "9VN6K66S": "Take the ladder down and go onto the side roof to get @black-firebomb[Black Firebomb x3] from the corpse",
        "EV92824S": "On the adjacent balcony with the archers pick up @firebomb[Firebomb x3] from the corpse",
        "C6VF0TUM": "Go back inside the earlier building next to the ladder. Take the immediate left and roll into the pots to get @undead-hunter-charm[Undead Hunter Charm x2] from the corpse. Continue inside and grab the @titanite-shard from the corpse while being cautious of the ambush",
        "OKHZTGXY": "Back in the main room pick up the @soul-of-a-deserted-corpse from the corpse tucked inside the first corner",
        "8U2URDRU": "Continue through the doorway and take the next door on the left. Pick up the @broadsword from the corpse",
        "X5Z44KIY": "Head down the stairs taking the right path and get the @silver-eagle-kite-shield from the chest",
        "R7045X2J": "Head back to the original entrance and find the doorway blocked by debris. Roll through it and pick up @green-blossom[Green Blossom x2] at the end of the ledge",
        "E7V1XAZ1": "Drop down and pick up the @astora-straight-sword from the chest",
        "NX8Y8FAZ": "Continue into the room and pick up the @cell-key and @titanite-shard from the corpses around the room",
        "L1TW6ZL1": "Grab an @estus-shard on the altar in the same room",
        "JVEIF939": "The @ring-of-the-evil-eye[Ring of the Evil Eye+2] is in the back of the room behind some barrels",
        "5SFZNKVX": "Head out the lower level and drop down to pick up the @rapier next to the drain",
        "0W901G9E": "On corpses around the fountain you can collect @ember and another @ember",
        "R1T5JHDD": "Head out towards the courtyard and turn left to pick up the @soul-of-a-deserted-corpse from a corpse",
        "ISCAQHH4": "Go upstairs right of the courtyard entrance and head straight along the path. After leaving the first door immediately turn left to find @green-blossom[Green Blossom x3] on a corpse",
        "PUNV9EFW": "Activate the elevator to open up a shortcut from the High Wall bonfire. Behind the elevator at the top is @throwing-knife[Throwing Knife x6] on a corpse",
        "FGFYXFY0": "Travel to the Tower on the Wall and proceed all the way down inside the tower. Go into the next room and pick up @throwing-knife[Throwing Knife x8] on the corpse",
        "GCV4920U": "Continue along the passageway and pick up the @mail-breaker opposite the door on a corpse",
        "Q40X3J5Z": "Further down in this area you will find a locked cell. With the @cell-key you can free @greirat-of-the-undead-settlement and talk to him. If you agree to find Loretta, he gives you the @blue-tearstone-ring. He then moves to @firelink-shrine",
        "AEJV7RJH": "Travel to the High Wall of Lothric and take the elevator shortcut down. Head back towards the main courtyard but this time take the stairs to the left overlooking the fountain area. Grab the @large-soul-of-a-deserted-corpse on the rooftop",
        "FYTPXKL6": "Jump onto the awning to pick up a @ring-of-sacrifice",
        "9OMKZGKY": "Continue back to the courtyard. In the corner of the terrace just before the stairs leading down, you can summon @lion-knight-albert",
        "SXD9S5O6": "Head to the left. Go up the stairs on the left just before the castle and kill the red-eyed @lothric-knight to get a @refined-gem",
        "3L9RS8TM": "Inside the chapel talk to @emma to receive the @small-lothric-banner. Talk to her again for the @way-of-blue covenant",
        "IUJ9G3P4": "Heading out from the chapel take the left stairs and pick up the @lucerne from the corpse",
        "TP8F9VC1": "Just before walking through the great gate, you can summon @sword-master if he was killed earlier at Firelink Shrine",
        "D74Z56AR": "Proceed through the gate and kill @vordt-of-the-boreal-valley; receive @soul-of-boreal-valley-vordt. After killing Vordt, raise the banner at the cliff to access the @undead-settlement"
      }
    },
    "undead-settlement": {
      "name": "Undead Settlement",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Undead+Settlement",
      "steps": {
        "KT0I76FJ": "After the Bat Wing Demons have dropped you off, walk to the left and grab a @large-soul-of-a-deserted-corpse",
        "EGWY7J5I": "Go downstairs. Walk behind an overturned carriage and kill two @dog to get @alluring-skull[Alluring Skull x2]",
        "1CBARATP": "Find @yoel-of-londor below the Foot of the High Wall bonfire amongst several other Pilgrims. Talk to him and agree to his request and he moves to Firelink Shrine. Head back to Firelink Shrine and talk to Yoel to receive the Beckon gesture. Accept Yoel's offer to Draw Out True Strength which gains you a free level and a @dark-sigil. From now on, for each time you die, you gain 1 Hollowing per Dark Sigil. Yoel offers 4 more free levels at 2, 6, 12, and 15 Hollowing, so getting all 5 Dark Sigils should not take long. If you do not get all 5 Dark Sigils before reaching the Catacombs of Carthus, Yoel dies which voids the Usurpation of Fire Ending",
        "8ILS7FGB": "After you get all 5 Dark Sigils and refresh the world, Yoel dies with @yuria-of-londor watching over his newfound corpse. Talk to her to receive the Dignified Bow gesture and buy the @londor-braille-divine-tome",
        "2Q0W9M0O": "Near Yoel, you will find @homeward-bone[Homeward Bone x2] on the far left edge of the bridge",
        "44LQ4QBQ": "From the Undead Settlement bonfire, enter the house. Cut down a glowing hanging corpse to get the @small-leather-shield",
        "X0VWHXPY": "Walk downstairs to get @charcoal-pine-bundle[Charcoal Pine Bundle x2]. Walk out onto the balcony and cut down the hanging body. Turn right around the corner to get @repair-powder[Repair Powder x2]",
        "OYFEJT2C": "Walk downstairs to get another @charcoal-pine-bundle[Charcoal Pine Bundle x2]",
        "6VB1PSK1": "Go outside and grab @lorettas-bone from the body you cut down",
        "SHTKWF9Q": "Grab an @estus-shard by the burning tree with worshipping undead",
        "755YEEA7": "On the other side of the tree, grab an @ember. Shoot down a hanging corpse from the tree to get @kukri[Kukri x9]. Walk to the closed gate to grab a @soul-of-an-unknown-traveler",
        "1TMM5UC5": "Walk to the right of the house to grab a @titanite-shard",
        "VL2R79A9": "Walk through a large archway of the house, open a door, and walk into the room. Grab @charcoal-pine-resin[Charcoal Pine Resin x2] from a corpse near the wall. Cut down the bodies hanging over the staircase to get a @large-soul-of-a-deserted-corpse. Drop down from a hole in the room. In this hidden room, discover the @warrior-of-sunlight covenant and consume @estus-soup",
        "HGJTM29N": "Open the door and walk to the end of the hallway. You should now be on the main street of the neighborhood. Head right and break through the wooden crates between the first gap on your right. Grab a @soul-of-an-unknown-traveler",
        "DUOQDS36": "Walk back the main street and proceed. A wooden door should automatically break. Walk into that house to get the @whip",
        "ZDJPIP6Z": "Proceed back onto the main street. Walk until you see a wooden wheel to your right. Walk around the corner to get a @titanite-shard",
        "S4REBWTF": "Climb up the balcony with an @evangelist. Grab a @titanite-shard",
        "H4DFZC00": "Climb down from the balcony and walk onto a rooftop. Jump onto the wooden platform on your left to grab @rusted-coin[Rusted Coin x2]",
        "2Q5M5Y8Z": "Jump down to kill the @crystal-lizard which drops a @sharp-gem. Light the Dilapidated Bridge bonfire further below",
        "O3GN5A92": "Mad dark spirit @holy-knight-hodrick will invade near the Dilapidated Bridge bonfire if you are embered. Kill him for his @vertebra-shackle",
        "2UBT0U93": "Get back to the burning tree near the beginning of Undead Settlement, walk across the bridge, and walk around the right which should be blocked by wooden crates and barrels. Walk towards the houses with the @thrall. Find a @fading-soul here. Walk around one of the houses to get the @plank-shield. Walk onto the rooftop of the house to your left and grab @firebomb[Firebomb x6]",
        "TIN4DSVR": "Climb onto the rooftop of the other house and grab @homeward-bone[Homeward Bone x2]. Jump down to where a non-hostile Cage Carrier is walking around. Cut down the hanging corpse at the end and grab the @flame-stoneplate-ring. (If the corpse falls down and you are unable get the item, just proceed to the next step)",
        "4BYAKK9I": "Examine the Cage Carrier from behind. After you get out of your cage, walk towards the light. Grab the @wargod-wooden-shield. Talk to @holy-knight-hodrick to receive the @mound-maker covenant and a @homeward-bone. (If you have reached the Curse-rotted Greatwood before reaching the Cage Carrier, Hodrick dies and the Cage Carrier becomes hostile. Thus, you cannot acquire the covenant until later through Sirris' sidequest.) Quit and reload to reappear near the Cage Carrier. Retrieve the ring if you missed it before",
        "RTS39BMV": "Head back, dropping down a small ledge on the left. Enter the house near the bridge and pick up a @large-soul-of-a-deserted-corpse. Then open the backdoor",
        "7YZIPGS4": "From your right, get the @caduceus-round-shield",
        "WQMBMEUA": "Walk across the bridge towards the house in view and jump down to the ledge on your right. When you are on the ledge, walk towards the bridge to get a @titanite-shard",
        "UR4YG316": "The other way leads you to the Cliff Underside bonfire under the house and to a way up",
        "3QL4SYIK": "Walk to the top of the house and find a cage that houses @cornyx-of-the-great-swamp. Talk to him, and he moves to Firelink Shrine. At the Shrine, talk to him multiple times to receive your @pyromancy-flame (unless you are already a pyromancer) and the Welcome gesture",
        "OL5PHKI7": "Grab the @hand-axe and get a @partizan from a nearby hanging body",
        "11DTLMBU": "Walk down from the house and walk onto the gallow. Grab a @soul-of-an-unknown-traveler. Walk across the unfinished bridge to get the @fire-clutch-ring",
        "NJ6PH2QD": "Walk through the archway of the house and down the stairs. Walk left and around the corner to get a @large-soul-of-a-deserted-corpse. Walk downstairs and towards a tree with a @dog. Kill it and get the @ember",
        "64MMXC1M": "Run towards the bridge, and enter the sewers on the right. Kill a Giant @rat to get the @bloodbite-ring. Grab the @caestus and climb up to open the shortcut",
        "4Z7QB2XX": "Walk back through the sewers and onto the bridge to get another @ember. Walk upstairs towards the house on your right. Grab a @large-soul-of-a-deserted-corpse. Walk around the right side of the house to get @alluring-skull[Alluring Skull x3]",
        "HNHRVMJ2": "Walk towards the tower. Talk to @eygon-of-carim outside. If you have enough health, you can drop down into the valley to reach @irina-of-carim in her cell, but don't bother. You can reach Irina by purchasing the Grave Key from the Shrine Maiden after giving the maiden the @morticians-ashes which is futher down in this list",
        "0BA5K2O2": "Walk into the tower to find @siegward-of-catarina. Get on the elevator which goes down to the basement. Kill the @boreal-outrider-knight to get the @irithyll-straight-sword, grab the @ember and rest at the @road-of-sacrifices bonfire",
        "H1U3BZ9W": "The @life-ring[Life Ring+1] is behind Siegward on the upcoming balcony",
        "942KQYQG": "To reach the top of the tower, hit the switch on the elevator while at the main entrance and then quickly get off to reveal a second lift.",
        "44SE4FFO": "After getting off the lift at the top you can find a @soul-of-a-nameless-soldier in a corner.",
        "BNJXLLCG": "Go up the stairs and offer a token of friendship to the @giant-of-the-undead-settlement so that he does not attack you with giant arrows and even assists you when you are near a White Birch.",
        "AK35E1QR": "Take the lift down, and while facing the entrance of the tower, when you hear Siegward's voice; roll off to land onto a wooden platform.",
        "K4ZM1EJF": "Head outside and speak to Siegward again.",
        "1JOYFT0Q": "Lure the the Fire Demon towards the tower which makes Siegward come and fight by your side.",
        "4K05NHE2": "After killing the Fire Demon you gain a @fire-gem.",
        "B81BYOXE": "Speak to Siegward three times to receive a @siegbrau, the Toast gesture, and the Sleep gesture.",
        "HJG2QKCN": "Around the town, you can grab a @homeward-bone and a @large-club. You can also get the @northern-armor-set from a nearby hanging corpse",
        "MVU34N9Q": "A @pale-tongue can be found on a nearby hanging corpse. Obtaining the tongue here or from invading successfully leads to Leonhard returning to Firelink Shrine. He then gives you the @lift-chamber-key that opens the door below the Tower on the Wall bonfire of High Wall of Lothric. Kill the Darkwraith imprisoned there to get a @red-eye-orb. Return to Firelink Shrine and talk to Leonhard to receive the Applause gesture",
        "YUF5IR07": "Walk into the house to get @red-bug-pellet[Red Bug Pellet x2]. Walk upstairs and grab @alluring-skull[Alluring Skull x2]. Walk across a bridge and into a house. Pillage a chest to get @human-pine-resin[Human Pine Resin x4]. Walk onto the roof and to the left to get @flynns-ring",
        "4U7QNUKN": "The @covetous-silver-serpent-ring[Covetous Silver Serpent Ring+2] is on one of the lower rooftops",
        "DZ8L01NB": "Drop down onto the ledge of a tower. Grab @homeward-bone[Homeward Bone x2]. Drop down from within the tower to get the @mirrah-set without the mask and the @chloranthy-ring",
        "SKT5NVWC": "Warp back to the Dilapidated Bridge bonfire, enter the graveyard pierced by giant arrows, and walk towards the house on the left. Grab @blue-wooden-shield + @cleric-set in front of the house and @morticians-ashes by a tree to the left. If dodging the giant arrows is too troublesome, head to the tower to befriend the Giant",
        "WTVHK5KP": "The @poisonbite-ring[Poisonbite Ring+1] is behind the well",
        "G90SBIR4": "Grab all the items around the White Birch (one of them being the @reinforced-club) including the @undead-bone-shard on the platform to the right of the White Birch",
        "6AQIY5TD": "Enter the house and walk upstairs. Grab the @great-scythe. Continue to walk towards the stone building and open the doors on your right",
        "IZ05MJI3": "Return to Firelink Shrine. Give @lorettas-bone to Greirat, who then allows you to keep the Blue Tearstone Ring. You can reload the area and talk to Greirat again to learn the Curl Up gesture. You can reload the area once more and send him to pillage Undead Settlement. He returns when you kill a boss",
        "WBZLPQYB": "Give the Shrine Handmaid the @morticians-ashes and then purchase the @grave-key which opens the locked door in the sewer area next to the Dilapidated Bridge bonfire",
        "VCQPCILE": "Go back the sewer area and open the locked door. Climb down and walk towards @velka-the-goddess-of-sin to grab a @loincloth",
        "LV14IPUM": "Proceed through the tunnel to get the @red-hilted-halberd. Continue into another room to get a @soul-of-an-unknown-traveler",
        "0VJQL5H0": "Walk outside to kill a @crystal-lizard which drops a @heavy-gem. Grab the @titanite-shard and another @titanite-shard",
        "K3ZKFXOB": "Walk through the archway tunnel. Shoot down a hanging corpse to get a @red-and-white-shield[Blessed Red and White Shield+1]",
        "WY6R00P2": "Walk into a new room and climb down to get a @saints-talisman",
        "6KMVYHPP": "Climb up and talk to @irina-of-carim to receive the Prayer gesture. Touch her and accept her services. She then moves to the Firelink Shrine. After recruiting Irina, make sure to go outside and speak to Eygon. At the shrine, you can give Irina the @londor-braille-divine-tome, but doing so and buying any of its spells leads to her Dark ending. Otherwise, hang onto it until you find Karla later in the game",
        "XKIR4BYY": "Kill the @curse-rotted-greatwood to get @soul-of-the-rotted-greatwood + @transposing-kiln. Give the Transposing Kiln to @ludleth-of-courland so he can turn boss souls into weapons, rings, and spells",
        "194Z98PZ": "Talk to Hawkwood after killing the Greatwood to receive a @heavy-gem. If he does not give you anything, come back to him after killing another boss"
      }
    },
    "road-of-sacrifices": {
      "name": "Road of Sacrifices",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Road+of+Sacrifices",
      "steps": {
        "K9G1QSZC": "If you haven't done so before, you can send Greirat to pillage Undead Settlement. He returns when you kill a boss",
        "8NAMKY6E": "Travel to the Road of Sacrifices bonfire. Head down the path and drop down to the left of the tree to find a @shriving-stone",
        "LVWPS3ZT": "A bit farther on you'll find a @soul-of-an-unknown-traveler next to an overturned wagon",
        "CB2XAGMC": "The @chloranthy-ring[Chloranthy Ring+2] is down on a ledge behind the first Corvian Storyteller",
        "R5L7OXX0": "At the fork in the path, head left and drop off the path when it ends. Head left again (instead of going under the bridge) and kill the @madwoman NPC for the @butcher-knife",
        "OSWKV3A2": "Grab the @brigand-axe, the @brigand-set, and the @brigand-twindaggers from this lower area",
        "1FBWJ1B0": "Turn around and head back up the path and under the bridge. Head up and across the bridge for a @titanite-shard",
        "FQ0CRAIV": "Cross back over the bridge and head to the next bridge. Before crossing it, drop off to the right to reach an area where you'll find the @braille-divine-tome-of-carim and @mornes-ring. Give the tome to @irina-of-carim at Firelink Shrine and buy all the spells it offers if you want her to become a Fire Keeper later in the game",
        "PFDBRA40": "Before entering the archway that leads to the Halfway Fortress bonfire, you can find an @ember on a ledge with a caster enemy",
        "PPBQS9CL": "Talk to @anri-of-astora at the Halfway Fortress bonfire. Talk to @horace-the-hushed to get the @blue-sentinels covenant. Make sure to deplete Anri's dialogue before continuing the game",
        "L0AGMTSJ": "After meeting Anri of Astora, return to Firelink Shrine to talk to @sirris-of-the-sunless-realms to begin her quest line",
        "RS082TFH": "Head into the Crucifixion Woods from the Halfway Fortress bonfire. Drop off the right side of the path as soon as it turns left, and drop again to grab a @soul-of-an-unknown-traveler",
        "R7U1087N": "Drop off again and head straight while hugging the wall to your right. You'll arrive at a door. Head in and straight across to a balcony-type area where you'll find some stairs leading to the @sellsword-set",
        "07DS05ET": "Drop down to find the @sellsword-twinblades directly underneath the corpse that had the Sellsword Set",
        "ABIFF73N": "A bit farther in the building you'll find the @farron-coal, which enables Heavy, Sharp, and Poison infusions",
        "89CXVZBN": "Head back outside through the same door you used to enter. Step into the water and follow the edge of the water to the left. Hug the cliffs and you'll find a @titanite-shard",
        "OU5IDFF1": "Continue on with the cliff wall to your left. You'll head past the ramp that leads back up to the Halfway Fortress bonfire, but keep the cliff to your left after moving past it. You'll find another @titanite-shard",
        "HR5MRO2W": "Continuing in this manner, you'll find a large group of @poisonhorn-bug guarding yet another @titanite-shard",
        "8AV98CYD": "At this point, deviate from the cliff wall for a bit and head up the hill towards the water for the @twin-dragon-greatshield",
        "L3B6H6EC": "Head towards the stone wall with the large broken arch (which you would have eventually reached had you stuck to the cliff wall). Grab the @fading-soul from the corpse before heading through",
        "G7RAEIAO": "Turn right soon after heading through the arch to reach the Crucifixion Woods bonfire. Walk along the rocky wall towards the ruins until you reach a purple summon sign for mad phantom @holy-knight-hodrick. When summoned, he instantly becomes hostile, so kill him for souls",
        "GF4CJRN2": "Head past where Hodrick's summon sign was until you reach a ledge. Fall down to grab the @estus-shard",
        "KYI8DKWV": "Continue around the building to a large bonfire with an @ember",
        "YFOQ88ES": "Finish your circuit around the building for a @soul-of-an-unknown-traveler",
        "KNY5XHT9": "Back at the Crucifixion Woods bonfire, drop off into the water and kill the @great-crab furthest away from you for the @great-swamp-ring",
        "AHK2IMK3": "If you are embered, dark spirit @yellowfinger-heysel invades around where the two giant crabs are. Kill her for @heysel-pick + @xanthous-crown",
        "EYDOAJCT": "You will find the following items in the water: @green-blossom[Green Blossom x2], @green-blossom[Green Blossom x4], the @grass-crest-shield, the @conjurator-set, and the @great-swamp-pyromancy-tome. The tome and the set are in the deep part of the swamp near the entrance of @farron-keep",
        "LXB6IAR1": "In the water near where you jump down from the Crucifixion Woods bonfire (near where the two Green Blossoms were), there are steps leading out of the water and a door to the left of them. Head through the door to find a small area with the @sage-ring and the @sorcerer-set",
        "WW86DHW4": "The @lingering-dragoncrest-ring[Lingering Dragoncrest Ring+1] is next to a tree",
        "IROKW34Y": "Head back out of this small area and take the steps to your left. Enter the building and proceed to the next room ahead to find a hallway with a @crystal-lizard, which will drop a @crystal-gem when killed",
        "LHCH989Q": "Go back to the previous room and head up the steps all the way to a balcony. Drop off the broken end to reach a ledge with a @ring-of-sacrifice",
        "0AJ6SBGF": "Drop down, head back up the steps to the same room you were just in, and head up the stairs in the room, but only until you reach the broken wall. Head through down the path to grab the @golden-falcon-shield",
        "VOJB8GI3": "Drop down from here and kill the two NPCs for the @great-club and the @exile-greatsword",
        "LHGX06QT": "Near the water's edge is a corpse with the @fallen-knight-set. There is also a @large-soul-of-an-unknown-traveler by the wall",
        "QW3GMVE1": "Head into the building the NPCs were guarding. There is @homeward-bone[Homeward Bone x2] on a balcony in here. Double back and head down the ladder to light the Farron Keep bonfire",
        "OZOS0BGQ": "Warp or run back to the Crucifixion Woods bonfire. Head into the ruins this time (the ones you previously traveled around before to grab the Estus Shard). The entrance is a hole in the wall in a small depression in the ground. In the first room you'll find the @heretics-staff in an alcove to the right",
        "WY03Z1WW": "Continue on until you reach a 4-way crossroads and then go through the door on your left that looks like it leads to a wall. Turn right at the wall and you'll eventually arrive at @orbeck-of-vinheim. Talk to him and he agrees to teach you in sorceries only if you have at least 10 Intelligence and promise to bring him scrolls. He then moves to Firelink Shrine. If you do not bring him any scrolls before defeating 4 bosses, he will leave",
        "NBM5HMSR": "@orbeck-of-vinheim grants you different rewards based on certain criteria. If you are not a sorcerer, the @young-dragon-ring is given to you after buying three of his spells and giving him at least one scroll. You will be rewarded with the Silent Ally gesture and the @slumbering-dragoncrest-ring after buying Aural Decoy, Farron Flashsword, Pestilent Mist, and Spook.",
        "LYOAX0LA": "There are broken steps that lead down from Orbeck's study with @blue-bug-pellet[Blue Bug Pellet x2]. Drop off to reach the final room before the boss",
        "JLXFR61R": "In this room, near one of the stone pillars, @eygon-of-carim has casted down a summon sign. You can summon him if you have recruited Irina to your Shrine and have not harmed her",
        "G9S6N28W": "Defeat the @crystal-sage; receive @soul-of-a-crystal-sage",
        "JFUGV1G0": "Head down the winding paths past the Crystal Sage bonfire to find two Crystal Lizards, who will each drop a @twinkling-titanite",
        "WQH2ZEQJ": "Continue following these twisting paths until you can drop down next to a large fire and the @herald-set. Continue on to the Cathedral of the Deep bonfire"
      }
    },
    "cathedral-of-the-deep": {
      "name": "Cathedral of the Deep",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Cathedral+of+the+Deep",
      "steps": {
        "CHW44Y1T": "From the Cathedral of the Deep bonfire, head down to the left to find a hostile sword-wielding NPC and the @paladins-ashes behind him",
        "AJ20UIWB": "Back up by the bonfire, start heading up the first set of steps, but turn left about halfway up. Follow the path and turn right at the end for a @titanite-shard in an alcove",
        "0D3YY0DW": "Head back to the steps and head up to the top of this first set. Before climbing the second set of steps, head right this time and follow the path until you reach the @crest-shield",
        "R4AP16II": "From here, you can jump down and kill the axe-wielding NPC on the steps (he can be struck with a plunge attack using a big enough weapon) to get the @spider-shield",
        "TUD176YB": "In the next area with the dogs and crossbow enemies, grab the @large-soul-of-an-unknown-traveler from a ledge",
        "UADM2LXI": "Continue on and light the Cleansing Chapel bonfire inside the chapel. There is also the @notched-whip in the corner",
        "MBXB5TX9": "Grab the @estus-shard right outside the Cleansing Chapel bonfire where enemies are praying near an obelisk",
        "9XN0MVX4": "Instead of heading up the steps past the obelisk, head right and drop down a couple of cliffs into a lower, water-filled area. Head forward a bit to grab the @saint-tree-bellvine from a stump on the right. Remember you can hold a torch to get rid of leeches",
        "U2YBSKDB": "Continue down the waterway and head up the steps at the end. From the top of the steps, there will be a @titanite-shard to your right and a Crystal Lizard in front of you which will drop a @twinkling-titanite when killed",
        "TJRIEBAI": "Farther down the path you'll encounter another Crystal Lizard which will drop another @twinkling-titanite. If you head up the stone steps near where the lizard was sitting initially, you can grab another @titanite-shard",
        "YY4X88JB": "From here, you can drop down to where the @ravenous-crystal-lizard is sleeping and kill it for a @titanite-scale",
        "RZENTVCQ": "Near where the Ravenous Crystal Lizard was sleeping, you'll find a narrow path between the buildings which leads to the @poisonbite-ring",
        "SVAWJUCS": "Turn around and head back outside and continue straight up a set of steps. Here you'll be able to grab a @titanite-shard from a window and drop back down to the Cleansing Chapel bonfire",
        "H7JB9WCB": "Head back out past the obelisk with the praying enemies and head up the steps into the graveyard. Take your first left and stay left to reach the @astora-greatsword",
        "RRN2FJBD": "Turn around from the previous item and head straight until you reach a T-intersection. Head left, drop off, and follow the path to the end to drop down in an area with a @fading-soul and the @executioners-greatsword",
        "WM7KAM30": "Turn around and head out of this circular area, turning left when you can and crossing a bridge. Head up a set of steps, fight the @cathedral-grave-warden, and head down more steps to the right to an area riddled with large arrows. Here you can pick up an @undead-bone-shard, @repair-powder[Repair Powder x3], a @young-white-branch, another @young-white-branch, a @large-soul-of-an-unknown-traveler, and finally another @large-soul-of-an-unknown-traveler",
        "2RJZKQR7": "Head back up to where you fought the Cathedral Grave Warden, and head up the set of steps and turn right towards a tower. You can find a @titanite-shard to the left of the tower. Inside, grab the @curse-ward-greatshield, head downstairs, and create another shortcut by kicking down the ladder",
        "XMT5X2Y9": "Head back up and out and towards the cathedral's main double doors. Head left first and roll through some crates to find @rusted-coin[Rusted Coin x2]",
        "R9OR13SI": "Heading right from the double doors, you'll find a corpse with a @red-bug-pellet",
        "7X5X22AF": "Continue on across the narrow roof (watching out for ambushes) and grab the @large-soul-of-an-unknown-traveler from the other side",
        "M1O8WXF9": "You'll come across a few crossbow-wielding enemies in a lower area a bit farther on. Head down and kill them, then jump over onto the next buttress leading up. From above you can get the drop on a group of Thralls lying in ambush on the nearby roof. After expunging them, jump attack the other Thrall hanging on the wall, landing you right on top of @red-bug-pellet[Red Bug Pellet x3]. At the other end of this walkway you'll find @undead-hunter-charm[Undead Hunter Charm x3]",
        "S5659AN7": "Head back to the lower area where you fought the crossbow-wielding enemies. Continue down the path and take a left into a room where you can grab a @soul-of-a-nameless-soldier. (Watch out for another Thrall ambush)",
        "24AL6OFW": "Head back outside and continue around the perimeter of the cathedral until you reach a dead end with an @ember",
        "DJWHZLJD": "Turn around and head back a short way to open a set of double doors which lead into the cathedral. Head left once inside and grab the @duel-charm from in front of a poison-spewing statue",
        "3X4GG1L4": "Continue through a dining room until you reach a lift which you can take to open a shortcut to the Cleansing Chapel bonfire. Head back up the lift and take notice of the enemy lurking above before taking the long set of steps (to the right of the balcony) down to grab a @deep-gem",
        "YD38AL3K": "Head back up and out onto the balcony. Run around the perimeter, optionally killing the giant (he's easier to kill from the area below), and grab the @soul-of-a-nameless-soldier, @lloyds-sword-ring, and @exploding-bolt[Exploding Bolt x8] (or save them for later if the giant is giving you trouble)",
        "0MM8U6R2": "Head through the door at the other end of the balcony. Take the first left and head across a bridge-like platform (watching out for Thralls and ceiling slimes) and grab the @seek-guidance miracle",
        "FB21U16H": "Head back across the bridge and up the ladder to grab an @ember",
        "I4C91L9Q": "From here, drop back down to the balcony where the giant attacked and head down the steps again. This time, head straight down to reach a room with a Mimic. Kill (or charm) it for the @deep-braille-divine-tome. Remember, giving this to Irina and buying any of the spells it unlocks will lock you into the bad ending of her quest. I recommend saving this for Karla, unless you really want some of the spells",
        "EG2URGIM": "From the Mimic, head down more steps and continue straight to a room with a @deep-accursed that drops @aldrichs-sapphire upon death. There is also an @ember in this room",
        "7ESYXP0H": "Head back to the previous room and turn right to head through a door and up some steps. If you are embered, @longfinger-kirk will invade your world. He drops @barbed-straight-sword + @spiked-shield",
        "5YUAAV25": "Kill the giant if you haven't already (the one in the larger open area) and grab the @soul-of-a-nameless-soldier and the @maiden-set",
        "A98Y0W2N": "Open the double doors next to where the giant was, head down some steps, and open another set of doors. Out here you can pick up the @saint-bident and @homeward-bone[Homeward Bone x2]",
        "RVIOKUUZ": "Head back up through both doors and walk forward through the water until you can turn left up some steps. You'll find a @large-soul-of-an-unknown-traveler against the wall",
        "U2RPU0GE": "Travel over to the other end of the large, open, water-filled area to the other giant. Kill this one and the slimes around him, and you'll be able to grab a @pale-tongue, the @drang-armor-set, and the @drang-hammers",
        "1DQ4LUUP": "Head up the steps behind where the giant was sitting, kill the enemies around the shrine, and grab the @ember from the ledge that overlooks the water-filled area",
        "O0R5WFCK": "The @ring-of-the-evil-eye[Ring of the Evil Eye+1] is behind the shrine",
        "LHSFA3YL": "If you turn to face the giant shrine, you should see a door to your left. Head through and you'll reach some double doors that open back out to a previous area (near the graveyard). Staying inside the cathedral, continue past these doors to reach Siegward (if he is not here, follow the first part of the next step). Grab @duel-charm[Duel Charm x3] to the right of him. (Note: If you've already gone to the upper rafters where you drop down to Rosaria, the following encounter will not occur)",
        "GT4UQMID": "If Siegward is not there, leave the Cathedral completely (go to Firelink Shrine and come back) and then head back into the Cathedral through the large blue double doors you just opened. You will notice that a new bridge has been activated and Siegward is standing next to it. Talk to him and then cross the bridge to trigger a cutscene where it is revealed it was really Patches. Depending on if you killed the Giants or not, you'll either have to fight one or nothing happens",
        "ASAKL648": "After being lowered, turn directly around and head through the door that's directly underneath the area Patches was standing. Head through a door and down several sets of steps to open the final shortcut to the Cleansing Chapel bonfire",
        "SI871EGC": "As you head back through the shortcut you just opened, you should notice another door on your left immediately after you leave the chapel. Open it to reveal a lift, which will take you up to an area where you can climb a ladder to an enemy that drops the @deep-ring when killed",
        "BN6ETYJZ": "You can drop onto a new roof through the hole in the wall just past the enemy you just killed. Head up the roof, turn right, and begin heading down this long roof. Eventually you'll be able to turn right and head down another roof to reach an @arbalest. Head back up to the long roof and head to the end to grab a @pale-tongue",
        "VOR0WT92": "The @ring-of-favor[Ring of Favor+2] is at the very opposite end",
        "CH3KR8GB": "Turn around from the Pale Tongue location and head back down the long roof. Eventually, you'll be able to turn right and head back inside to the rafters of the cathedral. Head right first and grab the @blessed-gem near the wall",
        "306TW9XD": "Zig-zag your way across the rafters towards the other end, sticking primarily to the right. Eliminate the knight with the crossbow and drop down near where he was standing to a platform with a couple of candelabras. Drop again and you'll find yourself back with Patches. He will be waiting here and pretend to not be responsible for what just happened. Tell him \"You know who I am\" to receive the Prostration gesture. You can speak with him again for a @rusted-coin. You can then buy @catarina-set from him. (Note: Purchasing this armor means Patches will not be a rescue option for Greirat later in Irithyll of the Boreal Valley)",
        "Z7V4PJ6T": "Before leaving this area, continue on up the nearby stairs. Kill all the enemies and the non-agressive one will drop the @red-sign-soapstone. Continue on and you'll eventually find yourself at the Rosaria's Bed Chamber bonfire. Speak with Rosaria to obtain the @rosarias-fingers covenant. For now, do not offer her any Pale Tongues if you intend to do Sirris' quest line. We'll continue this side quest closer to the end of the game",
        "YZ5HMLOP": "If you killed Longfinger Kirk when he invaded earlier, you can grab the @armor-of-thorns-set nearby",
        "F1DD89P4": "If Patches didn't spawn at the Cathedral, return to Firelink Shrine and purchase the Tower Key if you haven't already and head into the Tower behind Firelink Shrine now. As you ascend the lift to the top, you'll hear a door shut behind you. Grab the @fire-keeper-soul at the top, if you haven't before, and then come back down to encounter Patches. He has locked the door and you'll need to drop down from the bridge onto coffins to escape",
        "WOVSFT9E": "Head back to the Tower and get to the bridge that overlooks Firelink Shrine. Drop down onto the roof and move around the roof until you find some windows you can go through. An @estus-shard will be on the rafters (you may have done this already in the Firelink Shrine section)",
        "9IHT6CZZ": "While on the roof, you can hear @pickle-pee--pump-a-rum-crow crow. Trading a @homeward-bone will get you the Call Over gesture and the @iron-bracelets (you may have done this already in the Firelink Shrine section). For the other trade options see the @- page",
        "SUFAUGY3": "With the Fire Keeper Soul, you can heal Dark Sigils that you have in order to completely get rid of your Hollowing Level. If you are following Yoel/Yuria's quest line, however, don't do this until the postgame or you'll end up angering Yoel/Yuria",
        "ZFJMNGI7": "Refresh Firelink Shrine and head to the upper right to find Patches now located there. He'll ask for forgiveness; refuse to receive the Prostration gesture and a @rusted-gold-coin. You can then buy Siegward's Armor Set from him. Leaving Firelink Shrine and returning will allow Patches to be in his squatting position. Interact with him to receive the Patches Squat gesture",
        "WYO47DVA": "If you can't buy Siegward's Armor Set yet, head to the Cleansing Chapel and check the well at the entrance, where Siegward should trapped. After speaking to him, return to whatever location Patches is at for you and buy the armor",
        "HS2PIQO6": "Return to the well Siegward is in and throw his armor down to him to receive the Rejoice gesture",
        "SWMOQ5EP": "Head back up the steps past where you defeated the second giant. Turn right at the giant shrine. If you are embered, you can summon @anri-of-astora and @horace-the-hushed (both behind the shrine) as well as @sirris-of-the-sunless-realms (before the fog door). Defeat the @deacons-of-the-deep and you'll receive @small-doll + @soul-of-the-deacons-of-the-deep",
        "V6D95ADO": "Rest at the bonfire so you can pick up the @archdeacon-set near the altar"
      }
    },
    "farron-keep": {
      "name": "Farron Keep",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Farron+Keep",
      "steps": {
        "7VASPSLB": "After defeating the Deacons of the Deep, return to Firelink Shrine to find Anri and Horace. Talk to Anri to progress the questline",
        "8NA7KG02": "Farron Keep is a poisonous swamp, hence it might be a good idea to buy a few Purple Moss Clumps from the Shrine Handmaid. In addition, any item with the Quickstep weapon art (such as the Dagger, also sold by the Handmaid) could be useful as well since it allows you to move unimpeded through the deeper sections of the swamp",
        "6S5UO2M0": "Leave the bonfire and enter Farron Keep proper. Turn right and in the back corner you will find @purple-moss-clump[Purple Moss Clump x3]. Continue into the swamp from there to find @iron-flesh between some trees",
        "5R17WO7T": "Optionally, and only if you are on bad terms with Yuria (healed the Dark Sigil or attacked her) and are embered, head further into the deep swamp on the right. Dark spirit @londor-pale-shade will invade your world among the Basilisks there. If you kill him, you will receive the @manikin-claws",
        "MNQK6319": "The @magic-stoneplate-ring[Magic Stoneplate Ring+1] is also in the deep swamp here",
        "TG9OZ3PP": "Head back to the Farron Keep bonfire, turn left this time and in the back corner you will find @ragged-mask surrounded by slugs",
        "JONMYYNX": "To the right you will see a @titanite-shard in the swamp",
        "BQUUH1IE": "Turn right, head around the island, and in front of the partially sunken stone tower you will find an @estus-shard",
        "NFB3VVJ7": "To the left and past a large fire you'll see a @titanite-shard before the steps leading up",
        "CYTHTR0J": "Instead of taking these steps, turn left once more to find @prism-stone[Prism Stone x10] on a corpse on an island",
        "AUXP1NR2": "Farther out (closer to the stone wall) you will find @stone-parma",
        "A6LOIK1L": "From there go in direction of the rock wall on the right to find @rotten-pine-resin[Rotten Pine Resin x4] against a tree",
        "7VMN9EBH": "Follow this rocky wall to the left to reach a small structure guarded by a darkwraith. The @sages-coal is on a body inside this structure, granting you Crystal, Blessed, and Deep infusions",
        "LTB3V6GT": "Continue on, sticking closely to the rock wall on your right until it opens to some steps, which you follow up. Go through the archway and interact with the first altar (on your left) to extinguish the flame",
        "EZJKOFLX": "Go back through the archway and pick up @rotten-pine-resin[Rotten Pine Resin x2] ahead, then go back down the steps on this side",
        "BE2LJ7B6": "As you arrive at the bottom of the steps, continue straight on into the deeper swamp until you find yourself between two ramp-like segments of a sunken bridge",
        "UFF0YO3S": "Ascend the one on your right for @purple-moss-clump[Purple Moss Clump x4]",
        "D3YIY1MQ": "Turn around, cross over to the other ramp, and pick up the @greatsword",
        "36EGVBPK": "From there, look left to locate a stone pillar, behind which you pick up a @titanite-shard",
        "4DJLKHFU": "Looking at the fire from there, head to your right towards the rock wall and follow that to the next fire to discover a set of steps as well as another @titanite-shard. (If you stay back as far as possible while picking it up, the @ghru-leaper on the other island should not notice you)",
        "Z5F4YTHO": "Head up and stick to the right to find @purple-moss-clump[Purple Moss Clump x2] between two trees",
        "7VMRYP6P": "Snuff out the flame on the second altar",
        "39IQ8AAU": "The @dark-stoneplate-ring[Dark Stoneplate Ring+2] is behind the wall",
        "JWUQHRH7": "Cross the bridge with the three Ghrus to find the Keep Ruins bonfire",
        "HWI53DK5": "The @wolf-ring[Wolf Ring+1] is outside near the wall of this building",
        "US3FG69U": "Go down the ramp on the other side and enter the round structure to the right, where you will find an @undead-bone-shard amidst some slugs",
        "LDBTUG56": "From the other side of this structure you can see a ladder surrounded by slugs. Go a bit past this ladder for now and pick up @wolfs-blood-swordgrass at the foot of the tower",
        "C14T7KY4": "Step onto the nearby island to find a cauldron of Estus Soup as well as the @sunlight-talisman",
        "6KG9J3ME": "Return to the ladder you just passed and climb it",
        "5UAK48SF": "Once you reach the top, go right (don't enter the tower) to find a Crystal Lizard on the other side who drops a @twinkling-titanite",
        "O4IZAZFY": "From the lizard go back from where you came and just before the stairs turn right to find an illusionary wall (look for an archway on the wall). Behind it you will find @dreamchasers-ashes",
        "1E1A8LDD": "Enter the room to find the Old Wolf of Farron and his bonfire. Interact with the wolf to receive the Legion Etiquette gesture and join the @watchdogs-of-farron covenant",
        "OF0F2YE1": "Return to Firelink Shrine and give the Dreamchaser's Ashes to the Shrine Handmaid. Reload the area and Sirris will once again be there. Talk to her to receive the Darkmoon Loyalty gesture",
        "TLB6WCMJ": "Warp back to the Old Wolf of Farron bonfire and go up the tower with the elevator",
        "5V5B7L8H": "Turn right and on the top you can fight a @stray-demon to obtain @soul-of-a-stray-demon",
        "3KC4TQ5V": "Around the Stray Demon you will find a @greataxe, an @ember, and another @ember",
        "UUWMOOHV": "Turn around and move towards the gate. Just before and to the right of the gate is a spot where you can drop down. Do so and move along, dropping down a few ledges",
        "LTGEYEWJ": "After getting to the other side of the gate go left and up to find a Crystal Lizard who drops a @heavy-gem",
        "A4YSPFSC": "There are two Crystal Lizards before the dead dragon who both drop a @large-titanite-shard",
        "1YL8SL3W": "In front of the dragon you can also find @lightning-spear",
        "1CRMSFX6": "Right next to it is the @dragon-crest-shield",
        "WNDFAASH": "Go back to the ladder that led up the tower and go down. (Note: If you don't want to use a Homeward Bone you can go back by going up the gate and dropping down to the other side)",
        "TLKXK8LU": "Facing away from the ladder, proceed to a small island with a @titanite-shard next to a fire",
        "R9BF4NA7": "From the next small island with a fire, make a quick detour to the left where the @nameless-knight-set is stashed between a tower and a rock wall. (Going there may trigger an invasion by Yellowfinger Heysel, but she spawns out of immediate reach on the other side of the tower)",
        "RM7IJ4KF": "Up next is @titanite-shard[Titanite Shard x2] in front of a tree. (If the Elder Ghru in the area is giving you trouble, you can try luring him into one of the fires for some extra damage)",
        "VXDHU21C": "Keep heading closely along the rocks on your left until you reach a way up. (If dark spirit Yellowfinger Heysel is already in your world, you might encounter her in the area upstairs)",
        "LS5TVROF": "Go up to the altar and extinguish the last of the three flames. To the right, on the other side of the small stone wall, you'll find a @rusted-gold-coin",
        "ZQKMBR5R": "Go through the archway on the left to find @homeward-bone[Homeward Bone x2]",
        "KUFEVHI9": "Head up the steps, fight the Ghru Leaper (if you sprint up, you should be able to backstab him), and go down on the other side. If not triggered previously, @yellowfinger-heysel will invade you here, provided you are embered. If this is your first time defeating her, you'll gain @heysel-pick + @xanthous-crown",
        "I8PX7Z6P": "In the swamp area below, you will encounter some @basilisk. If you want to beef up your curse resistance, equip Archdeacon Set and Maiden Gloves",
        "NW2KN2GO": "Take a right at the bottom of the steps and then enter an alcove on your left with a @large-soul-of-a-nameless-soldier",
        "0KPY0WBM": "Turn around and head to the other side of the steps. Tucked away in the dead end between rocks and tower is another @large-soul-of-a-nameless-soldier",
        "CPSNBIF5": "Turn around yet again and make your way across an island. To the right between two rock formations you can find @repair-powder[Repair Powder x4]",
        "WYOIXS9J": "Go right into a cave, where you will find the @golden-scroll",
        "ZSMVVYPX": "Make sure to give this scroll to Orbeck at Firelink Shrine to keep him from leaving (it doesn't have to be the Golden Scroll in particular, but this is the first one available)",
        "3FEL9EA7": "Right next to the scroll is the @antiquated-set in a chest",
        "EH7S1WZT": "Warp (or walk straight along the outer walls) to the Keep Ruins bonfire. Standing at the top of the ramp leading down from there, drop off to the left, directly onto a @titanite-shard",
        "6OEY07PJ": "From here you will see a Great Crab and a white birch when looking towards the wall. Kill the crab for the @lingering-dragoncrest-ring. (Lure the crab close to the white birch tree and the Giant of the Undead Settlement will assist you using his greatarrows)",
        "6OJWJ2VO": "Around this area you will find @gold-pine-bundle[Gold Pine Bundle x6], an @ember, a @large-soul-of-an-unknown-traveler, a @soul-of-a-nameless-soldier, a @young-white-branch, another @young-white-branch, and the @crown-of-dusk",
        "JAWHJ1ZC": "Follow the wall to your right and you'll eventually find the @sages-scroll, guarded by Ghrus near several dead mushrooms",
        "OBKRA431": "If you continue in the same direction along the wall you will encounter three Elder Ghrus. Lure these enemies out one by one to get @black-bow-of-pharis and @phariss-hat. In the middle you can find a @poison-gem. (If you do not wish to engage the Elder Ghrus in melee, you can instead whittle them down using ranged weapons from up by the Keep Ruins bonfire)",
        "C1NJSIDC": "Warp (or backtrack) to the Keep Ruins bonfire, go down the ramp and through the opened gate. Straight ahead is a @shriving-stone",
        "E721H5DU": "Follow the path and once you're in an open area turn right and enter the structure to get to the Farron Keep Perimeter bonfire",
        "B7DTSCYT": "Take the path farther into the structure to encounter a Ravenous Crystal Lizard who drops @titanite-scale[Titanite Scale x2]",
        "M2RCEZCC": "Right next to him is the @great-magic-weapon sorcery",
        "BA6TGOCZ": "Open the shortcut back to the Road of Sacrifices",
        "8D8NDE5B": "Turn around and go back in direction of the bonfire. After the first set of stairs you can go through the broken wall on the left and drop down",
        "30T26B6U": "Here you can find @atonement and on the right side of the cliff you can find a @hollow-gem",
        "TQ3XRFIP": "If you want to be able to access @yuria-of-londor and the Usurpation of Fire ending, make sure that, before proceeding to fight the Abyss Watchers, you have Drawn Out True Strength 5 times with Yoel and then reload Firelink Shrine so that Yoel dies and Yuria appears. You can talk to her to receive the Dignified Bow gesture and buy the @londor-braille-divine-tome",
        "2URUKCJW": "Before fighting the Abyss Watchers, remember to give Orbeck the @golden-scroll and/or @sages-scroll",
        "PRM781YN": "Buy Aural Decoy, Farron Flashsword, Pestilent Mist, and Spook from Orbeck. Then talk to him multiple times to obtain the @young-dragon-ring, the Silent Ally gesture, and the @slumbering-dragoncrest-ring",
        "6WG4UH4T": "Go back to the Farron Keep Perimeter bonfire and leave the building",
        "WSJ8Z6YA": "To the right of the Ghrus you can find an @ember",
        "H851D8LC": "Go up the right side and on the hill you will find @black-bug-pellet[Black Bug Pellet x3]",
        "7UNT0Q25": "You can summon @yellowfinger-heysel in Farron Keep right after the Keep Ruins bonfire, but only if you have offered a Pale Tongue to Rosaria, which will block you out of Sirris' quest line, so I recommend saving this part for another playthrough. You'll gain the Proper Bow gesture after her summon",
        "QH3FUFGM": "@black-hand-gotthard can be summoned and will grant you the By My Sword gesture. His summon sign is up the first set of stairs",
        "MJZ7VGQ5": "@sirris-of-the-sunless-realms can also be summoned here. Her sign is to the left of the mausoleum entrance",
        "47OCHWWE": "If you are on good terms with Yuria, you can also summon the @londor-pale-shade and gain the Duel Bow gesture. His summon sign is right next to the Farron Keep Perimeter bonfire. (Note: In order to be able to summon two phantoms at the same time, you have to use @dried-finger. Black Hand Gotthard and Londor Pale Shade can also be summoned for another later fight, so don't worry about getting all the gestures here at once)",
        "CEI5Z7KY": "Defeat the @abyss-watchers; receive @cinders-of-a-lord + @soul-of-the-blood-of-the-wolf",
        "IICX8B28": "If you have collected all the items around the three white birch trees so far, you'll find the @hawk-ring back where the giant was in Undead Settlement"
      }
    },
    "catacombs-of-carthus": {
      "name": "Catacombs of Carthus",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Catacombs+of+Carthus",
      "steps": {
        "PNUQ72EW": "Return to Firelink Shrine and talk with Hawkwood to receive the @farron-ring. (If Hawkwood isn't sitting on the stairs inside the Shrine, reload the area until he does)",
        "T9MJ0DBM": "Reload the area, and Hawkwood should no longer be present. @hawkwoods-shield will be on the ground by a gravestone outside of Firelink Shrine, near where the dog spawns",
        "N3AXZIKQ": "Eygon of Carim should also now be in Firelink Shrine. Exhaust his dialogue now so he is available for a boss fight later on",
        "KP4I5KF2": "Warp back to the Abyss Watchers bonfire, enter the Catacombs of Carthus and on the left side you'll find @carthus-rouge[Carthus Rouge x2]",
        "1T29TPMH": "The @ring-of-steel-protection[Ring of Steel Protection+2] is on a pillar below the bridge",
        "FHI65M0D": "After crossing the bridge, go up the stairs to the left and then immediately turn around to your right. There is @soul-of-a-nameless-soldier at the end of the way",
        "XGST8KIL": "Turn back the other way, and follow the path down a ladder. At the bottom you'll find another @soul-of-a-nameless-soldier",
        "K1QE5CU0": "Follow the path and in the room with the pillars strike the wall on the right side to reveal an illusory wall. Behind it you'll find the @carthus-pyromancy-tome",
        "BIF3HI1N": "Back in the pillar room you can find a @sharp-gem on the right side",
        "AEHVKYUY": "In the next room you'll find @titanite-shard[Titanite Shard x2] in the leftmost corner",
        "O7N9H3OS": "Before heading down the giant staircase that a skeleton ball will eventually begin to roll up and down, there will be a hallway to the left you can take. Head down this way and you'll eventually run into Anri, who claims to be looking for Horace. Exhaust the dialogue",
        "T3UCQWFK": "Head out onto the platform next to Anri, kill a Crystal Lizard for a @twinkling-titanite, and grab @bloodred-moss-clump[Bloodred Moss Clump x3] on the right side",
        "PTEAAGP9": "Go back to the giant staircase and on the left side is an @ember",
        "GETW6WP3": "Once arriving at the bottom of the giant staircase, you'll notice a skeleton with a hat on its head hiding right in the corner of the next room. Kill it and the next time the skeleton ball hits the bottom gate, it'll explode and reveal an @undead-bone-shard",
        "NICN10YP": "In the next hallway you can find the @carthus-milkring on the right side behind some big vases",
        "TTIHW1F5": "The @thunder-stoneplate-ring[Thunder Stoneplate Ring+1] is also between these vases",
        "HGB9XFDC": "On the corpse in the bone-ridden hallway is a @large-soul-of-an-unknown-traveler. At the end of the hallway is an @ember. (Be careful, there is a hole in the ground)",
        "FRED6360": "In the corner where the second skeleton ball spawns is a @large-titanite-shard",
        "IA5RCXU0": "Activate the Catacombs of Carthus bonfire in the left hallway",
        "VRBPQ5LN": "Go down the stairs, turn right and right again to get to a hallway with @skeleton-wheel. On the left wall is @titanite-shard[Titanite Shard x2]",
        "XRTZ2VW7": "At the end of the hallway you will find the @carthus-bloodring",
        "OUSIUZJ8": "Go back to the main room to find @titanite-shard[Titanite Shard x2] on a corpse that is lying by a pillar",
        "IX6RQFPM": "To the right of the corpse is an illusory wall. Hit it and go up the stairs to find the @grave-wardens-ashes",
        "0GQP3D19": "Turn around and go towards the other side, finding a @large-titanite-shard on the right side",
        "P1R7E369": "Kill the skeleton with the hat and the skeleton ball will break revealing a @dark-gem",
        "QE8KNGJM": "Stay on the second level and you'll find @carthus-rouge[Carthus Rouge x3] next to the archer skeleton",
        "UVGX4PRO": "Go down to the pillar room and head inside the tunnel just past the illusory wall to find a Crystal Lizard who drops a @fire-gem",
        "WBXZ8O5X": "Exit the tunnel to find @yellow-bug-pellet[Yellow Bug Pellet x3] on the left side",
        "XWL236WT": "Go to the gate with the skeletons to find a @large-soul-of-a-nameless-soldier and @black-bug-pellet[Black Bug Pellet x2]",
        "5O72B4CX": "Open the gate and get the @ember on the other side",
        "N621Z65T": "Go through the tunnel that leads to the main pillar room. If you're embered, you'll be invaded by @knight-slayer-tsorig. Regardless of who wins the fight, you will receive the My Thanks! gesture. Defeating him will grant you the @knight-slayers-ring",
        "YPX5UIJX": "Turn around and just before the bridge go right and follow the path to Anri. Once again you'll be asked whether you have found Horace. You haven't yet, but we're about to. Be sure to exhaust the dialogue",
        "EE5JS826": "Get down to the left of Anri and follow to the path the next boss",
        "TK8AKV9T": "Defeat @high-lord-wolnir; receive @soul-of-high-lord-wolnir",
        "ONMLAAPN": "During the battle you had an opportunity to grab the @grave-warden-pyromancy-tome, but should you have not picked it up then it can now be found in the far left corner of the goblet room. Cornyx can't read this pyromancy tome, so you'll have to wait until you free Karla to turn it in"
      }
    },
    "smouldering-lake": {
      "name": "Smouldering Lake (Optional)",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Smouldering+Lake",
      "steps": {
        "24611Y19": "From the High Lord Wolnir bonfire go back to the bridge and hit the supports to create a ladder",
        "0WDHV901": "Head down to find a room with a @demon who drops a @soul-of-a-demon after killing him",
        "4FF1DXWD": "In the same room on the top level is a Mimic which drops the @black-blade",
        "6QAHTR35": "Go down the stairs to find @large-titanite-shard and @large-soul-of-a-nameless-soldier",
        "VA5O7A6R": "Go down the stairs to find @old-sages-blindfold + @witchs-ring",
        "9L3PIED1": "Activate the Abandoned Tomb bonfire",
        "AES5I80D": "When heading towards the Old Demon King fog door, a Carthus Sandworm will appear out of the ground. Align the worm between the ballista and yourself, such that the ballista kills the worm while you are standing in a terrain safe spot. You'll gain @lightning-stake + @undead-bone-shard",
        "FQGFZ052": "Around the front part of the lake you will find the @shield-of-want as well as 5 pickups containing one @large-titanite-shard each",
        "VZG8GRTL": "Obtain the @speckled-stoneplate-ring which is located on a corpse in Smouldering Lake behind a brick wall. Go along the left wall when looking from the fog door to find the wall. You will need to trick the ballista into destroying the brick wall",
        "WCRT09RJ": "Follow the left wall farther into the lake to find a @chaos-gem and around the middle of the lake you will see a brick floor; stand on it to trick the ballista into destroying the floor to unlock a shortcut but do not decend into it",
        "XOPB77CY": "Go up the slope to the right of the fog door for another @large-titanite-shard as well as the Demon Ruins bonfire down the stairs",
        "E3TLVGPD": "On the top floor go into the left corner to find an @ember",
        "I4RGTTOJ": "Go right and fight some Grus to find an @ember. From here you can see an item, an @estus-shard. It's not recommended to jump for it, we'll get it later",
        "JQ8GMX70": "Head back into the first room, go down the stairs and in the back left you'll find another @undead-bone-shard",
        "79KGQVFW": "In this room take the left hallway on the other side (not the one with the rat). Hit the illusory wall at the end and pick up the @black-knight-sword",
        "HV76L0LQ": "The @flame-stoneplate-ring[Flame Stoneplate Ring+2] is in a corner",
        "S6PVMFVA": "Go out, right and follow this way until you get to a room with some stairs. Take a left before the stairs, then right to find an @ember. Now go up the stairs to find the Old King's Antechamber bonfire",
        "QC9A6UZI": "From the bonfire go into the nearest hallway and follow the right path until you find a Crystal Lizard who drops a @chaos-gem",
        "EYJQKG3Q": "Take the straight path from the Old King's Antchechamber bonfire and you'll find the @izalith-pyromancy-tome on the ground",
        "OZE9BWBJ": "In the Old King's Antechamber there is an illusory wall to the right of the stairs in the corner. Activate it and then move down the hallway that has loads of Writhing Rotten Flesh enemies on the ceiling and grab the @estus-shard on a body at the end",
        "5LV4UIYK": "Turn around and take the left to get back into the main room. From here go into the hallway that is in the left corner (the one with the rat)",
        "DVIXFY7N": "Take the right before the rat, hit the illusory wall straight ahead. Take a left and pick up the @quelana-pyromancy-tome. Only Karla can read this tome",
        "YBZ2E9OZ": "In the lava-filled room right next to the tome you can find @toxic-mist and @white-hair-talisman",
        "0Q5L2Y36": "Head back and keep on taking right turns until you reach a hallway downstairs with a big rat. Reveal an illusory wall on the left side of this hallway and grab @large-titanite-shard[Large Titanite Shard x3] from a chest",
        "B9PYXIEU": "Behind the chest is another illusory wall. Drop down a ledge to get the @izalith-staff",
        "CEELQMB6": "In the room with the Basilisks is a @titanite-scale",
        "KE73ZE65": "Before going up the stairs take a left when you get to them and you'll encounter @knight-slayer-tsorig. Regardless of who wins the fight, you will receive the My Thanks! gesture (if you haven't gotten it before). After killing him, he will drop @fume-ultra-greatsword + @black-iron-greatshield. If this is your first time defeating him, he will drop the @knight-slayers-ring as well. Also, the @black-iron-set can be obtained via the @shrine-handmaid",
        "EQBMITVJ": "In this lava room you can get @sacred-flame and an @ember",
        "67B3XKOA": "Go back to the stairs and cross the bridge for a @soul-of-a-crestfallen-knight",
        "F51L35XB": "Go up the ladder, then another ladder and drop down to the right to find the @dragonrider-bow",
        "GWP6UFIO": "Exit the tunnel at the top to get back to the Smouldering Lake. Drop down on the left to find @homeward-bone[Homeward Bone x2] next to the wall",
        "AG3HLVB8": "The @bloodbite-ring[Bloodbite Ring+1] is near the ballista",
        "LZPUN4W0": "After shutting off the ballista, you'll notice some cliffs that you can drop onto that will eventually lead you back to the lake. You'll also land right in front of a cave you haven't explored (you can also get here just by running to the right from the Abandoned Tomb bonfire). Head inside to find two Crystal Lizards who drop @twinkling-titanite and @titanite-chunk",
        "3OW45OK9": "You'll also find Horace, who has succumbed to his Dark Sigils and become hostile. Kill him and he'll drop the @llewellyn-shield. The Shrine Handmaid will also now sell Horace's @executioner-set",
        "UGRNSHTM": "Inside here you will also find @yellow-bug-pellet[Yellow Bug Pellet x2], a @large-titanite-shard, and another @large-titanite-shard",
        "HKA0KNCF": "If you killed Horace but have not yet defeated High Lord Wolnir, you can go back to the Catacombs and speak with Anri above the wooden bridge. Tell of the Smouldering Lake and you'll be given the @ring-of-the-evil-eye. If Wolnir has already been destroyed, Anri will be gone from the Catacombs and you will be given the ring on your next meeting in Irithyll of the Boreal Valley",
        "WVX6DUOI": "Before fighting the Old Demon King you can summon Knight Slayer Tsorig (next to the Demon Ruins bonfire, if you defeated him in Catacombs of Carthus) and Great Swamp Cuculus (in front of the fog door). If the Great Swamp Cuculus survives the fight, go back to the cage in Undead Settlement you found Cornyx in to receive @spotted-whip + @cornyxs-set",
        "JSF55QF1": "Defeat the @old-demon-king; receive @soul-of-the-old-demon-king"
      }
    },
    "irithyll-of-the-boreal-valley": {
      "name": "Irithyll of the Boreal Valley",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Irithyll+of+the+Boreal+Valley",
      "steps": {
        "FXYITP46": "When first arriving in Irithyll, you'll battle one of @sulyvahns-beast, which drops @pontiffs-right-eye, and then move through a force field to the Central Irithyll bonfire. If you run past the beast, it will despawn and you will encounter it later in a more challenging area. Light the bonfire and return to the middle of the bridge and Sirris' summon sign should be there if you've been following her quest. Activate it and you'll enter her world and have to fight @creighton-the-wanderer. After defeating the invader, visit Firelink Shrine and she will give you @mail-breaker + @silvercat-ring for the troubles",
        "NI996X25": "Just before the barrier you will find one @homeward-bone",
        "15O099CL": "Around the fountain you can find @large-soul-of-a-nameless-soldier, @rime-blue-moss-clump, and @soul-of-a-weary-warrior",
        "QV2O0MI3": "Go up the stairs and to the left on the railing is a @soul-of-a-weary-warrior",
        "40CP9SPI": "Going straight and up the two stairs to the right is a @large-titanite-shard",
        "P49GGL5H": "On the fountain up ahead are @budding-green-blossom and @large-soul-of-a-nameless-soldier",
        "R0OGNQ3X": "A bit farther and to the left next to a tree is @rime-blue-moss-clump[Rime-blue Moss Clump x2]",
        "OF5APHJT": "Go up to the @burning-stake-witch to get the @large-titanite-shard",
        "ESB5KNWG": "To the left of the main road is a Crystal Lizard who drops a @twinkling-titanite",
        "NWN22G7L": "Attack the railing to the right of the lizard to reveal a staircase. Go down and to the right is a @large-titanite-shard",
        "GVEC4WSJ": "Kill the Evangelist in the area below for @dorhys-gnawing",
        "R1ZAVTYY": "Pick up the @witchtree-branch, open the gate, and go back to where the lizard was",
        "Q5KP544L": "Just before the crossroads is a @large-soul-of-a-nameless-soldier",
        "LJDEB5JZ": "Take the right here and pick up the @large-titanite-shard from a corpse",
        "8IN17LYO": "Now take the left at the crossroads and before going up to the church is a @large-titanite-shard to the left",
        "ELQR4VDC": "Go upstairs and inside, light the Church of Yorshka bonfire, and pick up @proof-of-a-concord-kept from a corpse in the back",
        "W50N4IZG": "Anri will be in the same room. Exhaust the dialogue to receive the Quiet Resolve gesture. You will also be given the @ring-of-the-evil-eye if not obtained previously. Next is the major dividing point in Anri's story: From here on out, if you want to follow this quest line to its conclusion, follow Anri A. If you want the Usurpation of Fire ending, follow Anri B",
        "EP9SW2MV": "Anri A Progress: (Slayer of Aldrich Ending) Look towards the side of the room that has some stone statues. One of these is actually a pilgrim in disguise sent by Yuria. Slash away at the statues until you find him and make sure he's dead. He'll drop the @chameleon sorcery for you as well",
        "CEQWZQR8": "Anri B Progress: (Lord of Hollows Ending) Do nothing in regards to the pilgrim",
        "7WMHBDBA": "From the bonfire go down the stairs and turn right to find the @roster-of-knights. Go out onto the graveyard and look for a @fading-soul near the cliff. To the right near a tree is another @fading-soul",
        "C9NQ6DCB": "In front of the large tombstone at the end of this path is @homeward-bone[Homeward Bone x3]",
        "SB169GVV": "An @undead-bone-shard is located behind the grave. If you helped Sirris, @creighton-the-wanderer will invade you here if you're embered. Killing him will gain you the @dragonslayers-axe and allow you to grab Creighton's @mirrah-chain-set on the bridge where you used Sirris' summon sign",
        "IH9OWRVS": "From the entrance to the graveyard go down the stairs on the left and left again to get to @kukri[Kukri x8] and @rusted-gold-coin",
        "BUCPA767": "Now take the other way to get to a dark room. On the ground level of this room is @blue-bug-pellet[Blue Bug Pellet x2]",
        "GWFBJ1BY": "Up on the rafters is a @shriving-stone and in the chest on the mid level is @yorshkas-spear",
        "ONHVNBT3": "The @covetous-gold-serpent-ring[Covetous Gold Serpent Ring+1] is on a platform below the broken railing outside",
        "95B7JALJ": "Go down to the stairs and right just before the lake. The wall in the first right tunnel is an illusory wall with a Crystal Lizard behind it who drops @twinkling-titanite",
        "72O5JTZ9": "Past the other tunnel and next to the tree is a @blood-gem",
        "SLCC99AB": "Jump into the lake from here for a @ring-of-sacrifice",
        "DPDUNY7A": "In the lake you'll find a bundle of @green-blossom[Green Blossom x3], a @large-soul-of-a-nameless-soldier, the @great-heal miracle (it's on the right side of the lake that is below the entrance to Irithyll), another @green-blossom[Green Blossom x3] bundle, and finally an individual @green-blossom",
        "PQUR7ATZ": "Activate the Distant Manor bonfire while you're here, then head back upstairs",
        "HS26Y9WM": "Enter the sewers from the lake and pick up two droppings: @dung-pie[Dung Pie x3] and @dung-pie[Dung Pie x3]",
        "NAXM0FTV": "In the corner opposite some stairs are the @excrement-covered-ashes",
        "2Z54VY3N": "Head up these stairs and you'll find @siegward-of-catarina hanging out by the fire. Exhaust his dialogue and you'll receive the @emit-force miracle, a @siegbrau, and any gestures you missed from his first encounter",
        "IFPCXG0X": "The first Silver Knight you encounter in the next room drops @large-titanite-shard + @divine-blessing. Head up the stairs on the left to find two more Silver Knights who both drop @large-titanite-shard[Large Titanite Shard x2] as well as three chests containing the @leo-ring, @smoughs-great-hammer, and a @divine-blessing",
        "6LHZYZTZ": "The @wood-grain-ring[Wood Grain Ring+2] is outside in an alcove to the right",
        "G0L45DII": "If you are on bad terms with Yuria (healed the Dark Sigil or attacked her or killed the assassin in the Church of Yorshka) and are embered, dark spirit @londor-pale-shade will invade your world after the Silver Knights' room. (Note: If you are currently eligible for the invasion by @creighton-the-wanderer, you will have to eliminate that one first to get Londor Pale Shade to spawn.) If this is your first time killing him, you will receive the @manikin-claws. If you defeated @londor-pale-shade in both of his invasions, then you can pick up the @pale-shade-set near Yuria's location in Firelink Shrine",
        "TL8L2NG6": "Next to the stairs here is a @large-soul-of-a-nameless-soldier and farther up on a railing is a @large-titanite-shard",
        "NA9OC52F": "You can take the elevator here and open the gate for a shortcut",
        "53GW0UFI": "In the next room up ahead you can find @blue-bug-pellet[Blue Bug Pellet x2] on a corpse and if you go down the ladder at the top you can find a @large-titanite-shard",
        "I18GLMHX": "Go outside to find a @soul-of-a-weary-warrior",
        "FECTTOOR": "Go down the left side of the fog door and get the @ember from a corpse and open the shortcut",
        "PL5GQZJN": "Go up to the fog door again and drop down to the altar for the @ring-of-the-suns-first-born and a @lightning-gem",
        "ZZN0KXEV": "The @chloranthy-ring[Chloranthy Ring+1] is behind the altar",
        "0MG3C490": "The wall to the left of the altar (with your back to it) is an illusory wall with the @magic-clutch-ring behind it",
        "2NVJLEHY": "Turn around and take the exit opposite of you to get the @soul-of-a-weary-warrior from where the Fire Witch is as well as another @soul-of-a-weary-warrior above it",
        "R0YEN45Z": "Return to Firelink Shrine and talk to @greirat-of-the-undead-settlement. He will ask to pillage Irithyll. Only do this after confirming Siegward is in Irithyll OR if Patches still has Siegward's armor. If you have neither, Greirat will perish and his ashes can be found in the sewer area",
        "0HVTAA5L": "If you did not purchase Siegward's armor you can send Patches out to rescue Greirat. Refresh Firelink Shrine after sending Greirat out and Patches will ask you where he went. Tell him and Patches will head out to rescue Greirat",
        "3ZATUWPX": "@black-hand-gotthard can be summoned for the Pontiff Sulyvahn fight. If this is the first time you've summoned him, you'll receive the By My Sword gesture",
        "1MG88FKW": "If you are following the Yoel/Yuria quest line, you can summon the @londor-pale-shade. If this is the first time you've summoned them, you'll receive the Duel Bow gesture",
        "V9H2FBJV": "@anri-of-astora can also be summoned instead of the Londor Pale Shade",
        "ZI4WO6L1": "Defeat @pontiff-sulyvahn; receive @soul-of-pontiff-sulyvahn",
        "B7PRTZK2": "Yuria/Anri B Progress: Head back to Firelink Shrine after defeating Pontiff and talk to Yuria and she'll discuss that the \"marriage ceremony\" is almost complete",
        "L3ML98XH": "Greirat should have also returned from his pillage",
        "TD4AW059": "Go right after exiting from the Pontiff bonfire to find a @large-titanite-shard",
        "AVVG9X1A": "In the same area are two Crystal Lizards who drop @twinkling-titanite",
        "1M2826BG": "Go to the left of the courtyard and enter the dark section. At the back you'll find the @dark-stoneplate-ring",
        "YD7JMQ30": "Enter the cathedral from the top of the dark section, unlock an elevator shortcut back down to Sulyvahn's room, and cross the bridge to the other side to find a Mimic who has the @golden-ritual-spear",
        "FH0A83SD": "The @ring-of-favor[Ring of Favor+1] is at the other end",
        "DBWEU1PI": "Cross the bridge and go around to the other side to find a Crystal Lizard who drops a @simple-gem",
        "SNH0EPYW": "Exit the same way you entered and go right to find a @large-titanite-shard on a corpse",
        "7WT4A0O2": "On the courtyard itself you can find a @soul-of-a-weary-warrior, a @large-titanite-shard, an @ember, and another @ember",
        "D6F68B9R": "At the end of the courtyard are two NPCs and one of them drops the @drang-twinspears",
        "1J6FFH8V": "Once you enter the building after the giant courtyard, there will be an illusory wall on the left side that reveals a long ladder down. Head down and defeat two of @sulyvahns-beast (killing them grants you the @ring-of-favor) and interact with @archdeacon-mcdonnell to gain the @aldrich-faithful covenant. You can also find @human-dregs, a @deep-gem, and the Water Reserve bonfire in this room",
        "VOQE5SM3": "After going up the stairs in the building where the illusory wall was you can find a @titanite-scale on a corpse in one of the outside corners",
        "BMS2Y5AC": "On the right side of the right tower where you can walk up to the archers is a @large-titanite-shard",
        "L4NPS0BO": "As you make your way up the building with the Silver Knight archers, you can drop down to a roof below and find the @easterners-ashes",
        "FXTP65HN": "Before you enter the hallway that leads to the lift turn around and walk down to the lower tower for a @large-titanite-shard and open the shortcut in the next tower",
        "EAIXJZAK": "As you walk back from the shortcut to the hallway you will see @dragonslayer-greatbow + @dragonslayer-greatarrow[Dragonslayer Greatarrow x5] on a lower platform",
        "P235IC2T": "Anri B Progress: Before activating the lift to Anor Londo, there is a path that goes down in the room before the lever. Here you'll find the pilgrim waiting for you. He'll give you the @sword-of-avowal and tell you Anri is waiting ahead. Head down, picking up the @brass-set along the way, to find Anri's body at the altar. Perform the Rite of Avowal and you'll gain 3 Dark Sigils, granting you the total amount of 8 Dark Sigils you need for the Usurpation of Fire ending. To the right of the altar, you will find the @reversal-ring. Revisit the pilgrim and you will discover he is now dead with the @chameleon sorcery on his body",
        "EU0CAH7A": "Anri B Progress: You can reload the area and pick up @anris-straight-sword from where Anri was lying",
        "KS7Q58KQ": "Anri A Progress: You will find an illusory wall where the path down to the altar would be. You can find the @brass-set and @reversal-ring in the same places",
        "98ZYW47V": "Before the lift is an @ember"
      }
    },
    "anor-londo": {
      "name": "Anor Londo",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Anor+Londo",
      "steps": {
        "VPKRN5AC": "Use the lift to reach the Anor Londo bonfire. Run back down the stairs and you'll be able to see a tower in the distance. Walk across the sky on an invisible floor (don't worry, you can't fall off at the sides) and continue walking straight until lined up with the tower, then walk towards it. You'll find @company-captain-yorshka who will allow you into the @blades-of-the-darkmoon covenant if you perform the Darkmoon Loyalty gesture",
        "Y98P0KEL": "If you drop down the tower you can find @painting-guardians-curved-sword as well as the @painting-guardian-set. Warp back to the Anor Londo bonfire",
        "HXIYFB54": "@havels-ring[Havel's Ring+2] can also be found in the tower",
        "NTUUPXEI": "Anri B Progress: If you didn't get it before, you can return to where Anri's body was to find @anris-straight-sword",
        "0I9GNZ2B": "On the left after going up the stairs to Anor Londo is a @large-soul-of-a-weary-warrior",
        "YN8JDMD8": "On the right platform with the red-eyed knight is a @soul-of-a-crestfallen-knight",
        "3DMUIT7Y": "Head left and you'll find the Giant Blacksmith's corpse with the @giants-coal by his body, granting you Lightning, Simple, and Chaos infusions",
        "PUTUK9WD": "After entering the main hall turn left and next to the Deacons is a @proof-of-a-concord-kept",
        "7D8M6LTN": "On the other side you can find @moonlight-arrow[Moonlight Arrow x6]",
        "LDOQ1Y7D": "In the main room of the castle, you will be ambushed by a @deep-accursed enemy. Defeating him will provide you with @aldrichs-ruby",
        "ORLE21SK": "Looking at the fog door you will find a chest on the left side, surrounded by @rotten-flesh-of-aldrich enemies, with an @estus-shard inside",
        "TPVPF7YT": "Anri A Progress: If you killed Horace in Smouldering Lake, Anri's summoning sign will appear outside in front of the large, golden doors in Anor Londo. Using this sign will cause you to be summoned as a phantom to help kill Aldrich",
        "PLTUQTXP": "Defeat @aldrich--devourer-of-gods; receive @cinders-of-a-lord + @soul-of-aldrich",
        "X6OGM5GY": "After defeating Aldrich, take the elevator up and you will discover the @sun-princess-ring in Gwynevere's Chamber",
        "K6C26WYB": "Anri A Progress: Return to Firelink Shrine and talk to Ludleth who hands you @anris-straight-sword, which was left with him as a thanks to you",
        "VKKCRTLH": "Anri A Progress: Anri has also succumbed to the Dark Sigils and become hostile. If you told Anri of Horace's location in Smouldering Lake, go there. If not, go up the first set of stairs from the Cathedral of the Deep bonfire and take a right then follow the path up the hill. Killing Anri allows you to purchase the Elite Knight Armor Set from the Shrine Handmaid",
        "1OEXVQ0B": "If you are following Sirris' quest and have defeated Aldrich, travel to Undead Settlement via either the Cliff Underside or Dilapidated Bridge bonfire and make your way back to the room before the Curse-rotted Greatwood fight. You will find Sirris' summon sign right before the giant hole that leads to the Pit of Hollows. You'll be summoned to fight @holy-knight-hodrick, who turns out to be Sirris' grandfather. After defeating Holy Knight Hodrick, you will gain the @mound-maker covenant (if not obtained before). The @sunset-armor-set will be available in the Pit of Hollows bonfire area and you will find the @sunset-shield on a grave at the cliff outside of Firelink Shrine (from the Iudex Gundyr bonfire go up the first set of stairs, then right)",
        "TBAC1L67": "After defeating @holy-knight-hodrick, Sirris will return to Firelink Shrine and she will ask to be your knight. Agree and she'll be able to be summoned for the final three main boss fights of the game. Refuse and you'll find her hollow in the Pit of Hollows"
      }
    },
    "irithyll-dungeon": {
      "name": "Irithyll Dungeon",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Irithyll+Dungeon",
      "steps": {
        "W24NORJ5": "Warp to the Distant Manor bonfire, follow the path down, and drop down immediately for a @rusted-gold-coin. Drop farther down to find a @large-titanite-shard behind a pillar",
        "G7XK89NJ": "When you are outside on a cliffside path, @alva--seeker-of-the-spurned, will invade if you are embered. He drops the @murakumo when killed",
        "CHL9S3BU": "The first cell on the left has a @rusted-coin in it",
        "YU0CKW1Y": "The second cell on the same side has a @large-titanite-shard",
        "UCBFLRV5": "On the outer path is a @fading-soul",
        "41CQAGJW": "At the end of the path is a @large-titanite-shard",
        "M9IXINOS": "Drop down to the lower level for a @large-soul-of-a-nameless-soldier",
        "WB60K2M7": "Continue down this path and in a cell you'll find the @old-sorcerer-set",
        "57I3H3JU": "The last cell will contain an enemy who drops @great-magic-shield",
        "EG4CP4V0": "Go back to the upper level, cross the bridge in the middle, and the last cell on the right contains a @large-titanite-shard",
        "77NR591J": "Turn around and enter the next cell to find @pale-pine-resin[Pale Pine Resin x2] near the destroyed wall",
        "C3UN8W9E": "Go through the rooms and enter the last cell on the other side to find @jailbreakers-key, then reverse direction and open the shortcut door",
        "TJBTUJSF": "Cross the bridge back to the other side, head left, and open the window grate at the end of the hallway using your newly acquired key. Drop down the ledge here to find the @bellowing-dragoncrest-ring on the left",
        "QQ7NKC5S": "After jumping down to the bridge head left for @homeward-bone[Homeward Bone x2]",
        "U70BBQPF": "Re-enter the dungeon via the door here and kill the Crystal Lizard who drops a @titanite-scale",
        "7CQV0Q6K": "The next room on this hallway holds a @simple-gem in a small side room on the right",
        "F172B9PF": "Retrace your steps all the way outside, then head downstairs and kill the Mimic in the next room for an @estus-shard",
        "F8C9IOZI": "Go down the hallway in the next room to find a @soul-of-a-weary-warrior",
        "33CG0OKA": "If you want you can go back to the entrance, jump down the first hole, and quickly take out the Crystal Lizard for a @titanite-chunk (the giant only becomes hostile if you attack it, so you can safely take out the lizard). Otherwise wait until you've defeated the giant. If you are patient you can kill the giant right here. In front of the giant is a @soul-of-a-crestfallen-knight",
        "R2L1YW0G": "If you don't want to deal with the giant right now go back to where you found the Soul of a Weary Warrior and drop down the hole",
        "DLYAX1SH": "Before the gate is a @pickaxe",
        "B0Z6SID7": "Go up the tunnel for a @soul-of-a-weary-warrior",
        "FFS70UMB": "You'll find two chests at the end of a hallway. The chest on the left is a Mimic with the @dark-clutch-ring. After you have taken the @old-cell-key from the right chest, you will be ambushed by several @basilisk. The Old Cell Key will be used to free Siegward later",
        "L5N9OVEF": "Turn around, enter the tunnel on the left, and in the next room find @dung-pie[Dung Pie x4]",
        "ZO8U5BB9": "After entering the big room with the jailers go left for a @large-titanite-shard",
        "VQJEI6DV": "Continue through the tunnel and near the lift is a dragon statue that has the @dragon-torso-stone. This area will be used later to access the Archdragon Peak once you have the Path of the Dragon gesture",
        "VT441YOB": "Go up the lift and find a @large-soul-of-a-nameless-soldier next to the shortcut to the main dungeon",
        "U4TWU1YT": "If you jump off the elevator midway, you'll find the @lightning-blade miracle",
        "BAMN68NW": "Return to the room with several Jailers. To the left, you'll discover a cell containing five @wretch and the @profaned-coal, which grants Dark, Blood, and Hollow infusions",
        "PXFDALBE": "In the middle of the room is an @ember. On the right side is another @ember",
        "9D28IH75": "In the short tunnel on the left is a Mimic with @titanite-scale[Titanite Scale x2]",
        "UKOUM04P": "In the cell on the far left side, you'll find the @xanthous-ashes and the @dusk-crown-ring",
        "GPJKNQPK": "The middle cell on the right holds @karla, but is locked. You'll find the @jailers-key-ring in the next zone",
        "R443QIVB": "In front of Karla's cell, you'll find the @alva-set (this set only appears if you have killed Alva at the start of the dungeon)",
        "FKBXO7Q8": "Head outside and before crossing the bridge go left for a @large-soul-of-a-weary-warrior"
      }
    },
    "profaned-capital": {
      "name": "Profaned Capital",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Profaned+Capital",
      "steps": {
        "2YZHEXV7": "At the first bonfire you will find poor Laddersmith Gilligan's dead corpse. You'll receive the Stretch Out gesture and an @undead-bone-shard from examining it",
        "AQH6AEDD": "Climb back down, go outside using the hole in the wall, and take the ladder to the left to find @rusted-coin[Rusted Coin x2]",
        "V2P4SNCJ": "The @magic-stoneplate-ring[Magic Stoneplate Ring+2] is at the end of the broken stairs leading down",
        "1UDG9W5X": "Use the plank ramp next to the Gargoyle that ambushes you to enter a room with two Crystal Lizards who drop @twinkling-titanite. In the back left you can find a @rusted-gold-coin",
        "QOUTOPLB": "Go outside onto the planks and on the right side you can find @blooming-purple-moss-clump[Blooming Purple Moss Clump x3]",
        "ZFJLB0SS": "In the toxic swamp below you can find the @cursebite-ring and a @poison-gem (in the cave behind where you drop down), a @purging-stone (in the open), and a @shriving-stone (behind the building)",
        "LO9ELBYI": "Enter the building on the ground floor to find @hand-ogre (I recommend using a weapon with bleed effect and/or @carthus-rouge). If you kill one, you will receive the @eleonora axe. In the same room is @purging-stone[Purging Stone x3]",
        "ELYTM2VB": "Climb the ladder, take the stairs to the top of the building in this area, and kill the court sorcerer to receive @logans-scroll",
        "AZEM9B6Z": "The @flame-stoneplate-ring[Flame Stoneplate Ring+1] is down below, on top of the ground floor entrance",
        "G76XAW78": "There is @poison-arrow[Poison Arrow x18] on the right side of the roof",
        "HKL5QDWZ": "Fall down from the top of the roof into the building for the @wrath-of-the-gods miracle",
        "M42GSIK4": "In this room, you will find the @court-sorcerer-set and a Mimic chest containing the @court-sorcerers-staff",
        "SW6ADW9M": "Go down the stairs here to find some @rubbish",
        "RA5NH7ND": "On the roof where you fought the court sorcerer, look torwards the stairs against the wall. You should see an open window which you can jump into. This leads to the cell that Siegward is stuck in. Open it and exhaust his dialogue, he'll give you a @titanite-slab for saving him. The @covetous-gold-serpent-ring is in the same room",
        "V4UXXTZD": "Return to the roof and follow the stairway up. At the top of the stairs, attack into the alcove directly in front of you to unveil two invisible Jailers. At the end of the hall is the @jailers-key-ring, which is used to free Karla",
        "ZTRR78J1": "Exit through the hole in the wall to end up in the giant's cell. If you haven't killed him yet, do so now",
        "NEXWJJTW": "In this room you can also pick up the @profaned-flame pyromancy, a @large-titanite-shard, and another @large-titanite-shard",
        "13SRAPFL": "Exit the room through the tunnel on the left, go up the elevator, and open the shortcut to the Irithyll Dungeon bonfire",
        "TBT2XB6X": "The @covetous-silver-serpent-ring[Covetous Silver Serpent Ring+1] is on a platform in the elevator shaft",
        "EKA9A5FZ": "Go back to the giant's cell and exit the opposite way for a Mimic chest with @dragonslayer-lightning-arrow[Dragonslayer Lightning Arrow x10]",
        "WLFCTPUQ": "Go up the ladder and jump from rafter to rafter for @lightning-bolt[Lightning Bolt x9]",
        "PY8H1PX6": "With the giant dead, take out the Crystal Lizard for a @titanite-chunk and pick up a @soul-of-a-crestfallen-knight (if you haven't done so before)",
        "0763KQ32": "From here you can also go to where Karla's cell is and send her to Firelink Shrine. Give her the two remaining pyromancy tomes and, with some effort, you can also give her the @londor-braille-divine-tome and @deep-braille-divine-tome instead of corrupting Irina",
        "THDAHZ48": "Teleport to the Irithyll Dungeon bonfire and open the last cell on the right in the first section for a @rusted-gold-coin. Now drop down before the window you opened before, turn around, and open the first cell on the left which contains the @prisoner-chiefs-ashes",
        "4Y3E20KQ": "Go back to the Profaned Capital bonfire",
        "Q2QFZD2R": "Take the ladder on the wall down and cross the bridge for @onislayer-greatarrow[Onislayer Greatarrow x8] and a @large-soul-of-a-weary-warrior farther on",
        "F0TSFM79": "From the bridge drop down onto the structure below to find a matching @onislayer-greatbow",
        "ZPKNGU1I": "Drop farther down and loot a @rusted-coin. At the end of the platform you can find another @rusted-coin",
        "2RYYHF07": "Before the fog gate go right to find three chests. The leftmost chest is a Mimic with the @greatshield-of-glory. The chest next to it is also a Mimic, with @rusted-gold-coin[Rusted Gold Coin x2]. The right chest is real and contains an @ember",
        "T6I9IEAR": "Enter the boss room. If you are following Siegward's quest, a cutscene will show Siegward has come with you to help put his old friend to rest. Defeat @yhorm-the-giant; receive @cinders-of-a-lord + @soul-of-yhorm-the-giant. Speak to Siegward for a @siegbrau",
        "VC0CORJI": "Upon defeating Yhorm, you will probably be teleported to @emma at the High Wall of Lothric (since this is the third Lord of Cinder). Speak with her to obtain the @basin-of-vows. Approach the statue of a beheading knight to start the boss fight against the @dancer-of-the-boreal-valley",
        "QIG2DI24": "If Siegward helped you defeat Yhorm, return to Yhorm's boss room to find Siegward's @storm-ruler + @pierce-shield as well as his @catarina-set. If Yhorm is your second Lord of Cinder simply walk towards the flame on the outside and Siegward will die, dropping the items"
      }
    },
    "consumed-kings-garden": {
      "name": "Consumed King's Garden (Optional)",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Consumed+King's+Garden",
      "steps": {
        "TT2NPRY7": "Defeat the @dancer-of-the-boreal-valley; receive @soul-of-the-dancer",
        "NZLAMJ2Q": "After defeating the Dancer of the Boreal Valley, you can place the basin and climb the ladder to access Lothric Castle",
        "K2JCWO8C": "Take the first left to enter the Consumed King's Garden and pick up a @soul-of-a-weary-warrior",
        "KQQ7W4I1": "Halfway down the elevator, jump off to a platform and then head down the stairs to find an @estus-shard on the right",
        "D8F9AR15": "From here go left and drop down to the stairs to find a @titanite-chunk",
        "SAL6JJR6": "The @sage-ring[Sage Ring+2] is on another set of broken stairs",
        "OE06F1IZ": "To the right of the elevator structure is a @ring-of-sacrifice",
        "EGTCEDBS": "The @wood-grain-ring[Wood Grain Ring+1] is behind the elevator",
        "P04BC6TD": "Around where the slugs are you can find @black-firebomb[Black Firebomb x2], the @claw, the @shadow-set, and a @human-pine-resin",
        "NI8HQUB6": "Below the stairs on the left is a @dark-gem. Go up the stairs for a @titanite-chunk",
        "0ALTIGP8": "On the right side you can find @human-pine-resin[Human Pine Resin x2] and another @titanite-chunk",
        "JYINZCWH": "On the right side of the garden is a door with an elevator. Go up and enter the next room to find a @titanite-scale and a @titanite-chunk. Open the shortcut while you're here",
        "IXGWXBS3": "Take the elevator back down and jump off at the halfway point to find the @dragonscale-ring",
        "OQ7QPUT7": "You can summon @hawkwood for assistance if he has left Firelink Shrine. His summon sign is located on the large platform before the two knights",
        "NCGXP3CF": "Kill the second greatsword-wielding knight outside the boss room to receive the @magic-stoneplate-ring",
        "DQ1B6VFC": "Defeat @oceiros--the-consumed-king; receive @soul-of-consumed-oceiros",
        "5YPDVUE8": "After defeating Oceiros, continue on down and you'll find the Path of the Dragon gesture on a body",
        "JFC6T0V9": "To the left of the gesture is a chest containing a @titanite-scale. Further on is a second chest holding another @titanite-scale. Advance through the illusory wall behind this chest to enter the Untended Graves"
      }
    },
    "untended-graves": {
      "name": "Untended Graves (Optional)",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Untended+Graves",
      "steps": {
        "Y4H2EK95": "From the bonfire go straight to find a @shriving-stone",
        "XQG40664": "Collect the @ashen-estus-ring located to the left from the bonfire",
        "8O7J2J4Y": "Pick up a @soul-of-a-crestfallen-knight near the square centre",
        "SGQ9FO0Q": "Near the left outer wall is a @titanite-chunk",
        "II4YD5TI": "To the right is another @titanite-chunk",
        "UAY6568R": "Kill the two Ravenous Crystal Lizards for four @titanite-scale",
        "6LHNTTRA": "Where the first bonfire was in Cemetery of Ash, you'll be invaded by @daughter-of-crystal-kriemhild if you're embered",
        "5WIQISHW": "Follow the path on the left for a @hidden-blessing",
        "OR6P7V3K": "@sword-master is available to be summoned outside the boss room",
        "V0YO0HX3": "Defeat @champion-gundyr; receive @soul-of-champion-gundyr",
        "YC51JAH9": "In the arena is also the @black-knight-glaive",
        "TASEPS88": "At the very end of the Untended Graves when you reach the alternate version of Firelink Shrine, explore the graves for the @hornet-ring (on the right where Hawkwood's Shield was) and @chaos-blade (where Sword Master was)",
        "NFAM0FJ1": "Above the shrine entrance is a @soul-of-a-crestfallen-knight",
        "7PACI9EC": "Inside Firelink Shrine, you will discover the @coiled-sword-fragment where the bonfire normally is",
        "PXP80V0V": "The @life-ring[Life Ring+3] is behind Lothric's throne",
        "RUHK9E51": "There is another Shrine Handmaid here that sells the @wolf-knight-set, the @priestess-ring, and other merchandise. Unlike the regular Handmaid, she will not respawn if killed, so be careful",
        "W00ZOLUS": "Where Andre normally is, you will find the @blacksmith-hammer",
        "4OPQO7J8": "Activate the illusory wall to where Irina normally is and you'll find the @eyes-of-a-fire-keeper. These can be given to the Fire Keeper to enable the End of Fire ending",
        "SYE6JMY4": "If Yuria of Londor did not spawn in your game, you will find @hollows-ashes where Yoel would normally be",
        "XCTHQRH3": "The @ring-of-steel-protection[Ring of Steel Protection+1] is outside next to the tower"
      }
    },
    "archdragon-peak": {
      "name": "Archdragon Peak (Optional)",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Archdragon+Peak",
      "steps": {
        "Y03YDZAV": "Return to the area in the Irithyll Dungeon with the dragon statue and perform the Path of the Dragon gesture to be teleported to Archdragon Peak",
        "X7GRET1F": "From where you spawn head to the tree for a @soul-of-a-weary-warrior",
        "ALLX1U5N": "At the top of the big rock farther on is a @lightning-gem",
        "BHKLQF5O": "On the left cliff is @homeward-bone[Homeward Bone x2]",
        "0Z6DF4Y5": "A @titanite-chunk is behind some rocks a bit farther on",
        "UOPNQGNE": "Next to the bonfire is an @ember",
        "K1UJ38P5": "To the right of the structure in front of you is a @soul-of-a-nameless-soldier and to the left is a @titanite-chunk",
        "LHSKNJDC": "On top of the structure is the @ancient-dragon-greatshield and in the corner below is another @titanite-chunk",
        "P26G0UPA": "Follow the path to the left of the gate to obtain the @lightning-clutch-ring",
        "DXKM4KHZ": "Defeat the @ancient-wyvern boss and you'll receive the @dragon-head-stone",
        "R09F9DI7": "After defeating the Ancient Wyvern, you will be transported to the Dragon-Kin Mausoleum bonfire",
        "SAIC9LFT": "Return to the entrance of the Ancient Wyvern boss area",
        "2STZHT9L": "In the middle of the arena is a @large-soul-of-a-weary-warrior",
        "08HN0ZKK": "Go to the right and pick up @stalk-dung-pie[Stalk Dung Pie x6], an @ember, and another @ember",
        "L2DBDYGP": "The railing is broken at the end, allowing you to walk along the edge. At the end of the path is the @ring-of-steel-protection",
        "USGMOXL6": "Left of the arena middle is a @large-soul-of-a-nameless-soldier. Go up the stairs and left for @lightning-urn[Lightning Urn x4]",
        "24CDVC60": "Continue down the normal path until you can go left into the dome building to find a @titanite-chunk",
        "QAS02HQT": "Go down the ladder to find @twinkling-titanite[Twinkling Titanite x2]",
        "2AAIP3E8": "Go back to the normal path and on the edge of the platform is @dung-pie[Dung Pie x3]",
        "BGACST0N": "Go up the stairs and get to the top of this building for @titanite-chunk[Titanite Chunk x2] and @lightning-bolt[Lightning Bolt x12]",
        "V9C9R1EQ": "Head to the area where you did the plunging attack, but this time climb up the ladder on the other end for @twinkling-titanite[Twinkling Titanite x2]",
        "4CL8KV8A": "Kill the @drakeblood-knight back at the Dragon-Kin Mausoleum to receive the @drakeblood-greatsword. After killing the Drakeblood Knight, return to the Oceiros, the Consumed King bonfire and run up to the altar where you got the Path of the Dragon gesture to find the @drakeblood-set waiting for you there",
        "GL0K6ED8": "Perform the Path of the Dragon gesture in front of the altar in the Dragon-Kin Mausoleum to receive the @calamity-ring",
        "0CGZ8NMV": "Turn around at the altar and follow the path for a @titanite-scale as well as another @titanite-scale further up",
        "TTS83L2F": "Entering the altar room you can find a @soul-of-a-crestfallen-knight in the back left",
        "FJRHTSXC": "On the right side of the top level is an exit to the exterior with a @titanite-scale on a corpse",
        "0EWSS1TQ": "After going back in you can turn left to activate a shortcut",
        "V13OLU74": "Examine the wooden gate to receive the @dragonslayer-spear",
        "OVCP6PC4": "Proceed down the stairs, follow the path, and climb the ladder near the scaffolding to receive the @thunder-stoneplate-ring",
        "HFWU4PIT": "Go along the path until you come to a Crystal Lizard who drops @twinkling-titanite[Twinkling Titanite x3]. The chest in the next room contains @titanite-scale[Titanite Scale x3]",
        "CROO4MOK": "In the former room you can jump on the small stone altar to pick up the @soul-of-a-weary-warrior",
        "PAYYUIWJ": "As you advance, you will encounter a Wyvern. You can kill this dragon safely by using arrows. Slaying it will reward you with @titanite-chunk[Titanite Chunk x6] + @titanite-scale[Titanite Scale x3] + @twinkling-titanite[Twinkling Titanite x3] and 50,000 souls",
        "XRQ80Y3P": "In the next building, you should encounter the @rapier-champion; slay him for @ricards-rapier. (It's also possible to get a @havel-knight, who drops @dragon-tooth + @havels-greatshield)",
        "QDQ94G96": "In the following room, you will encounter a bell with a lever. Do not ring this bell until you are finished with this zone",
        "SB66EMYQ": "Advance to discover the Great Belfry bonfire",
        "JWLSFR4J": "If you go down the stairs you can find a @large-soul-of-a-crestfallen-knight in the middle",
        "KCGZNY3G": "If he moved on from Firelink Shrine, you can summon @hawkwood at the bottom of the stairs outside the the Great Belfry bonfire. He will assist you to get to the top of the stairway with loads of enemies in the path. Use the Path of the Dragon gesture at the altar at the very top of the stairway (Hawkwood will show you where) and you'll get the @twinkling-dragon-torso-stone",
        "FJL2SJNO": "On the way up the hill to get the Twinkling Dragon Torso Stone, you will find the @dragon-chasers-ashes off to the left side",
        "SRM427D2": "@havels-ring[Havel's Ring+1] is in a corner behind the structure halfway up the hill",
        "FA0W3UHF": "Go down the hill and through the structure on the left to end up at a ladder. Next to the ladder is a chest with @twinkling-titanite[Twinkling Titanite x3]",
        "16NM5Z8T": "Climb the ladder to discover @havel-knight standing in front of a dead dragon. Kill him for @dragon-tooth + @havels-greatshield. Next to the dragon is a @titanite-slab",
        "EQR975QJ": "To the left of Havel, you can drop down a ledge to find the @great-magic-barrier miracle",
        "5ZDZTRLS": "After defeating Havel, you can find @havels-set near the @stray-demon above the Old Wolf of Farron",
        "8DTJXZBN": "Head back to Firelink Shrine and talk to Andre. He'll give you a message from Hawkwood asking you to come to the Abyss Watchers bonfire to settle things. Head there and battle @hawkwood. If you win, you gain the @twinkling-dragon-head-stone. If you lose, Hawkwood takes your @twinkling-dragon-torso-stone. You can battle him as many times as you like until you beat him",
        "O5YA1LNJ": "Ring the bell to unlock the next boss battle",
        "HAT4WTHT": "Defeat the @nameless-king; receive @soul-of-the-nameless-king",
        "I6GGGWTK": "After killing the Nameless King turn around and pick up the @ember from the corpse in the other room",
        "0XPADUB2": "On the path towards the mausoleum you'll find a @titanite-slab and farther on the @dragonslayer-set",
        "6UE9YIL4": "The @covetous-gold-serpent-ring[Covetous Gold Serpent Ring+2] is on one of the side stairways"
      }
    },
    "lothric-castle": {
      "name": "Lothric Castle",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Lothric+Castle",
      "steps": {
        "667EHS28": "@greirat-of-the-undead-settlement will request to pillage Lothric Castle. If you allow him, he will die on this trip as there is no method to saving him. His corpse with @greirats-ashes will be found later in the Grand Archives, enabling all of his wares at the Shrine Handmaiden and unlocking @lightning-urn, @splintering-bolt, and @exploding-bolt. If you send him out, talk to @unbreakable-patches, as he will ask where Greirat goes. He will then leave and come back later with a hidden blessing after you defeat a boss",
        "AGX86JJX": "Advance past the three Lothric Knights to the Lothric Castle bonfire, picking up the @soul-of-a-crestfallen-knight along the way",
        "URV5NHEF": "In the next room, you will find the @prayer-set in a chest",
        "MN8A3I1W": "On the railing to the left is a @titanite-chunk",
        "MAUR041Q": "Continue outside and enter the room on the right. There will be a Winged Knight with twinaxes and a @twinkling-titanite behind the ladder. Climb the ladder and there will be an illusionary wall to a room with the @winged-knight-set and @sacred-bloom-shield",
        "HEJZRVUQ": "Go outside again and at the fork go left for a @titanite-chunk",
        "POR1TAFY": "Go up the right stairs, down, and left for a @large-soul-of-a-weary-warrior",
        "0VFS0MME": "On the other side is @titanite-chunk[Titanite Chunk x2]",
        "1I2MCJED": "Get back to the main path and in the next area you will find the Dragon Barracks bonfire",
        "VU0CYQMY": "In a corner by the bonfire is an @ember",
        "K2CIN5Y8": "Head up the stairs to the left to find a Lothric Knight and a corpse containing the @greatlance",
        "LEV1FJAP": "Starting at the Dragon Barracks bonfire, go up the stairs and to the bridge where the two @lothric-wyvern are. You can kill a wyvern using a bow, causing the second to die as well. Additionally, you can target the @pus-of-man at the wyvern's feet, this will cause the Lothric Wyverns to despawn. Alternatively, you can kill these mobs with melee later",
        "4550VIHG": "Run almost all the way across the bridge and drop off at the end. An @undead-bone-shard is underneath the bridge",
        "2FOC8EV0": "Drop down and pick up @twinkling-titanite[Twinkling Titanite x2] (on the left side), a @titanite-chunk, and another @titanite-chunk",
        "NJBV9015": "Break the barrels and boxes in the next room to reveal @lightning-urn[Lightning Urn x3]",
        "5KVK4BMO": "Kill the Crystal Lizard outside for @twinkling-titanite[Twinkling Titanite x2]. (Note: If you kill this lizard and then die or reload before killing the second one in this area, that one will disappear permanently)",
        "T3931KDF": "Farther and on the right is a @large-soul-of-a-nameless-soldier",
        "YGQJ2I6N": "Go up the small stairs, kill the Winged Knight, and pick up @sniper-crossbow + @sniper-bolt[Sniper Bolt x11] behind him",
        "QGVOMC9J": "Circle back to the bridge and drop down at the near end for a @titanite-chunk",
        "W11IKAT8": "Continue left until you can enter a room with a @large-soul-of-a-nameless-soldier and a @raw-gem",
        "VR36HQ62": "Go downstairs to encounter a @boreal-outrider-knight in a cellar. After killing it, you will receive the @irithyll-rapier. In this room you will also find four chests containing @twinkling-titanite[Twinkling Titanite x2], a single @twinkling-titanite, a @titanite-scale, and the @spirit-tree-crest-shield",
        "LOU4UUV3": "Take the path right across where the wyverns would spit fire and on the left in the next room is @black-firebomb[Black Firebomb x3]. Go up the ladder and on the edge is a @large-soul-of-a-nameless-soldier",
        "V8WB9UHA": "Kill the Pus of Man for @titanite-chunk[Titanite Chunk x2] + @ember[Ember x2]",
        "I744WYG3": "Turn around and take the exit on the same level to find a @titanite-chunk, a Crystal Lizard who drops @twinkling-titanite[Twinkling Titanite x2], and a @titanite-scale at the end. (Note: If you have died or reloaded since killing the first lizard in this area, the second one will have disappeared permanently)",
        "Y5MUV0M9": "The @life-ring[Life Ring+2] is on a ledge below the Titanite Chunk",
        "O83ZQ1Z5": "Now that the wyverns are dead you can pick up these items here in peace: @lightning-urn[Lightning Urn x6], a @refined-gem, an @ember, and another @ember",
        "LHD5RJWQ": "Enter the room with the ladder again, go up the stairs, and at the top you'll find a Mimic with @titanite-scale[Titanite Scale x3]. Next to it is a @pale-pine-resin",
        "8S1NMA0K": "Exit to the right for another @titanite-scale",
        "MX3MEZ7W": "Continue to the next room for a lever. Pull this lever to open the gate underneath the wyverns",
        "TCJ6ORXW": "On the edge you can find a @large-soul-of-a-weary-warrior",
        "4IP4HRXZ": "An @ember can be found left of the stairs leading up",
        "A6K60ZBQ": "After clearing your way to the roof, you will encounter the entrance to the Dragonslayer Armour boss fight. Opposing this entrance, you will find a shortcut elevator to the entrance of Lothric Castle",
        "7E05PM6B": "Next to the shortcut is also a @sunlight-medal",
        "4SXC9DAH": "Facing away from the Dragonslayer Armour bossfight entrance, a doorway lit by torches is to the left. Proceed through the door and up the stairs. On the right is @rusted-coin[Rusted Coin x2] as well as a chest with a @titanite-scale",
        "D825WB15": "Turn around and exit using the door you can see. You will find the @red-tearstone-ring on a body to the right. Drop off the ledge to find @caithas-chime",
        "9R8SVNAS": "The @thunder-stoneplate-ring[Thunder Stoneplate Ring+2] is at the back end of the roof slightly above the chime",
        "IE9N0DOS": "Facing away from the Dragonslayer Armour bossfight entrance, head to the right and drop off the ledge to kill the @pus-of-man for @titanite-chunk[Titanite Chunk x2] + @ember[Ember x2]. Next to it is a @soul-of-a-crestfallen-knight",
        "JXLBDOVE": "Inside the building, you will find a Mimic chest containing the @sunlight-straight-sword. In the same room, you will find a corpse with the @braille-divine-tome-of-lothric",
        "YEAYSRIE": "The @dark-stoneplate-ring[Dark Stoneplate Ring+1] is outside on the balcony",
        "ZSRE3FNG": "Facing away from the Dragonslayer Armour bossfight entrance, head to the right and use the ladder on the building to climb up it. You can find a @titanite-chunk on the side facing the fog door",
        "5CANGWUX": "Head over the roofs to the windows of an opposite building. Climb down the ladder and you will find the @knights-ring",
        "Q8G7TW15": "Continue across the bridge to reach the Altar of Sunlight. Pray at it to receive the Praise the Sun gesture and offer @sunlight-medal for the @warrior-of-sunlight covenant. The chest contains @titanite-scale[Titanite Scale x3]. Open the door revealing a shortcut back to the Dragonslayer Armour area",
        "21N26OSH": "@eygon-of-carim can be summoned for the Dragonslayer Armour fight if you have not purchased any dark miracles from Irina and talked to him in Firelink Shrine so he disappears from there. His summon sign will be available in the chapel to the right of the boss area",
        "Q73C4FUX": "@sirris-of-the-sunless-realms can be summoned for this fight if you are friendly. Her summon sign is below the second set of stairs",
        "CDQRW5YP": "Defeat the @dragonslayer-armour; receive @soul-of-dragonslayer-armour",
        "EHBU8ZDR": "If @eygon-of-carim has left Firelink Shrine, his dead body can now be found in Irina's original cell in the Undead Settlement, containing @mornes-great-hammer + @moaning-shield. You can then purchase @mornes-set from the Shrine Handmaid",
        "BJBRUYZW": "There are two ends to Irina's side quest depending on your actions. (Note: If option B didn't happen yet check back after the Twin Princes fight)",
        "Z86TGJOJ": "Irina A: By giving her just the @braille-divine-tome-of-carim and @braille-divine-tome-of-lothric, or by giving her all 4 Tomes, but not buying any dark miracles, you can make Irina a Fire Keeper. Just buy all her standard spells, plus Med Heal, Tears of Denial, Force, Bountiful Light, Blessed Weapon, and Magic Barrier. (If you want the Saint's Ring, be sure to purchase it now, as she will no longer offer it later.) She'll move to the bottom of the tower to the left of Firelink Shrine after you refresh the world and will now act as a Fire Keeper. If you did give her the Londor and Deep Tome instead of Karla, they will be on the ground beside her and you can now give them to Karla",
        "27OHW4JM": "Irina B: If you gave Irina the @londor-braille-divine-tome or @deep-braille-divine-tome and bought ANY of these spells (Deep Protection, Gnaw, Dark Blade, Vow of Silence, or Dead Again), she will have disappeared for you sometime in the game from her normal location in Firelink Shrine. She would then be outside near the Iudex Gundyr fight area with Eygon. Eygon will believe you have killed her and is hostile. Upon killing him, you see that Irina is still actually alive, but the corruption has begun for her. This is an alternate way of Morne's Armor Set being available for purchase. After Irina returns to Firelink Shrine, buying all the dark miracles listed above will fully corrupt her and she'll no longer act as a vendor to you. Equipping Morne's Gauntlets allows her to believe you to be Eygon and she'll ask to be killed. Do so and you can give her ashes to the Shrine Handmaid to sell her miracles"
      }
    },
    "grand-archives": {
      "name": "Grand Archives",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Grand+Archives",
      "steps": {
        "SB4QMJ07": "From the Dragonslayer Armour bonfire, facing the Grand Archives go right downstairs to find a @titanite-chunk",
        "7YFDG30F": "In the first area, you will find the Grand Archives bonfire with @black-hand-gotthard's corpse nearby, containing @grand-archives-key + @gotthard-twinswords. (Note: This body will only appear once three Lords of Cinder, namely the Abyss Watchers, Aldrich, and Yhorm, have fallen)",
        "NLFXMA9I": "Once inside the Grand Archives, you will notice a Crystal Sage. Killing him will give you the @crystal-scroll",
        "YZO3FSYZ": "If you have given @orbeck-of-vinheim all four scrolls and bought every spell he offers, he will tell you he is departing. You'll now be able to summon him for the Twin Princes fight",
        "5IB8XUS2": "On the left side of the archives is a Crystal Lizard who drops @crystal-gem + @twinkling-titanite",
        "P3Q7F86R": "From the lizard go right, then take the first left for a @soul-of-a-crestfallen-knight",
        "ZNBFOACT": "Now go up the stairs and right to find a @titanite-chunk",
        "IDHDRVY3": "You will encounter an altar with four Scholars. After killing them, you can dunk your head in wax which will temporarily prevent the curse hands from harming you",
        "FGSB2WF2": "Nearby you will find a Lothric Knight. In the room following him you will find the @crystal-chime",
        "C9LD2AEJ": "Go back outside. On the left is a @titanite-chunk. Then drop down for another @titanite-chunk",
        "QE6TFCZL": "When standing before the altar turn around and on the right you'll see a @titanite-scale on the bookcases",
        "H84GWLKJ": "Advance into the dark room, which has two Crystal Lizards who drop @twinkling-titanite + @chaos-gem and @twinkling-titanite[Twinkling Titanite x2] as well as a corpse with a @soul-of-a-nameless-soldier",
        "2ZZW52QS": "Against the wall you will find a lever which will unlock a room containing @witchs-locks and @power-within",
        "R61426K0": "On the top level of the dark room is a @titanite-scale",
        "UOCI8DQS": "Leave the dark room and you will encounter a ladder which you can kick down to open a shortcut to the bottom floor",
        "SLJBDIZT": "Take a right before the ladder to find a @titanite-chunk",
        "R3NY0QGG": "On the left is a Crystal Lizard who drops @twinkling-titanite[Twinkling Titanite x2]",
        "2H9WACP8": "The lever in the middle between the bookcases will unlock a room near the first wax altar containing a Titanite Slab",
        "9U7T9TJR": "Go outside to find @homeward-bone[Homeward Bone x3]",
        "TRHSG2BQ": "Inside and up the left stairs is another wax altar and a @titanite-chunk",
        "N1KTHQ6S": "Near the broken railing where a single Scholar is standing, drop down onto the bookshelf below to find a @titanite-scale and then roll off these onto bookshelves even farther below for the @avelyn",
        "BZOT8REL": "Return to the first wax altar, turn around, and on the back right is now a path that was revealed by pulling the second lever. Grab the @titanite-slab in the chest",
        "N8QGZ8K4": "Go back to the upper level and continue along. After ending up at the top, go left, and in a corner is a @titanite-scale",
        "OFEQ8P5T": "On the same level is a wall in the back left with gates. Hit it to reveal a room with a @boreal-outrider-knight. Defeat it for the @outrider-knight-set. Exit through the back for the @soul-stream sorcery",
        "RXHNMO9X": "Exit the illusory wall room, turn left, and next to the ladder in a corner is a @titanite-scale",
        "QK01ZSVB": "Climb down the ladder and you'll see a @shriving-stone by the railing",
        "6545LAJL": "Before crossing the bridge, pull the lever to the right to open a passage containing the @scholar-ring",
        "6SN5L85F": "Cross the bridge and take the elevator to the ground floor. Pull the lever to reveal a shortcut that returns you to the entrance",
        "ASM5VALV": "If you intend to send @greirat-of-the-undead-settlement on his final journey, this is a good time to do so. You will be able to pick up his ashes soon",
        "5WRRB5DD": "Returning to the bridge, there is a broken railing on the right. Drop down to find a Crystal Lizard with @titanite-scale[Titanite Scale x2]. Use the elevator shortcut to return and then proceed upstairs",
        "FADYWQ6N": "In the back of the room with the four Archive Scholars is a @large-soul-of-a-crestfallen-knight. In the chest to the left of the exit is @titanite-scale[Titanite Scale x3]",
        "HPLPT0KI": "In the next room is a Crystal Lizard with @twinkling-titanite + @refined-gem. The @fleshbite-ring will be to the right of it",
        "NEB63DEB": "On a rooftop with a landing is a wall with some broken segments and a @titanite-chunk",
        "WRF2RXHN": "Continue along the rooftops and go up the left for a @soul-of-a-weary-warrior",
        "K22M9RTM": "On the big roof to the left are two Crystal Lizards who drop @twinkling-titanite + @heavy-gem and @twinkling-titanite + @sharp-gem",
        "HCOJKFNL": "Drop to the lower platform with the Corvians and go into the small room to the right for a @hollow-gem. Go outside and to the right for a @titanite-chunk",
        "ZBBGG47W": "Go past where the Corvians were and jump to the lower platform for @titanite-scale[Titanite Scale x3] and @greirats-ashes if you sent him out to scavenge",
        "8JZYLNXK": "Go back to the roof where the two Crystal Lizards were and stick to the right wall. After dropping down to another roof you will find a @titanite-chunk",
        "HMYH4BVR": "Continue sticking to the right wall until you get to a broken window you can enter. Inside you'll find the last @undead-bone-shard and an @ember. You can also kick down the ladder here for a shortcut",
        "81ORNX99": "Go all the way to the other side of the archives for @titanite-chunk[Titanite Chunk x2] on a corpse out on the balcony",
        "49ABZTIJ": "On the path you probably noticed a door. Step outside and you will encounter three NPCs: @black-hand-kamui, @daughter-of-crystal-kriemhild, and @lion-knight-albert. Killing them will reward you with @onikiri-and-ubadachi, the @sages-crystal-staff, and the @golden-wing-crest-shield, respectively",
        "B6O2MIZ7": "On the stairs is a @large-soul-of-a-crestfallen-knight",
        "J783HOYD": "Continue up the stairs and you will find an elevator shortcut to the Grand Archives bonfire",
        "5E6KL633": "At the very top of the Grand Archives, you will see a series of barricades leading to the Twin Princes fight. Turn around and go up the stairs. On the railing around the left is a @soul-of-a-crestfallen-knight",
        "TU5KM6FZ": "Go up the other roof where the three Gertrude's Knights are. You'll find the last @estus-shard on the very back of this roof",
        "Q41CK3OS": "Killing all the knights on the roof awards you a @titanite-slab, but only once",
        "TQIOR3ET": "At the top of the tower you will find the @hunters-ring",
        "45Y1PIU8": "The @lingering-dragoncrest-ring[Lingering Dragoncrest Ring+2] is in an alcove on the side opposite the ladder",
        "L5BKK7RK": "Enter the lower entrance to the building and drop into the cage to receive the @divine-pillars-of-light miracle",
        "K3UXO1AM": "Exit the cage and on the rafters is a @blessed-gem",
        "RU01CG78": "The @sage-ring[Sage Ring+1] is on the lower rafters",
        "DAHOGSNM": "Drop down to the stone rafters and climb down the ladder on the side with the Man-grub. Down here are two chests containing a @divine-blessing and @twinkling-titanite[Twinkling Titanite x3]",
        "5W8UIWV0": "Return to the barricades and fight your way to the top. You will find an elevator shortcut leading to Lothric Castle's Dragonslayer Armour courtyard",
        "NMM1T19Z": "This elevator has a second elevator underneath it. Send the elevator up and take the second elevator down to claim a @titanite-slab",
        "E5FL3AQI": "@orbeck-of-vinheim will be available to be summoned near the large metal door if you gave him all four sorcery scrolls and purchased all available spells",
        "6AA5IRSH": "@sirris-of-the-sunless-realms will be available to be summoned at the fog door if you are on friendly terms",
        "1S86NEZ6": "Defeat the @lothric--younger-prince; receive @cinders-of-a-lord + @soul-of-the-twin-princes",
        "GAQU3T3D": "After beating the Twin Princes, you can find @orbecks-ashes on his body in the Grand Archives if he departed from your Firelink Shrine after you bought all his spells. His corpse will be in a chair up the shortcut elevator inside the archives, on the large wooden balcony just before the stairs that lead to the outside. If Yuria assigned you to assassinate Orbeck, give his ashes to her in exchange for the @morion-blade. This also adds Orbeck's @clandestine-coat to the Shrine Handmaid's inventory",
        "5NJCZURE": "Return to Sirris' grandfather's grave in Firelink Shrine after the Twin Princes fight and you'll find her body with the @sunless-talisman on it. You can also now buy Sirris' @sunless-set from the Shrine Handmaid",
        "77CSI87G": "With Sirris' side quest complete, you are now free to finally continue @leonhard. Head to the Rosaria's Bed Chamber bonfire (you might find a Man-grub in here which drops @heysel-pick + @xanthous-crown) and give her a Pale Tongue. Leonhard should now appear in this room. If not, refresh the world. Exhaust his dialogue, refresh the world again and Rosaria will now be dead with a @black-eye-orb on her body",
        "9GJUGH1Q": "Head to the Aldrich, Devourer of Gods bonfire and take either of the lifts in the room up. The @black-eye-orb will react to this room. Use it and you'll invade Leonhard's world. Kill him for @soul-of-rosaria + @crescent-moon-sword + @silver-mask. You can also now buy @leonhards-set from the Shrine Handmaid. You can give the @soul-of-rosaria to Ludleth for the @bountiful-sunlight miracle. There is no benefit to restoring Rosaria using her soul, as her being dead does not prevent you from offering pale tongues, redistributing attributes, or changing appearance"
      }
    },
    "kiln-of-the-first-flame": {
      "name": "Kiln of the First Flame",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Kiln+of+the+First+Flame",
      "steps": {
        "VDDDB2B6": "Put all the Cinders of Lords back on their thrones if you haven't already and then interact with the Firelink Shrine bonfire to be teleported to the Kiln of the First Flame",
        "VK17AOGJ": "After being teleported, you will find the Flameless Shrine bonfire. As you exit the building, you will find the Kiln of the First Flame. If you return to Firelink Shrine, you will discover the @skull-ring on Ludleth's throne",
        "6R4NMX7B": "If you have 8 Dark Sigils, you can summon @yuria-of-londor and @londor-pale-shade for the Soul of Cinder fight. If Yuria survives, you will be able to pick up @darkdrift + @black-set at her usual location in Firelink Shrine",
        "HHTFAIMU": "Defeat the @soul-of-cinder; receive @soul-of-the-lords",
        "YAOJMGLM": "Ending Guide: Depending on what you've done up to this point, @endings",
        "W8I2GVO0": "Ending 1: If you did not follow the Yoel/Yuria quest line, simply interacting with the First Flame results in the standard \"To Link the First Flame\" ending. You will receive the @trophy---achievement-guide achievement (Note: If you did follow the quest line and still want Ending 1, let the Fire Keeper heal the Dark Sigil first)",
        "TWPLNHHN": "Ending 2: If you obtained the Eyes of a Fire Keeper from the Untended Graves area and gave them to the Fire Keeper, you can use a summon sign next to the bonfire to trigger the \"The End of Fire\" ending. You will receive the @trophy---achievement-guide achievement",
        "IF061YVV": "Ending 3: If you follow the steps to Ending 2, you have a short window where you regain control of your character during the final scene. You can attack the Fire Keeper after the cutscene for a different conclusion, often called the \"Unkindled Ending\". (Note: There is no achievement for this ending)",
        "S5UF5QL9": "Ending 4: If you followed the Yoel/Yuria quest line to this point and have all 8 Dark Sigils (5 from Yoel and 3 from \"marrying\" Anri), interacting with the First Flame will wrest it from its mantle, triggering the \"The Usurpation of Fire\" ending. You will receive the @trophy---achievement-guide achievement"
      }
    },
    "painted-world-of-ariandel": {
      "name": "Painted World of Ariandel (Ashes of Ariandel DLC)",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/Painted+World+of+Ariandel",
      "steps": {
        "1LS1U2X2": "To access the DLC area go to the Cleansing Chapel bonfire to find Slave Knight Gael next to the altar. Talk to him and accept his offer to be transported to the Painted World of Ariandel. (Note: If you have already progressed into The Ringed City, Gael will be gone. To enter the Painted World you can instead touch the scrap of a painting, located under a small candelabrum on the right side of the altar)",
        "NWPPRW8I": "Upon arriving, you'll find @rime-blue-moss-clump[Rime-blue Moss Clump x2] to your left",
        "OCTH69UX": "Exit the cave to find the first bonfire",
        "94YFRV6K": "From the bonfire stick to the left wall until you see a @large-soul-of-an-unknown-traveler next to a hill in the center",
        "DW2I7TX8": "Continue along the left wall until you get to a fly and a @poison-gem",
        "4Q4WB4U7": "Stick to the wall again and follow it until the snow platform breaks. On a corpse is a @rime-blue-moss-clump",
        "WP8NWX5J": "Go along the right wall, past a lone wolf, and up the hill to find a @large-soul-of-an-unknown-traveler and the @follower-javelin a bit farther up",
        "EM8605MF": "Go back to where you dropped off and in the middle of the forest, next to a tree, is a @rusted-coin",
        "RUBAUTJN": "Continue going straight towards the cliff and the Gravetender Greatwolf should attack you. At around 50% he disappears and leaves you with @large-titanite-shard[Large Titanite Shard x3]",
        "QSTL9LLL": "Around where the wolf first notices you is a corpse with a @large-soul-of-an-unknown-traveler",
        "011YODHU": "Under the big rock, where the wolf was on, is a tree with another @large-soul-of-an-unknown-traveler next to it",
        "IXZTIC7Q": "From here follow the cliff and on the part where it juts out is @homeward-bone[Homeward Bone x6]",
        "Z0UFKLYT": "Go towards the tower and with your back to it you can see a @heavy-gem in the corner of one of the structures",
        "OL95YZ30": "Enter the tower. (Note: It might help if you equip the Silvercat Ring for the tower section)",
        "2ZFNCH9T": "On the ground floor is a @soul-of-a-weary-warrior",
        "TZO8BQ5A": "After climbing up the ladder go down the stairs to find the @ethereal-oak-shield",
        "7J2JJ9X9": "On the next set of stairs is a Crystal Lizard with a @twinkling-titanite",
        "IXSE5WHF": "Now go to the top floor and climb up the ladder on the outside to find a @large-soul-of-a-weary-warrior as well as the @captains-ashes on the rafters. Giving these ashes to the Handmaiden enables you to buy three @refined-gem, the @millwood-set, and @millwood-greatarrow",
        "WW2KH997": "From the rafters drop down to the corpse to get the @millwood-battle-axe",
        "5LRGVZMB": "Exit the tower and go around it on the right to find a @blessed-gem",
        "Y3APPNUG": "With your back to the tower entrance head straight towards the hill with the trees",
        "FAIREG6G": "Go up the hill and left to find @millwood-greatbow + @millwood-greatarrow[Millwood Greatarrow x5] next to some Millwood Knights",
        "7XEFDE1Q": "Now take the other available way from the tower",
        "RQH5LPH6": "Upon going up the hill you will be attacked by the Gravetender Greatwolf plus some normal wolves. The wolf again drops @large-titanite-shard[Large Titanite Shard x3]",
        "QCRPNFMA": "Continue this way and the snow will break again. Drop down the ledges and on the last one is a @large-soul-of-an-unknown-traveler",
        "1ODX8A5D": "Go left from here and pick up @black-firebomb[Black Firebomb x2] up the hill. In the maggot pit is the @frozen-weapon sorcery",
        "L5GSQRY7": "Go up to the trees and pick up the @large-titanite-shard on the left wall",
        "Q7WXPNMW": "Now go back to where you dropped off after defeating the wolf and go right to find the Rope Bridge Cave bonfire",
        "J57RISKU": "Cross the bridge and pick up a @hollow-gem to the right of the entrance to the chapel",
        "FP6UUKJX": "Talk to @sir-vilhelm, open the door, and light the Ariandel Chapel bonfire",
        "27LZLAIX": "Talk to Friede two times to gain the @chillbite-ring",
        "TFMI4YIT": "Go back outside, destroy the bridge to create a ladder, and climb it down. At the bottom you can find @rime-blue-moss-clump[Rime-blue Moss Clump x4] on a corpse on the right wall",
        "GXI5AMPW": "Drop down to the roots and go along until you find a Crystal Lizard who drops @twinkling-titanite",
        "5RFQBBGJ": "Stick to the right wall to find an @ember",
        "RLLVV8EI": "On one of the lower roots you can find the @follower-sabre near the cliff",
        "NAR6INWM": "After reaching the frozen lake you can activate the bonfire and rest at it",
        "ZL9MP8X7": "In the lake you can see a frozen Giant Crab. Upon approaching it another one will come out of the lake. Killing both of them rewards you with a @crystal-gem",
        "61KIODRS": "Take the path behind the crab to find @homeward-bone[Homeward Bone x2] up a small hill",
        "2KFKM9AW": "Continue along this path to find a mad tree who guards the @snap-freeze sorcery",
        "HJUI0VBP": "Killing the mad tree also reveals a big ladder on the small hill where the Homeward Bones were. Climb it and the one after that to get to a @titanite-slab",
        "WXVRHPIA": "Continue further and drop down to find a @shriving-stone next to some flies",
        "9S2GKJJ7": "Ignore the ladder up (it leads to the Rope Bridge Cave bonfire) and keep going forward to find a Crystal Lizard who drops a @large-titanite-shard",
        "9ZHYQ80Z": "Continue this way and after sliding down the hill go right. Next to the cliff is a @large-soul-of-an-unknown-traveler",
        "80323G5Y": "From where you slid down take the left path, drop down the ledges, and pick up @budding-green-blossom[Budding Green Blossom x3] on the far side",
        "AFLVL0CF": "Enter the Corvian Settlement and take the right path to find a @large-soul-of-an-unknown-traveler",
        "OX5DH54U": "After climbing up the ladder and entering the house pick up an @ember. There is a Corvian NPC who you can talk to in the kitchen",
        "VBC96VCB": "Exit the house and enter the one on the left to find the Corvian Settlement bonfire",
        "15TLXS18": "Enter the leftmost house on the other side of the bridge to find an @ember",
        "VLF7I813": "Exit the house, go right, and drop off on the right side of the bridge to find a @simple-gem. Open up the gate here if you want and return to the bonfire",
        "IARSPEM6": "Go back to the bridge, cross it, and go up the left side. A bit farther on you can jump from one side to the other to find a @large-soul-of-an-unknown-traveler in a broken wall",
        "S7FY98BO": "Enter the broken structure overlooking the entrance and go left along the wall to find a Crystal Lizard who drops @large-titanite-shard[Large Titanite Shard x2]",
        "8AGZQTTJ": "Go back to the broken structure and jump towards the @crow-quills on the rock",
        "NKYVPIN5": "Enter the settlement again and from the bonfire go to the cemetery gate at the far back and drop down at the cliff. Enter the house with the flies to find a @dark-gem",
        "BLXTEM6L": "Continue along the cliff until you find a @large-soul-of-an-unknown-traveler",
        "OSVI8LTO": "Climb up the ladder, drop down to the bridge, and open the door on the ground floor of the house",
        "GOZP0CZO": "Cross the bridge and pick up the @large-soul-of-an-unknown-traveler on the roof",
        "8NKTPC5D": "Enter the house with the Corvians on top and follow the path up to the roof to find the @crow-talons",
        "G05OX41A": "Climb the ladder on the other house again, enter the tower, and drop down to find the @slave-set",
        "HI7W7HB1": "Enter the tower via the roof again, climb up the ladder, and from the bridge drop down to the right roof below to find @rusted-gold-coin[Rusted Gold Coin x3]",
        "ZUWLNI1V": "Now return to the tower and climb up the ladder once more, cross the bridge, and on the other bridge is a Crystal Lizard who drops a @twinkling-titanite",
        "EUN296Y1": "Go onto the roof of the church to find a @large-soul-of-a-weary-warrior on a corpse at the tower",
        "V7ADZWFX": "Use the back right window of the church to drop down to the rafters and find a @soul-of-a-crestfallen-knight",
        "6RAOH8P9": "The corpse in front of the altar has the @way-of-white-corona miracle",
        "KXGJ014X": "Exit the church and open the cemetery gate",
        "LAZNPVTT": "Instead of entering the library take a right and pick up the @young-white-branch next to the living tree. Farther in the back is @rusted-coin[Rusted Coin x2]",
        "R90WIB09": "Defeat @sir-vilhelm in the library to gain @contraption-key + @onyx-blade",
        "02CFRW3J": "Activate the lever, go to the second floor, talk to the NPC, and exit to the balcony. Go around the structure to find the bonfire and open the gate",
        "KFYOO462": "From the bonfire take the path into the forest and stick to the left wall to find @prism-stone[Prism Stone x10] on a corpse",
        "2II9PBRS": "Pass the tree, walk towards the cliff, and go right from here. Go up the hill, sticking to the cliff, and drop down in the back left to find the @follower-shield",
        "B4G12MZK": "Go around, take the first right, go straight, looking at the tower, and pick up an @ember in a small cave on the right",
        "XKFCU0KZ": "From the cave continue towards the tower until you get to the cliff. There is a corpse on the right with a @titanite-chunk",
        "JPGOWH2P": "Turn around, take the first right, and go past the bell while sticking to the right. After taking a right you should see a big tree with a red base. Interact with it to fell it and create a shortcut to an elevator",
        "NYAB0UY5": "Cross the tree as well as the bridge and on the left is another tree bridge that leads to a platform with another @titanite-chunk",
        "L7SMLTT5": "Take the same way back to the bell and follow the path up the hill. Take a left and go straight until you meet some wolves as well as @large-titanite-shard[Large Titanite Shard x2] around the corner to the left",
        "3GUI68FN": "From here take the lower path to find the @follower-torch",
        "Q6O1NE7A": "Head back up the hill and take the lower path. Use the Silvercat Ring to jump down to the frozen lake. If you don't have the Silvercat Ring go back to the bell and go up the hill towards the cliff. You can drop down with a snow platform here",
        "HDGFEBW5": "Enter the cave right where you jumped down to find the @earth-seeker",
        "I7FFR0J0": "Around the lake itself you can find a @large-soul-of-a-crestfallen-knight, a @soul-of-a-crestfallen-knight, and another @soul-of-a-crestfallen-knight",
        "D94HU0MG": "After exiting the lake area follow the path along the cliff, go back to the wolves, and go even farther up the hill",
        "AVDYSUQU": "Take a left and follow the short path to an enemy and the @quakestone-hammer",
        "79GRFI8A": "Take the other path, drop down a ledge to find @large-titanite-shard[Large Titanite Shard x2], fell the tree to create a shortcut, and enter the tunnel",
        "GGWUKOLD": "In the room with the flies pick up @dung-pie[Dung Pie x2] from the rafter, exit the room by going up, and open the shortcut door to the bonfire",
        "VXL4IOI6": "Go back to the room with the flies and drop down to the lower floor",
        "D5HTWKPI": "Here you can find a @blood-gem and @vilhelms-set",
        "ZFF2DBBU": "If you take the stairs up you can find an illusory wall on the right that leads directly to the room on the upper floor",
        "0VW4RLD7": "From where the Blood Gem was look towards the entrance on the upper floor and walk towards the pillar with some planks and stones next to it. Activate the handle to reveal a secret passage next to the bonfire",
        "XQGNJCKQ": "When looking at the handle turn left and walk straight towards the wall. Walk right until you see some small steps (you should also hear the sound of a Crystal Lizard). Hit the bricks to reveal an illusory wall",
        "VGJHOVLL": "In this room are two Crystal Lizards who both drop a @twinkling-titanite",
        "3UN8F0TD": "Go outside, drop down to the roots, and follow them to the platform on the tower to find @pyromancers-parting-flame + @homeward-bone[Homeward Bone x2]",
        "JOPTJ1OB": "Towards the center of the tower you'll be invaded by Livid Pyromancer Dunnel if you're embered. He drops the @floating-chaos pyromancy",
        "NNPL3U36": "You'll have to use a Homeward Bone to leave this place. Warp to the Depths of the Painting bonfire and from here take the way right that leads to the tower",
        "814XL1OM": "Defeat @champions-gravetender---gravetender-greatwolf",
        "7N87X418": "Killing this boss gives you @champions-bones + @valorheart",
        "DA2VI13B": "Go back to the Ariandel Chapel bonfire",
        "P9Y02BTT": "For the following boss you can summon @slave-knight-gael",
        "ZMP3Y5BY": "Defeat @sister-friede; receive @soul-of-sister-friede",
        "HGEY34U0": "During the fight you also gained a @titanite-slab",
        "5UNHH28F": "Travel back to the Corvian Settlement and go to the NPC in the house next to the bonfire. He is in the back where you climbed up the ladder. For defeating the boss you get a @titanite-slab from him. If you have killed this NPC before for some reason the slab will be in the kitchen"
      }
    },
    "the-dreg-heap": {
      "name": "The Dreg Heap (The Ringed City DLC)",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/The+Dreg+Heap",
      "steps": {
        "RB1RQD9S": "To access the DLC area go to the Kiln of the First Flame bonfire or the Sister Friede bonfire. Next to either you'll find another bonfire that sends you to The Dreg Heap. You will find an @ember to your right around a round rooftop",
        "HKK9RCWQ": "After taking the plunge go on the platform and take a left, up the set of stairs, and pick up the @titanite-chunk. Take the other stairs further up to get the @aquamarine-dagger",
        "M7U17QKA": "Go back to the platform and go towards the item you can see. The floor will break and you will end up in a room with @soul-of-a-weary-warrior, @titanite-scale, @twinkling-titanite, and the @murky-hand-scythe (to the left of the exit, behind the bookshelves)",
        "9L1TM7EJ": "After taking another plunge go towards the church and pick up @lightning-urn[Lightning Urn x4]. To the left is a wooden platform, remember it but ignore it for now, we'll come back here when the Angel is dead",
        "22QHD16F": "Inside the church you will find a @soul-of-a-crestfallen-knight",
        "8DYKO231": "After exiting the church go right and you will find @rusted-coin[Rusted Coin x2] next to the fountain",
        "KFCSSV5L": "Enter the house and you will find a @titanite-chunk. Further in is the @murky-longstaff",
        "7BCMO8PZ": "After picking up the staff hit the illusory wall on the left (when entering the room) to reveal some stairs. Go up and in the back left corner of the second room is an @ember",
        "N98DOCA0": "Continue along this path, kick down the ladder on the left, and find the @great-soul-dregs sorcery at the far end of the room",
        "CWW8RWBC": "Go out on the wooden balcony and fall down at the far end to find the @covetous-silver-serpent-ring[Covetous Silver Serpent Ring+3]",
        "ZESWLL9X": "Go back to the church and take a left. A tower will collapse into the church. Continue just a bit further to find and kill the first Angel Summoner for @twinkling-titanite[Twinkling Titanite x2]",
        "E40HXFNA": "Now take the new path thanks to the collapsed tower in the church to find @lapp. Exhaust his dialogue",
        "QRA4LMOR": "Proceed further and you will see two possible places where you can drop. Ignore the one to the right and instead drop down on a Harald Knight with a plunging attack. Collect a @titanite-chunk and @homeward-bone[Homeward Bone x3]",
        "TMY42DR5": "Take the plunge to the Earthen Peak Ruins bonfire. If you have died since meeting Lapp, you will find him to the right on a cliff. If not go to Firelink Shrine and then back to reset the zone",
        "DJIKTMIZ": "Return to the first bonfire and run all the way to where the first Angel was (near the Lightning Urns). Behind where you dropped down is a @divine-blessing. Go to the wooden platform and collect the @ring-of-steel-protection[Ring of Steel Protection+3]",
        "Z58F6CU8": "Return to where you first met Lapp, and this time drop down on the right into a bed of ash. On the upper platform you will find @projected-heal in a small alcove",
        "HK4YA5T5": "From the miracle go left and drop further down to where the Lothric Knights are to find a @large-soul-of-a-weary-warrior and further in the @lothric-war-banner",
        "PSER8VVH": "Consider killing the two Angel Summoners before looking for the items in the ruins. Each of them drops @twinkling-titanite[Twinkling Titanite x2]",
        "4J6C78MA": "Next to the windmill blades is @black-firebomb[Black Firebomb x4]",
        "8DVNYBNJ": "In front of the windmill, closer to the cliff edge, is a corpse with a @titanite-chunk",
        "BCIWSACZ": "Go towards the wooden hut on the cliff's edge to find the @desert-pyromancer-garb",
        "GTB0R2D8": "Continue to the next hut to find @titanite-chunk[Titanite Chunk x2]",
        "6PGPCL2G": "Turn around and you'll see a cliff that juts out with the @giant-door-shield at the end",
        "0XWV1BZN": "From the bonfire you can see an item on a root. In order to get to it you have to cross the tower to the left of it, turn right, and run towards the back and onto the roots to get the @twinkling-titanite",
        "2ERZAXJL": "Go to the entrance corridor of the swamp, the one with the two Thralls, and stick to the left to find an @ember",
        "BL1DJCHR": "Go back out and cross the first collapsed tower on the left to find a @titanite-scale in the second one. Drop down to enter the swamp",
        "OSGKTT04": "Turn around and take the path below the tower to find the @desert-pyromancer-gloves",
        "BRF5T60C": "To the left of the gloves, in the swamp, is the @desert-pyromancer-skirt",
        "JPL2S69H": "In the broken hut at the edge of the swamp is @purple-moss-clump[Purple Moss Clump x4]",
        "X8GDIB1R": "Go onto the giant root next to the hut and at the end find the @ring-of-favor[Ring of Favor+3]. Turn back and drop down to the lower root to find a @titanite-chunk",
        "MA19YBWF": "Drop down into the swamp and enter the cave to find a @large-soul-of-a-weary-warrior and a @titanite-slab. If you have died or reloaded at least three times since talking to Lapp at the Earthen Peak Ruins bonfire, he will have gotten the Slab for you and will give it to you after talking to him. If you retrieve the Slab yourself, Lapp will give you a @siegbrau the next time you talk to him",
        "0B3GK6VU": "Exit the cave and get the @large-soul-of-a-weary-warrior from the middle of the swamp and the @titanite-chunk at the houses",
        "0PG5GEAV": "Go right towards the island to find the @loincloth",
        "JGRNTJ4D": "Stick to the left side, going past the buildings, to find the @harald-curved-greatsword and further up a @homeward-bone",
        "S97BF4KJ": "Drop down here, go up the root, and switch to the other one to find a @titanite-chunk",
        "KZHDUHEL": "Follow the roots all the way up to the roof to find and dispatch the Angel Summoner",
        "M37N7JJ5": "Now go up the roots to find @desert-pyromancer-zoey at the top. She drops @flame-fan",
        "CYR3GCLG": "On this path you can find @prism-stone[Prism Stone x6] and the @desert-pyromancer-hood",
        "CKR2HJDK": "From the roots drop on to the smaller root on the right to find a @twinkling-titanite",
        "SWZK6Z6X": "After following the roots and dropping down to the tower get onto the roofs on the right to find a @divine-blessing",
        "H018TSXO": "Follow the roots down to where the Angel Summoner is to find an @ember",
        "9BUU8I51": "Go to where you first dropped down and light the Within the Earthen Peak Ruins bonfire",
        "O762FAP0": "For the next boss you can summon both @slave-knight-gael and @lapp (if he moved to Earthen Peak Ruins)",
        "X1O8Y7VX": "Defeat the @demon-prince to gain the @soul-of-the-demon-prince",
        "KK9HSOJV": "If you had Lapp get the Titanite Slab for you, you can travel back to Earthen Peak Ruins and pick up a @siegbrau from where he was standing. Then return to The Demon Prince",
        "VTTLTYF7": "Pick up the @small-envoy-banner and display it at the cliff to get to The Ringed City"
      }
    },
    "the-ringed-city": {
      "name": "The Ringed City (The Ringed City DLC)",
      "wikiUrl": "http://darksouls3.wiki.fextralife.com/The+Ringed+City",
      "steps": {
        "4GTWUQLM": "Once you've arrived, turn around and get a @titanite-scale",
        "UBWIQKNH": "After going down the stairs onto the bridge, take a right and go down the path to find the @ruin-set",
        "8V9589OB": "Get to the halfway point on the bridge and drop down from the circular platform on the right. After dropping down to the path, turn around to find a @soul-of-a-crestfallen-knight",
        "YPRT6HED": "Continue on the path to find a @crystal-lizard who drops @twinkling-titanite + @titanite-scale",
        "TTADF6LS": "Go around the structure, climb up the ladder, and kill the judicator who drops a @divine-blessing",
        "XER1U6H9": "On the bridge itself you can find a @large-soul-of-a-weary-warrior, @titanite-chunk[Titanite Chunk x2], an @ember, and @budding-green-blossom[Budding Green Blossom x2]",
        "6FWG2ADS": "Go down the stairs below the platform where the judicator was on (on the side facing the bridge) to find a @hidden-blessing in a room",
        "OPO8XUMR": "Now go down the stairs behind the judicator and follow this path to find @purging-stone[Purging Stone x2]",
        "OD85P7RB": "After lighting the bonfire go out on the balcony and talk to @lapp to get a @siegbrau. Make sure to exhaust Lapp's dialogue here and then pick up an @ember next to him",
        "91DH3ENN": "Take the only path and follow it to find a @hollow-gem on a corpse and stick to the right to find a @titanite-chunk next to a railing",
        "4DAVJ7AA": "Follow the path and enter the circular room. Inside jump on the chandelier and onto the platform on the outer ring to find a @twinkling-titanite. Below you can find a @shriving-stone",
        "PXGO3868": "Exit this room using the stairs and when coming to the street turn right and head towards the door. Talk to @shira, making sure to answer Gwyn, and accept her request. She will give you the @sacred-chime-of-filianore",
        "XVW1LD2Y": "Turn around and drop down at the right side for a @titanite-chunk",
        "BJC05G5X": "Now head towards the first bridge to find @mossfruit[Mossfruit x2]",
        "1CY85X2A": "Enter the small garden here to be invaded by @seeker-of-the-spurned. He will invade even if you are unembered and killing him rewards you with the @wolf-ring[Wolf Ring+3]. Further in the back is the @black-witch-set",
        "HJN0YPBC": "Go back on the street and in a small alcove on the left side, just before the swamp, is @mossfruit[Mossfruit x2]",
        "LTG5U4PJ": "Go onto the other side and through the corridor to find the @ringed-knight-spear",
        "8RAMFRAM": "Drop down onto the street to find a @large-soul-of-a-crestfallen-knight",
        "9RR677LD": "As you enter the swamp, pick up the @dark-gem before the collapsed tower",
        "YMZDOGK0": "Take a right to find some stairs that lead to @prism-stone[Prism Stone x4] and the Ringed City Streets bonfire",
        "2OYOT0HN": "Exit back out of the bonfire room, drop down one level, go left, and drop down in the corner to find @white-preacher-head",
        "5YN4UKQ9": "Follow the path to reemerge at the swamp entrance. This time pass the stairs and pick up the @large-soul-of-a-weary-warrior next to some rocks and a @titanite-chunk to the right behind the rocks. Kill the judicator for a @hidden-blessing",
        "LR4UK2KL": "From the previous items continue sticking right and go up the hill to find the @ringed-knight-straight-sword",
        "3ZVA7P8T": "Turn around and head back down where you pick up the @preachers-right-arm from the collapsed tower, a @soul-of-a-weary-warrior from the smaller structure behind it, and another @soul-of-a-weary-warrior in the middle of the swamp",
        "GBE9DIM9": "From there head to the back cliff and look behind the rock on the left to find a @titanite-chunk",
        "PVXJ111Y": "On the lower left side of the church is the @black-witch-veil",
        "LD69K1UV": "Go on the roof of the church and at the back is a @twinkling-titanite",
        "6M2IOGXU": "Drop down in the back and open up the shortcut to the bonfire",
        "P5S62TC0": "Go out into the swamp and once you stand in it keep using @young-white-branch until you transform into a @giant-humanity. (Note: You may only walk in this form.) Now go back to the room where you opened the shortcut and there will be some writing on the wall to the left of the gate. Stand in front of it and a ladder will drop down",
        "H640HTC4": "After going up the ladder progress through the small area and kill the judicator who drops a @divine-blessing, then go down some stairs and further down a ladder. Now cross the bridge, pick up the @large-soul-of-a-crestfallen-knight on the left, and go right to find the @purging-monument. Interact with it",
        "8JWD9ER0": "Head back across the bridge and continue on this path to find the @dragonhead-shield",
        "KTHT05B2": "Drop down from there and enter the building ahead to find the @covetous-gold-serpent-ring[Covetous Gold Serpent Ring+3]",
        "26PMBO26": "Just to the right of it you will once again meet @lapp. Talk to him and make sure to speak of the Purging Monument and exhaust his dialogue",
        "1TYTP21O": "Leave the room, circle around the structure in your path, and cross a bridge to encounter a @crystal-lizard who drops @twinkling-titanite[Twinkling Titanite x2]",
        "951MI8AT": "Continue on in the same direction, dropping down a ledge. When you go upstairs from there and enter the structure you will get invaded by @silver-knight-ledo who drops @ledos-great-hammer. The invasion takes place even if you are unembered",
        "4J6L06R3": "Explore the balcony on the left to find @titanite-chunk[Titanite Chunk x2]",
        "WC5HA7KN": "Exit where you entered and drop down the ledges to find @havels-ring[Havel's Ring+3]",
        "LLUPRWCN": "Below are three Monks around a @soul-of-a-crestfallen-knight",
        "3J63N8A8": "Turn back in the direction of the swamp entrance and pick up a @titanite-chunk on the left by the collapsed tower",
        "Z4QELNWC": "Keep left until you come upon a sunken dome behind which there is a @twinkling-titanite",
        "4CGJX7XX": "Continue along the left cliff and walk up the hill to find the @white-birch-bow and a @titanite-chunk",
        "KWG8A74B": "Go down the hill on the other side to find a white birch with three @young-white-branch",
        "LVCEEY2M": "Enter the structure on the right to find the @church-guardian-shiv",
        "IORQF4ZP": "Continue towards the back of the swamp and defeat the @dragonslayer-armour to get the @iron-dragonslayer-set",
        "U1W833WX": "In the vicinity you will find a @titanite-scale and another @titanite-scale",
        "3GG1Z3V1": "Turn around and head back into the swamp. Next to a tree is a @soul-of-a-crestfallen-knight",
        "VBP80RAY": "Go back to the bridge behind the church (e.g., by warping to the bonfire and exiting via the shortcut) and take a right to find a @titanite-scale and the @dragonhead-greatshield",
        "FQ69LDEM": "On the cliffside where Midir attacks you, you can find @soul-of-a-weary-warrior, @titanite-scale[Titanite Scale x2] (in a small side room from which an enemy comes), @rubbish, and @large-soul-of-a-weary-warrior. (You can also come back later when the dragon is gone from the bridge above and pick up these items without having to worry about the fire)",
        "D1MNB0Y7": "On the path below the cliff you can find @titanite-scale[Titanite Scale x2]",
        "4HDMQWI2": "You will get invaded by Moaning Knight at some point in the Shared Graves area. He invades regardless of whether you are embered or not and drops the @blindfold-mask",
        "SY1V6ZGL": "After dropping down enter the first grave on the left for a @lightning-gem",
        "SHK0C9WA": "Continue up to find a @simple-gem",
        "6J1AEY8H": "After dropping down a second time turn around and walk up the stones to enter another grave",
        "B1CVVDP8": "Lapp should be in here. Interact with him to gain the Patches Squat gesture if you don't already have it and talk to him. If he is not present simply reset the zone",
        "CO7337E6": "Turn around and go to where the purple patch of cloth is and a cutscene will play, after which you are now at a lower staircase",
        "TVNSQNHR": "After dropping down once again turn around to find a @blessed-gem",
        "AEQML73F": "Continue up and in the first grave is a mimic chest. It drops the @ring-of-the-evil-eye[Ring of the Evil Eye+3]",
        "CB5N8XOV": "After lighting the bonfire you can kill the @crystal-lizard, who drops @twinkling-titanite + @titanite-scale",
        "WCRF0JN3": "Go to where Lapp was before to find @champions-bones + @lapps-set (the bones will only be there if you haven't already gotten them from the Ashes of Ariandel DLC)",
        "UWPKA6QS": "Go outside, defeat the dragon Midir (necessary to unlock the bossfight), and on the bridge is a @titanite-scale",
        "2HXKX2H8": "Enter the room and to the right of the stairs is an illusory wall. Behind it is another one with a @large-soul-of-a-weary-warrior. Behind this one is yet another illusory wall with the @lightning-arrow miracle",
        "TWJH6SV4": "Go up the stairs to find a @crystal-lizard who drops @titanite-scale[Titanite Scale x2]",
        "OYXTEFO3": "In the next room take the elevator that leads you to the shortcut that connects to the Ringed Inner Wall bonfire",
        "51TMJRO7": "Take the elevator down and exit halfway. Take a right and drop down to the @chloranthy-ring[Chloranthy Ring+3]",
        "RNXD2N99": "Use the elevator again, but this time go left. Pick up the @ember",
        "15I97GEB": "Attack the statue that isn't holding a sword to reveal an illusory wall. Behind the ladder is a @filianores-spear-ornament",
        "PYD0GS6D": "Take the ladder down to find the @antiquated-plain-set",
        "BRAFZ55O": "For the following fight you can summon @shira, if you accepted her request to put Midir to rest",
        "XUFDBW7H": "Defeat @darkeater-midir to gain @spears-of-the-church + @soul-of-darkeater-midir",
        "C1M7QQZE": "After killing Midir go back to Shira in the Ringed City Streets and she rewards you with a @titanite-slab",
        "F7TIGJYR": "Go back to where you picked up the Chloranthy Ring and exit towards the church",
        "HUGXLHAB": "Pick up @budding-green-blossom[Budding Green Blossom x3] on the left and then defeat the @ringed-knight to get the @ringed-knight-paired-greatswords",
        "YTS9JO6M": "To the right of where the knight was is the @ritual-spear-fragment",
        "1B1SPC0H": "Before entering the church, drop down on the left to find @twinkling-titanite[Twinkling Titanite x2]",
        "H24HPDCI": "You can summon @unbreakable-patches for the next fight if you encountered him in the Shared Grave. His summon sign is inside the church, by the opened door",
        "YWLBF4T2": "Defeat @halflight--spear-of-the-church to gain @titanite-slab + @filianores-spear-ornament",
        "YBNM701V": "After entering Filianore's Rest, walk through the broken window and stick to the right to get to a church-like structure. Shira, Knight of Filianore will appear and upon defeating her will drop the @crucifix-of-the-mad-king. She will also drop her @titanite-slab if you did not already obtain it",
        "7M1YXFXP": "From where you started stick to the left now to find a @ringed-knight who rewards you with a @titanite-slab",
        "NBLGJH07": "After killing Shira go back to where you first met her to find the door now open and @shiras-set inside",
        "OK43338I": "Go to the start of the DLC, The Dreg Heap bonfire, and interact with the corpse of the old woman to receive the @old-womans-ashes, which allow the Handmaiden to sell the Splitleaf Greatsword (if you haven't already bought it)",
        "76WDQS96": "Defeat @slave-knight-gael--boss- to gain @soul-of-slave-knight-gael + @blood-of-the-dark-soul",
        "C6LWMMAA": "Bring the @blood-of-the-dark-soul to the painter in Ariandel Chapel if you want"
      }
    }
  },
  "links": {
    "soul-of-a-deserted-corpse": {
      "defaultName": "Soul of a Deserted Corpse",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+a+deserted+corpse"
    },
    "ashen-estus-flask": {
      "defaultName": "Ashen Estus Flask",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ashen+estus+flask"
    },
    "ravenous-crystal-lizard": {
      "defaultName": "Ravenous Crystal Lizard",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ravenous+crystal+lizard"
    },
    "titanite-scale": {
      "defaultName": "Titanite Scale",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/titanite+scale"
    },
    "soul-of-an-unknown-traveler": {
      "defaultName": "Soul of an Unknown Traveler",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+an+unknown+traveler"
    },
    "speckled-stoneplate-ring": {
      "defaultName": "Speckled Stoneplate Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/speckled+stoneplate+ring"
    },
    "titanite-shard": {
      "defaultName": "Titanite Shard",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/titanite+shard"
    },
    "firebomb": {
      "defaultName": "Firebomb",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/firebomb"
    },
    "iudex-gundyr": {
      "defaultName": "Iudex Gundyr",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/iudex+gundyr"
    },
    "coiled-sword": {
      "defaultName": "Coiled Sword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/coiled+sword"
    },
    "broken-straight-sword": {
      "defaultName": "Broken Straight Sword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/broken+straight+sword"
    },
    "wolf-ring": {
      "defaultName": "Wolf Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/wolf+ring"
    },
    "homeward-bone": {
      "defaultName": "Homeward Bone",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/homeward+bone"
    },
    "firelink-shrine": {
      "defaultName": "Firelink Shrine",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/firelink+shrine"
    },
    "east-west-shield": {
      "defaultName": "East-West Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/east-west+shield"
    },
    "sword-master": {
      "defaultName": "Sword Master",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sword+master"
    },
    "uchigatana": {
      "defaultName": "Uchigatana",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/uchigatana"
    },
    "masters-set": {
      "defaultName": "Master's Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/master's+set"
    },
    "ember": {
      "defaultName": "Ember",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ember"
    },
    "fire-keeper": {
      "defaultName": "Fire Keeper",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/fire+keeper"
    },
    "shrine-handmaid": {
      "defaultName": "Shrine Handmaid",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/shrine+handmaid"
    },
    "hawkwood": {
      "defaultName": "Hawkwood",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/hawkwood"
    },
    "blacksmith-andre": {
      "defaultName": "Blacksmith Andre",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/blacksmith+andre"
    },
    "tower-key": {
      "defaultName": "Tower Key",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/tower+key"
    },
    "crystal-lizard": {
      "defaultName": "Crystal Lizard",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/crystal+lizard"
    },
    "twinkling-titanite": {
      "defaultName": "Twinkling Titanite",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/twinkling+titanite"
    },
    "estus-shard": {
      "defaultName": "Estus Shard",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/estus+shard"
    },
    "pickle-pee--pump-a-rum-crow": {
      "defaultName": "Pickle Pee, Pump-a-Rum Crow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/pickle+pee,+pump-a-rum+crow"
    },
    "iron-bracelets": {
      "defaultName": "Iron Bracelets",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/iron+bracelets"
    },
    "-": {
      "defaultName": "#",
      "wikiUrl": "#"
    },
    "illusory-walls": {
      "defaultName": "Illusory Walls",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/illusory+walls"
    },
    "covetous-silver-serpent-ring": {
      "defaultName": "Covetous Silver Serpent Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/covetous+silver+serpent+ring"
    },
    "unbreakable-patches": {
      "defaultName": "Unbreakable Patches",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/unbreakable+patches"
    },
    "fire-keeper-soul": {
      "defaultName": "Fire Keeper Soul",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/fire+keeper+soul"
    },
    "fire-keeper-set": {
      "defaultName": "Fire Keeper Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/fire+keeper+set"
    },
    "estus-ring": {
      "defaultName": "Estus Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/estus+ring"
    },
    "pus-of-man": {
      "defaultName": "Pus of Man",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/pus+of+man"
    },
    "longbow": {
      "defaultName": "Longbow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/longbow"
    },
    "standard-arrow": {
      "defaultName": "Standard Arrow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/standard+arrow"
    },
    "binoculars": {
      "defaultName": "Binoculars",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/binoculars"
    },
    "gold-pine-resin": {
      "defaultName": "Gold Pine Resin",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/gold+pine+resin"
    },
    "large-titanite-shard": {
      "defaultName": "Large Titanite Shard",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/large+titanite+shard"
    },
    "claymore": {
      "defaultName": "Claymore",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/claymore"
    },
    "club": {
      "defaultName": "Club",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/club"
    },
    "large-soul-of-a-deserted-corpse": {
      "defaultName": "Large Soul of a Deserted Corpse",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/large+soul+of+a+deserted+corpse"
    },
    "mimic": {
      "defaultName": "Mimic",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/mimic"
    },
    "undead-hunter-charm": {
      "defaultName": "Undead Hunter Charm",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/undead+hunter+charm"
    },
    "battle-axe": {
      "defaultName": "Battle Axe",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/battle+axe"
    },
    "leonhard": {
      "defaultName": "Leonhard",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/leonhard"
    },
    "cracked-red-eye-orb": {
      "defaultName": "Cracked Red Eye Orb",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/cracked+red+eye+orb"
    },
    "raw-gem": {
      "defaultName": "Raw Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/raw+gem"
    },
    "fleshbite-ring": {
      "defaultName": "Fleshbite Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/fleshbite+ring"
    },
    "black-firebomb": {
      "defaultName": "Black Firebomb",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/black+firebomb"
    },
    "broadsword": {
      "defaultName": "Broadsword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/broadsword"
    },
    "silver-eagle-kite-shield": {
      "defaultName": "Silver Eagle Kite Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/silver+eagle+kite+shield"
    },
    "green-blossom": {
      "defaultName": "Green Blossom",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/green+blossom"
    },
    "astora-straight-sword": {
      "defaultName": "Astora Straight Sword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/astora+straight+sword"
    },
    "cell-key": {
      "defaultName": "Cell Key",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/cell+key"
    },
    "ring-of-the-evil-eye": {
      "defaultName": "Ring of the Evil Eye",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ring+of+the+evil+eye"
    },
    "rapier": {
      "defaultName": "Rapier",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/rapier"
    },
    "throwing-knife": {
      "defaultName": "Throwing Knife",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/throwing+knife"
    },
    "mail-breaker": {
      "defaultName": "Mail Breaker",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/mail+breaker"
    },
    "greirat-of-the-undead-settlement": {
      "defaultName": "Greirat of the Undead Settlement",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/greirat+of+the+undead+settlement"
    },
    "blue-tearstone-ring": {
      "defaultName": "Blue Tearstone Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/blue+tearstone+ring"
    },
    "ring-of-sacrifice": {
      "defaultName": "Ring of Sacrifice",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ring+of+sacrifice"
    },
    "lion-knight-albert": {
      "defaultName": "Lion Knight Albert",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lion+knight+albert"
    },
    "lothric-knight": {
      "defaultName": "Lothric Knight",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lothric+knight"
    },
    "refined-gem": {
      "defaultName": "Refined Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/refined+gem"
    },
    "emma": {
      "defaultName": "Emma",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/emma"
    },
    "small-lothric-banner": {
      "defaultName": "Small Lothric Banner",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/small+lothric+banner"
    },
    "way-of-blue": {
      "defaultName": "Way of Blue",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/way+of+blue"
    },
    "lucerne": {
      "defaultName": "Lucerne",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lucerne"
    },
    "vordt-of-the-boreal-valley": {
      "defaultName": "Vordt of the Boreal Valley",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/vordt+of+the+boreal+valley"
    },
    "soul-of-boreal-valley-vordt": {
      "defaultName": "Soul of Boreal Valley Vordt",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+boreal+valley+vordt"
    },
    "undead-settlement": {
      "defaultName": "Undead Settlement",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/undead+settlement"
    },
    "dog": {
      "defaultName": "Dog",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dog"
    },
    "alluring-skull": {
      "defaultName": "Alluring Skull",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/alluring+skull"
    },
    "yoel-of-londor": {
      "defaultName": "Yoel of Londor",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/yoel+of+londor"
    },
    "dark-sigil": {
      "defaultName": "Dark Sigil",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dark+sigil"
    },
    "yuria-of-londor": {
      "defaultName": "Yuria of Londor",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/yuria+of+londor"
    },
    "londor-braille-divine-tome": {
      "defaultName": "Londor Braille Divine Tome",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/londor+braille+divine+tome"
    },
    "small-leather-shield": {
      "defaultName": "Small Leather Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/small+leather+shield"
    },
    "charcoal-pine-bundle": {
      "defaultName": "Charcoal Pine Bundle",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/charcoal+pine+bundle"
    },
    "repair-powder": {
      "defaultName": "Repair Powder",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/repair+powder"
    },
    "lorettas-bone": {
      "defaultName": "Loretta's Bone",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/loretta's+bone"
    },
    "kukri": {
      "defaultName": "Kukri",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/kukri"
    },
    "charcoal-pine-resin": {
      "defaultName": "Charcoal Pine Resin",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/charcoal+pine+resin"
    },
    "warrior-of-sunlight": {
      "defaultName": "Warrior of Sunlight",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/warrior+of+sunlight"
    },
    "estus-soup": {
      "defaultName": "Estus Soup",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/estus+soup"
    },
    "whip": {
      "defaultName": "Whip",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/whip"
    },
    "evangelist": {
      "defaultName": "Evangelist",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/evangelist"
    },
    "rusted-coin": {
      "defaultName": "Rusted Coin",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/rusted+coin"
    },
    "sharp-gem": {
      "defaultName": "Sharp Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sharp+gem"
    },
    "holy-knight-hodrick": {
      "defaultName": "Holy Knight Hodrick",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/holy+knight+hodrick"
    },
    "vertebra-shackle": {
      "defaultName": "Vertebra Shackle",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/vertebra+shackle"
    },
    "thrall": {
      "defaultName": "Thrall",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/thrall"
    },
    "fading-soul": {
      "defaultName": "Fading Soul",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/fading+soul"
    },
    "plank-shield": {
      "defaultName": "Plank Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/plank+shield"
    },
    "flame-stoneplate-ring": {
      "defaultName": "Flame Stoneplate Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/flame+stoneplate+ring"
    },
    "wargod-wooden-shield": {
      "defaultName": "Wargod Wooden Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/wargod+wooden+shield"
    },
    "mound-maker": {
      "defaultName": "Mound-Maker",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/mound-maker"
    },
    "caduceus-round-shield": {
      "defaultName": "Caduceus Round Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/caduceus+round+shield"
    },
    "cornyx-of-the-great-swamp": {
      "defaultName": "Cornyx of the Great Swamp",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/cornyx+of+the+great+swamp"
    },
    "pyromancy-flame": {
      "defaultName": "Pyromancy Flame",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/pyromancy+flame"
    },
    "hand-axe": {
      "defaultName": "Hand Axe",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/hand+axe"
    },
    "partizan": {
      "defaultName": "Partizan",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/partizan"
    },
    "fire-clutch-ring": {
      "defaultName": "Fire Clutch Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/fire+clutch+ring"
    },
    "rat": {
      "defaultName": "rat",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/rat"
    },
    "bloodbite-ring": {
      "defaultName": "Bloodbite Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/bloodbite+ring"
    },
    "caestus": {
      "defaultName": "Caestus",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/caestus"
    },
    "eygon-of-carim": {
      "defaultName": "Eygon of Carim",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/eygon+of+carim"
    },
    "irina-of-carim": {
      "defaultName": "Irina of Carim",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/irina+of+carim"
    },
    "morticians-ashes": {
      "defaultName": "Mortician's Ashes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/mortician's+ashes"
    },
    "siegward-of-catarina": {
      "defaultName": "Siegward of Catarina",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/siegward+of+catarina"
    },
    "boreal-outrider-knight": {
      "defaultName": "Boreal Outrider Knight",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/boreal+outrider+knight"
    },
    "irithyll-straight-sword": {
      "defaultName": "Irithyll Straight Sword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/irithyll+straight+sword"
    },
    "road-of-sacrifices": {
      "defaultName": "Road of Sacrifices",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/road+of+sacrifices"
    },
    "life-ring": {
      "defaultName": "Life Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/life+ring"
    },
    "soul-of-a-nameless-soldier": {
      "defaultName": "Soul of a Nameless Soldier",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+a+nameless+soldier"
    },
    "giant-of-the-undead-settlement": {
      "defaultName": "Giant of the Undead Settlement",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/giant+of+the+undead+settlement"
    },
    "fire-gem": {
      "defaultName": "Fire Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/fire+gem"
    },
    "siegbrau": {
      "defaultName": "Siegbrau",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/siegbrau"
    },
    "large-club": {
      "defaultName": "Large Club",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/large+club"
    },
    "northern-armor-set": {
      "defaultName": "Northern Armor Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/northern+armor+set"
    },
    "pale-tongue": {
      "defaultName": "Pale Tongue",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/pale+tongue"
    },
    "lift-chamber-key": {
      "defaultName": "Lift Chamber Key",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lift+chamber+key"
    },
    "red-eye-orb": {
      "defaultName": "Red Eye Orb",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/red+eye+orb"
    },
    "red-bug-pellet": {
      "defaultName": "Red Bug Pellet",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/red+bug+pellet"
    },
    "human-pine-resin": {
      "defaultName": "Human Pine Resin",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/human+pine+resin"
    },
    "flynns-ring": {
      "defaultName": "Flynn's Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/flynn's+ring"
    },
    "mirrah-set": {
      "defaultName": "Mirrah Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/mirrah+set"
    },
    "chloranthy-ring": {
      "defaultName": "Chloranthy Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/chloranthy+ring"
    },
    "blue-wooden-shield": {
      "defaultName": "Blue Wooden Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/blue+wooden+shield"
    },
    "cleric-set": {
      "defaultName": "Cleric Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/cleric+set"
    },
    "poisonbite-ring": {
      "defaultName": "Poisonbite Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/poisonbite+ring"
    },
    "reinforced-club": {
      "defaultName": "Reinforced Club",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/reinforced+club"
    },
    "undead-bone-shard": {
      "defaultName": "Undead Bone Shard",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/undead+bone+shard"
    },
    "great-scythe": {
      "defaultName": "Great Scythe",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/great+scythe"
    },
    "grave-key": {
      "defaultName": "Grave Key",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/grave+key"
    },
    "velka-the-goddess-of-sin": {
      "defaultName": "Velka the Goddess of Sin",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/velka+the+goddess+of+sin"
    },
    "loincloth": {
      "defaultName": "Loincloth",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/loincloth"
    },
    "red-hilted-halberd": {
      "defaultName": "Red Hilted Halberd",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/red+hilted+halberd"
    },
    "heavy-gem": {
      "defaultName": "Heavy Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/heavy+gem"
    },
    "red-and-white-shield": {
      "defaultName": "Red and White Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/red+and+white+shield"
    },
    "saints-talisman": {
      "defaultName": "Saint's Talisman",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/saint's+talisman"
    },
    "curse-rotted-greatwood": {
      "defaultName": "Curse-rotted Greatwood",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/curse-rotted+greatwood"
    },
    "soul-of-the-rotted-greatwood": {
      "defaultName": "Soul of the Rotted Greatwood",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+the+rotted+greatwood"
    },
    "transposing-kiln": {
      "defaultName": "Transposing Kiln",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/transposing+kiln"
    },
    "ludleth-of-courland": {
      "defaultName": "Ludleth of Courland",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ludleth+of+courland"
    },
    "shriving-stone": {
      "defaultName": "Shriving Stone",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/shriving+stone"
    },
    "madwoman": {
      "defaultName": "Madwoman",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/madwoman"
    },
    "butcher-knife": {
      "defaultName": "Butcher Knife",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/butcher+knife"
    },
    "brigand-axe": {
      "defaultName": "Brigand Axe",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/brigand+axe"
    },
    "brigand-set": {
      "defaultName": "Brigand Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/brigand+set"
    },
    "brigand-twindaggers": {
      "defaultName": "Brigand Twindaggers",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/brigand+twindaggers"
    },
    "braille-divine-tome-of-carim": {
      "defaultName": "Braille Divine Tome of Carim",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/braille+divine+tome+of+carim"
    },
    "mornes-ring": {
      "defaultName": "Morne's Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/morne's+ring"
    },
    "anri-of-astora": {
      "defaultName": "Anri of Astora",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/anri+of+astora"
    },
    "horace-the-hushed": {
      "defaultName": "Horace the Hushed",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/horace+the+hushed"
    },
    "blue-sentinels": {
      "defaultName": "Blue Sentinels",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/blue+sentinels"
    },
    "sirris-of-the-sunless-realms": {
      "defaultName": "Sirris of the Sunless Realms",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sirris+of+the+sunless+realms"
    },
    "sellsword-set": {
      "defaultName": "Sellsword Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sellsword+set"
    },
    "sellsword-twinblades": {
      "defaultName": "Sellsword Twinblades",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sellsword+twinblades"
    },
    "farron-coal": {
      "defaultName": "Farron Coal",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/farron+coal"
    },
    "poisonhorn-bug": {
      "defaultName": "Poisonhorn Bug",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/poisonhorn+bug"
    },
    "twin-dragon-greatshield": {
      "defaultName": "Twin Dragon Greatshield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/twin+dragon+greatshield"
    },
    "great-crab": {
      "defaultName": "Great Crab",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/great+crab"
    },
    "great-swamp-ring": {
      "defaultName": "Great Swamp Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/great+swamp+ring"
    },
    "yellowfinger-heysel": {
      "defaultName": "Yellowfinger Heysel",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/yellowfinger+heysel"
    },
    "heysel-pick": {
      "defaultName": "Heysel Pick",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/heysel+pick"
    },
    "xanthous-crown": {
      "defaultName": "Xanthous Crown",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/xanthous+crown"
    },
    "grass-crest-shield": {
      "defaultName": "Grass Crest Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/grass+crest+shield"
    },
    "conjurator-set": {
      "defaultName": "Conjurator Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/conjurator+set"
    },
    "great-swamp-pyromancy-tome": {
      "defaultName": "Great Swamp Pyromancy Tome",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/great+swamp+pyromancy+tome"
    },
    "farron-keep": {
      "defaultName": "Farron Keep",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/farron+keep"
    },
    "sage-ring": {
      "defaultName": "Sage Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sage+ring"
    },
    "sorcerer-set": {
      "defaultName": "Sorcerer Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sorcerer+set"
    },
    "lingering-dragoncrest-ring": {
      "defaultName": "Lingering Dragoncrest Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lingering+dragoncrest+ring"
    },
    "crystal-gem": {
      "defaultName": "Crystal Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/crystal+gem"
    },
    "golden-falcon-shield": {
      "defaultName": "Golden Falcon Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/golden+falcon+shield"
    },
    "great-club": {
      "defaultName": "Great Club",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/great+club"
    },
    "exile-greatsword": {
      "defaultName": "Exile Greatsword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/exile+greatsword"
    },
    "fallen-knight-set": {
      "defaultName": "Fallen Knight Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/fallen+knight+set"
    },
    "large-soul-of-an-unknown-traveler": {
      "defaultName": "Large Soul of an Unknown Traveler",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/large+soul+of+an+unknown+traveler"
    },
    "heretics-staff": {
      "defaultName": "Heretic's Staff",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/heretic's+staff"
    },
    "orbeck-of-vinheim": {
      "defaultName": "Orbeck of Vinheim",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/orbeck+of+vinheim"
    },
    "young-dragon-ring": {
      "defaultName": "Young Dragon Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/young+dragon+ring"
    },
    "slumbering-dragoncrest-ring": {
      "defaultName": "Slumbering Dragoncrest Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/slumbering+dragoncrest+ring"
    },
    "blue-bug-pellet": {
      "defaultName": "Blue Bug Pellet",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/blue+bug+pellet"
    },
    "crystal-sage": {
      "defaultName": "Crystal Sage",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/crystal+sage"
    },
    "soul-of-a-crystal-sage": {
      "defaultName": "Soul of a Crystal Sage",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+a+crystal+sage"
    },
    "herald-set": {
      "defaultName": "Herald Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/herald+set"
    },
    "paladins-ashes": {
      "defaultName": "Paladin's Ashes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/paladin's+ashes"
    },
    "crest-shield": {
      "defaultName": "Crest Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/crest+shield"
    },
    "spider-shield": {
      "defaultName": "Spider Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/spider+shield"
    },
    "notched-whip": {
      "defaultName": "Notched Whip",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/notched+whip"
    },
    "saint-tree-bellvine": {
      "defaultName": "Saint-tree Bellvine",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/saint-tree+bellvine"
    },
    "astora-greatsword": {
      "defaultName": "Astora Greatsword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/astora+greatsword"
    },
    "executioners-greatsword": {
      "defaultName": "Executioner's Greatsword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/executioner's+greatsword"
    },
    "cathedral-grave-warden": {
      "defaultName": "Cathedral Grave Warden",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/cathedral+grave+warden"
    },
    "young-white-branch": {
      "defaultName": "Young White Branch",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/young+white+branch"
    },
    "curse-ward-greatshield": {
      "defaultName": "Curse Ward Greatshield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/curse+ward+greatshield"
    },
    "duel-charm": {
      "defaultName": "Duel Charm",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/duel+charm"
    },
    "deep-gem": {
      "defaultName": "Deep Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/deep+gem"
    },
    "lloyds-sword-ring": {
      "defaultName": "Lloyd's Sword Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lloyd's+sword+ring"
    },
    "exploding-bolt": {
      "defaultName": "Exploding Bolt",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/exploding+bolt"
    },
    "seek-guidance": {
      "defaultName": "Seek Guidance",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/seek+guidance"
    },
    "deep-braille-divine-tome": {
      "defaultName": "Deep Braille Divine Tome",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/deep+braille+divine+tome"
    },
    "deep-accursed": {
      "defaultName": "Deep Accursed",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/deep+accursed"
    },
    "aldrichs-sapphire": {
      "defaultName": "Aldrich's Sapphire",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/aldrich's+sapphire"
    },
    "longfinger-kirk": {
      "defaultName": "Longfinger Kirk",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/longfinger+kirk"
    },
    "barbed-straight-sword": {
      "defaultName": "Barbed Straight Sword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/barbed+straight+sword"
    },
    "spiked-shield": {
      "defaultName": "Spiked Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/spiked+shield"
    },
    "maiden-set": {
      "defaultName": "Maiden Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/maiden+set"
    },
    "saint-bident": {
      "defaultName": "Saint Bident",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/saint+bident"
    },
    "drang-armor-set": {
      "defaultName": "Drang Armor Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/drang+armor+set"
    },
    "drang-hammers": {
      "defaultName": "Drang Hammers",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/drang+hammers"
    },
    "deep-ring": {
      "defaultName": "Deep Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/deep+ring"
    },
    "arbalest": {
      "defaultName": "Arbalest",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/arbalest"
    },
    "ring-of-favor": {
      "defaultName": "Ring of Favor",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ring+of+favor"
    },
    "blessed-gem": {
      "defaultName": "Blessed Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/blessed+gem"
    },
    "catarina-set": {
      "defaultName": "Catarina Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/catarina+set"
    },
    "red-sign-soapstone": {
      "defaultName": "Red Sign Soapstone",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/red+sign+soapstone"
    },
    "rosarias-fingers": {
      "defaultName": "Rosaria's Fingers",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/rosaria's+fingers"
    },
    "armor-of-thorns-set": {
      "defaultName": "Armor of Thorns Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/armor+of+thorns+set"
    },
    "rusted-gold-coin": {
      "defaultName": "Rusted Gold Coin",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/rusted+gold+coin"
    },
    "deacons-of-the-deep": {
      "defaultName": "Deacons of the Deep",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/deacons+of+the+deep"
    },
    "small-doll": {
      "defaultName": "small doll",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/small+doll"
    },
    "soul-of-the-deacons-of-the-deep": {
      "defaultName": "Soul of the Deacons of the Deep",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+the+deacons+of+the+deep"
    },
    "archdeacon-set": {
      "defaultName": "Archdeacon Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/archdeacon+set"
    },
    "purple-moss-clump": {
      "defaultName": "Purple Moss Clump",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/purple+moss+clump"
    },
    "iron-flesh": {
      "defaultName": "Iron Flesh",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/iron+flesh"
    },
    "londor-pale-shade": {
      "defaultName": "Londor Pale Shade",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/londor+pale+shade"
    },
    "manikin-claws": {
      "defaultName": "Manikin Claws",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/manikin+claws"
    },
    "magic-stoneplate-ring": {
      "defaultName": "Magic Stoneplate Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/magic+stoneplate+ring"
    },
    "ragged-mask": {
      "defaultName": "Ragged Mask",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ragged+mask"
    },
    "prism-stone": {
      "defaultName": "Prism Stone",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/prism+stone"
    },
    "stone-parma": {
      "defaultName": "Stone Parma",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/stone+parma"
    },
    "rotten-pine-resin": {
      "defaultName": "Rotten Pine Resin",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/rotten+pine+resin"
    },
    "sages-coal": {
      "defaultName": "Sage's Coal",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sage's+coal"
    },
    "greatsword": {
      "defaultName": "Greatsword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/greatsword"
    },
    "ghru-leaper": {
      "defaultName": "Ghru Leaper",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ghru+leaper"
    },
    "dark-stoneplate-ring": {
      "defaultName": "Dark Stoneplate Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dark+stoneplate+ring"
    },
    "wolfs-blood-swordgrass": {
      "defaultName": "Wolf's Blood Swordgrass",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/wolf's+blood+swordgrass"
    },
    "sunlight-talisman": {
      "defaultName": "Sunlight Talisman",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sunlight+talisman"
    },
    "dreamchasers-ashes": {
      "defaultName": "Dreamchaser's Ashes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dreamchaser's+ashes"
    },
    "watchdogs-of-farron": {
      "defaultName": "Watchdogs of Farron",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/watchdogs+of+farron"
    },
    "stray-demon": {
      "defaultName": "Stray Demon",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/stray+demon"
    },
    "soul-of-a-stray-demon": {
      "defaultName": "Soul of a Stray Demon",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+a+stray+demon"
    },
    "greataxe": {
      "defaultName": "Greataxe",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/greataxe"
    },
    "lightning-spear": {
      "defaultName": "Lightning Spear",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lightning+spear"
    },
    "dragon-crest-shield": {
      "defaultName": "Dragon Crest Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragon+crest+shield"
    },
    "nameless-knight-set": {
      "defaultName": "Nameless Knight Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/nameless+knight+set"
    },
    "basilisk": {
      "defaultName": "Basilisk",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/basilisk"
    },
    "large-soul-of-a-nameless-soldier": {
      "defaultName": "Large Soul of a Nameless Soldier",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/large+soul+of+a+nameless+soldier"
    },
    "golden-scroll": {
      "defaultName": "Golden Scroll",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/golden+scroll"
    },
    "antiquated-set": {
      "defaultName": "Antiquated Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/antiquated+set"
    },
    "gold-pine-bundle": {
      "defaultName": "Gold Pine Bundle",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/gold+pine+bundle"
    },
    "crown-of-dusk": {
      "defaultName": "Crown of Dusk",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/crown+of+dusk"
    },
    "sages-scroll": {
      "defaultName": "Sage's Scroll",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sage's+scroll"
    },
    "black-bow-of-pharis": {
      "defaultName": "Black Bow of Pharis",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/black+bow+of+pharis"
    },
    "phariss-hat": {
      "defaultName": "Pharis's Hat",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/pharis's+hat"
    },
    "poison-gem": {
      "defaultName": "Poison Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/poison+gem"
    },
    "great-magic-weapon": {
      "defaultName": "Great Magic Weapon",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/great+magic+weapon"
    },
    "atonement": {
      "defaultName": "Atonement",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/atonement"
    },
    "hollow-gem": {
      "defaultName": "Hollow Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/hollow+gem"
    },
    "black-bug-pellet": {
      "defaultName": "Black Bug Pellet",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/black+bug+pellet"
    },
    "black-hand-gotthard": {
      "defaultName": "Black Hand Gotthard",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/black+hand+gotthard"
    },
    "dried-finger": {
      "defaultName": "Dried Finger",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dried+finger"
    },
    "abyss-watchers": {
      "defaultName": "Abyss Watchers",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/abyss+watchers"
    },
    "cinders-of-a-lord": {
      "defaultName": "Cinders of a Lord",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/cinders+of+a+lord"
    },
    "soul-of-the-blood-of-the-wolf": {
      "defaultName": "Soul of the Blood of the Wolf",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+the+blood+of+the+wolf"
    },
    "hawk-ring": {
      "defaultName": "Hawk Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/hawk+ring"
    },
    "farron-ring": {
      "defaultName": "Farron Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/farron+ring"
    },
    "hawkwoods-shield": {
      "defaultName": "Hawkwood's Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/hawkwood's+shield"
    },
    "carthus-rouge": {
      "defaultName": "Carthus Rouge",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/carthus+rouge"
    },
    "ring-of-steel-protection": {
      "defaultName": "Ring of Steel Protection",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ring+of+steel+protection"
    },
    "carthus-pyromancy-tome": {
      "defaultName": "Carthus Pyromancy Tome",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/carthus+pyromancy+tome"
    },
    "bloodred-moss-clump": {
      "defaultName": "Bloodred Moss Clump",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/bloodred+moss+clump"
    },
    "carthus-milkring": {
      "defaultName": "Carthus Milkring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/carthus+milkring"
    },
    "thunder-stoneplate-ring": {
      "defaultName": "Thunder Stoneplate Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/thunder+stoneplate+ring"
    },
    "skeleton-wheel": {
      "defaultName": "Skeleton Wheel",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/skeleton+wheel"
    },
    "carthus-bloodring": {
      "defaultName": "Carthus Bloodring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/carthus+bloodring"
    },
    "grave-wardens-ashes": {
      "defaultName": "Grave Warden's Ashes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/grave+warden's+ashes"
    },
    "dark-gem": {
      "defaultName": "Dark Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dark+gem"
    },
    "yellow-bug-pellet": {
      "defaultName": "Yellow Bug Pellet",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/yellow+bug+pellet"
    },
    "knight-slayer-tsorig": {
      "defaultName": "Knight Slayer Tsorig",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/knight+slayer+tsorig"
    },
    "knight-slayers-ring": {
      "defaultName": "Knight Slayer's Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/knight+slayer's+ring"
    },
    "high-lord-wolnir": {
      "defaultName": "High Lord Wolnir",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/high+lord+wolnir"
    },
    "soul-of-high-lord-wolnir": {
      "defaultName": "Soul of High Lord Wolnir",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+high+lord+wolnir"
    },
    "grave-warden-pyromancy-tome": {
      "defaultName": "Grave Warden Pyromancy Tome",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/grave+warden+pyromancy+tome"
    },
    "demon": {
      "defaultName": "Demon",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/demon"
    },
    "soul-of-a-demon": {
      "defaultName": "Soul of a Demon",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+a+demon"
    },
    "black-blade": {
      "defaultName": "Black Blade",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/black+blade"
    },
    "old-sages-blindfold": {
      "defaultName": "Old Sage's Blindfold",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/old+sage's+blindfold"
    },
    "witchs-ring": {
      "defaultName": "Witch's Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/witch's+ring"
    },
    "lightning-stake": {
      "defaultName": "Lightning Stake",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lightning+stake"
    },
    "shield-of-want": {
      "defaultName": "Shield of Want",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/shield+of+want"
    },
    "chaos-gem": {
      "defaultName": "Chaos Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/chaos+gem"
    },
    "black-knight-sword": {
      "defaultName": "Black Knight Sword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/black+knight+sword"
    },
    "izalith-pyromancy-tome": {
      "defaultName": "Izalith Pyromancy Tome",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/izalith+pyromancy+tome"
    },
    "quelana-pyromancy-tome": {
      "defaultName": "Quelana Pyromancy Tome",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/quelana+pyromancy+tome"
    },
    "toxic-mist": {
      "defaultName": "Toxic Mist",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/toxic+mist"
    },
    "white-hair-talisman": {
      "defaultName": "White Hair Talisman",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/white+hair+talisman"
    },
    "izalith-staff": {
      "defaultName": "Izalith Staff",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/izalith+staff"
    },
    "fume-ultra-greatsword": {
      "defaultName": "Fume Ultra Greatsword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/fume+ultra+greatsword"
    },
    "black-iron-greatshield": {
      "defaultName": "Black Iron Greatshield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/black+iron+greatshield"
    },
    "black-iron-set": {
      "defaultName": "Black Iron Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/black+iron+set"
    },
    "sacred-flame": {
      "defaultName": "Sacred Flame",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sacred+flame"
    },
    "soul-of-a-crestfallen-knight": {
      "defaultName": "Soul of a Crestfallen Knight",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+a+crestfallen+knight"
    },
    "dragonrider-bow": {
      "defaultName": "Dragonrider Bow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragonrider+bow"
    },
    "titanite-chunk": {
      "defaultName": "Titanite Chunk",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/titanite+chunk"
    },
    "llewellyn-shield": {
      "defaultName": "Llewellyn Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/llewellyn+shield"
    },
    "executioner-set": {
      "defaultName": "Executioner Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/executioner+set"
    },
    "spotted-whip": {
      "defaultName": "Spotted Whip",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/spotted+whip"
    },
    "cornyxs-set": {
      "defaultName": "Cornyx's Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/cornyx's+set"
    },
    "old-demon-king": {
      "defaultName": "Old Demon King",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/old+demon+king"
    },
    "soul-of-the-old-demon-king": {
      "defaultName": "Soul of the Old Demon King",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+the+old+demon+king"
    },
    "sulyvahns-beast": {
      "defaultName": "Sulyvahn's Beast",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sulyvahn's+beast"
    },
    "pontiffs-right-eye": {
      "defaultName": "Pontiff's Right Eye",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/pontiff's+right+eye"
    },
    "creighton-the-wanderer": {
      "defaultName": "Creighton the Wanderer",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/creighton+the+wanderer"
    },
    "silvercat-ring": {
      "defaultName": "Silvercat Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/silvercat+ring"
    },
    "rime-blue-moss-clump": {
      "defaultName": "Rime-blue Moss Clump",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/rime-blue+moss+clump"
    },
    "soul-of-a-weary-warrior": {
      "defaultName": "Soul of a Weary Warrior",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+a+weary+warrior"
    },
    "budding-green-blossom": {
      "defaultName": "Budding Green Blossom",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/budding+green+blossom"
    },
    "burning-stake-witch": {
      "defaultName": "Burning Stake Witch",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/burning+stake+witch"
    },
    "dorhys-gnawing": {
      "defaultName": "Dorhy's Gnawing",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dorhy's+gnawing"
    },
    "witchtree-branch": {
      "defaultName": "Witchtree Branch",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/witchtree+branch"
    },
    "proof-of-a-concord-kept": {
      "defaultName": "Proof of a Concord Kept",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/proof+of+a+concord+kept"
    },
    "chameleon": {
      "defaultName": "Chameleon",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/chameleon"
    },
    "roster-of-knights": {
      "defaultName": "Roster of Knights",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/roster+of+knights"
    },
    "dragonslayers-axe": {
      "defaultName": "Dragonslayer's Axe",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragonslayer's+axe"
    },
    "mirrah-chain-set": {
      "defaultName": "Mirrah Chain Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/mirrah+chain+set"
    },
    "yorshkas-spear": {
      "defaultName": "Yorshka's Spear",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/yorshka's+spear"
    },
    "covetous-gold-serpent-ring": {
      "defaultName": "Covetous Gold Serpent Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/covetous+gold+serpent+ring"
    },
    "blood-gem": {
      "defaultName": "Blood Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/blood+gem"
    },
    "great-heal": {
      "defaultName": "Great Heal",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/great+heal"
    },
    "dung-pie": {
      "defaultName": "Dung Pie",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dung+pie"
    },
    "excrement-covered-ashes": {
      "defaultName": "Excrement-covered Ashes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/excrement-covered+ashes"
    },
    "emit-force": {
      "defaultName": "Emit Force",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/emit+force"
    },
    "divine-blessing": {
      "defaultName": "Divine Blessing",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/divine+blessing"
    },
    "leo-ring": {
      "defaultName": "Leo Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/leo+ring"
    },
    "smoughs-great-hammer": {
      "defaultName": "Smough's Great Hammer",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/smough's+great+hammer"
    },
    "wood-grain-ring": {
      "defaultName": "Wood Grain Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/wood+grain+ring"
    },
    "pale-shade-set": {
      "defaultName": "Pale Shade Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/pale+shade+set"
    },
    "ring-of-the-suns-first-born": {
      "defaultName": "Ring of the Sun's First Born",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ring+of+the+sun's+first+born"
    },
    "lightning-gem": {
      "defaultName": "Lightning Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lightning+gem"
    },
    "magic-clutch-ring": {
      "defaultName": "Magic Clutch Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/magic+clutch+ring"
    },
    "pontiff-sulyvahn": {
      "defaultName": "Pontiff Sulyvahn",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/pontiff+sulyvahn"
    },
    "soul-of-pontiff-sulyvahn": {
      "defaultName": "Soul of Pontiff Sulyvahn",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+pontiff+sulyvahn"
    },
    "golden-ritual-spear": {
      "defaultName": "Golden Ritual Spear",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/golden+ritual+spear"
    },
    "simple-gem": {
      "defaultName": "Simple Gem",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/simple+gem"
    },
    "drang-twinspears": {
      "defaultName": "Drang Twinspears",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/drang+twinspears"
    },
    "archdeacon-mcdonnell": {
      "defaultName": "Archdeacon McDonnell",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/archdeacon+mcdonnell"
    },
    "aldrich-faithful": {
      "defaultName": "Aldrich Faithful",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/aldrich+faithful"
    },
    "human-dregs": {
      "defaultName": "Human Dregs",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/human+dregs"
    },
    "easterners-ashes": {
      "defaultName": "Easterner's Ashes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/easterner's+ashes"
    },
    "dragonslayer-greatbow": {
      "defaultName": "Dragonslayer Greatbow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragonslayer+greatbow"
    },
    "dragonslayer-greatarrow": {
      "defaultName": "Dragonslayer Greatarrow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragonslayer+greatarrow"
    },
    "sword-of-avowal": {
      "defaultName": "Sword of Avowal",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sword+of+avowal"
    },
    "brass-set": {
      "defaultName": "Brass Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/brass+set"
    },
    "reversal-ring": {
      "defaultName": "Reversal Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/reversal+ring"
    },
    "anris-straight-sword": {
      "defaultName": "Anri's Straight Sword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/anri's+straight+sword"
    },
    "company-captain-yorshka": {
      "defaultName": "Company Captain Yorshka",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/company+captain+yorshka"
    },
    "blades-of-the-darkmoon": {
      "defaultName": "Blades of the Darkmoon",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/blades+of+the+darkmoon"
    },
    "painting-guardians-curved-sword": {
      "defaultName": "Painting Guardian's Curved Sword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/painting+guardian's+curved+sword"
    },
    "painting-guardian-set": {
      "defaultName": "Painting Guardian Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/painting+guardian+set"
    },
    "havels-ring": {
      "defaultName": "Havel's Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/havel's+ring"
    },
    "large-soul-of-a-weary-warrior": {
      "defaultName": "Large Soul of a Weary Warrior",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/large+soul+of+a+weary+warrior"
    },
    "giants-coal": {
      "defaultName": "Giant's Coal",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/giant's+coal"
    },
    "moonlight-arrow": {
      "defaultName": "Moonlight Arrow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/moonlight+arrow"
    },
    "aldrichs-ruby": {
      "defaultName": "Aldrich's Ruby",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/aldrich's+ruby"
    },
    "rotten-flesh-of-aldrich": {
      "defaultName": "Rotten Flesh of Aldrich",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/rotten+flesh+of+aldrich"
    },
    "aldrich--devourer-of-gods": {
      "defaultName": "Aldrich, Devourer of Gods",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/aldrich,+devourer+of+gods"
    },
    "soul-of-aldrich": {
      "defaultName": "Soul of Aldrich",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+aldrich"
    },
    "sun-princess-ring": {
      "defaultName": "Sun Princess Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sun+princess+ring"
    },
    "sunset-armor-set": {
      "defaultName": "Sunset Armor Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sunset+armor+set"
    },
    "sunset-shield": {
      "defaultName": "Sunset Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sunset+shield"
    },
    "alva--seeker-of-the-spurned": {
      "defaultName": "Alva, Seeker of the Spurned",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/alva,+seeker+of+the+spurned"
    },
    "murakumo": {
      "defaultName": "Murakumo",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/murakumo"
    },
    "old-sorcerer-set": {
      "defaultName": "Old Sorcerer Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/old+sorcerer+set"
    },
    "great-magic-shield": {
      "defaultName": "Great Magic Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/great+magic+shield"
    },
    "pale-pine-resin": {
      "defaultName": "Pale Pine Resin",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/pale+pine+resin"
    },
    "jailbreakers-key": {
      "defaultName": "Jailbreaker's Key",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/jailbreaker's+key"
    },
    "bellowing-dragoncrest-ring": {
      "defaultName": "Bellowing Dragoncrest Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/bellowing+dragoncrest+ring"
    },
    "pickaxe": {
      "defaultName": "Pickaxe",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/pickaxe"
    },
    "dark-clutch-ring": {
      "defaultName": "Dark Clutch Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dark+clutch+ring"
    },
    "old-cell-key": {
      "defaultName": "Old Cell Key",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/old+cell+key"
    },
    "dragon-torso-stone": {
      "defaultName": "Dragon Torso Stone",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragon+torso+stone"
    },
    "lightning-blade": {
      "defaultName": "Lightning Blade",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lightning+blade"
    },
    "wretch": {
      "defaultName": "Wretch",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/wretch"
    },
    "profaned-coal": {
      "defaultName": "Profaned Coal",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/profaned+coal"
    },
    "xanthous-ashes": {
      "defaultName": "Xanthous Ashes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/xanthous+ashes"
    },
    "dusk-crown-ring": {
      "defaultName": "Dusk Crown Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dusk+crown+ring"
    },
    "karla": {
      "defaultName": "Karla",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/karla"
    },
    "jailers-key-ring": {
      "defaultName": "Jailer's Key Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/jailer's+key+ring"
    },
    "alva-set": {
      "defaultName": "Alva Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/alva+set"
    },
    "blooming-purple-moss-clump": {
      "defaultName": "Blooming Purple Moss Clump",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/blooming+purple+moss+clump"
    },
    "cursebite-ring": {
      "defaultName": "Cursebite Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/cursebite+ring"
    },
    "purging-stone": {
      "defaultName": "Purging Stone",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/purging+stone"
    },
    "hand-ogre": {
      "defaultName": "Hand Ogre",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/hand+ogre"
    },
    "eleonora": {
      "defaultName": "Eleonora",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/eleonora"
    },
    "logans-scroll": {
      "defaultName": "Logan's Scroll",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/logan's+scroll"
    },
    "poison-arrow": {
      "defaultName": "Poison Arrow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/poison+arrow"
    },
    "wrath-of-the-gods": {
      "defaultName": "Wrath of the Gods",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/wrath+of+the+gods"
    },
    "court-sorcerer-set": {
      "defaultName": "Court Sorcerer Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/court+sorcerer+set"
    },
    "court-sorcerers-staff": {
      "defaultName": "Court Sorcerer's Staff",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/court+sorcerer's+staff"
    },
    "rubbish": {
      "defaultName": "Rubbish",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/rubbish"
    },
    "titanite-slab": {
      "defaultName": "Titanite Slab",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/titanite+slab"
    },
    "profaned-flame": {
      "defaultName": "Profaned Flame",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/profaned+flame"
    },
    "dragonslayer-lightning-arrow": {
      "defaultName": "Dragonslayer Lightning Arrow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragonslayer+lightning+arrow"
    },
    "lightning-bolt": {
      "defaultName": "Lightning Bolt",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lightning+bolt"
    },
    "prisoner-chiefs-ashes": {
      "defaultName": "Prisoner Chief's Ashes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/prisoner+chief's+ashes"
    },
    "onislayer-greatarrow": {
      "defaultName": "Onislayer Greatarrow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/onislayer+greatarrow"
    },
    "onislayer-greatbow": {
      "defaultName": "Onislayer Greatbow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/onislayer+greatbow"
    },
    "greatshield-of-glory": {
      "defaultName": "Greatshield of Glory",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/greatshield+of+glory"
    },
    "yhorm-the-giant": {
      "defaultName": "Yhorm the Giant",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/yhorm+the+giant"
    },
    "soul-of-yhorm-the-giant": {
      "defaultName": "Soul of Yhorm the Giant",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+yhorm+the+giant"
    },
    "basin-of-vows": {
      "defaultName": "Basin of Vows",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/basin+of+vows"
    },
    "dancer-of-the-boreal-valley": {
      "defaultName": "Dancer of the Boreal Valley",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dancer+of+the+boreal+valley"
    },
    "storm-ruler": {
      "defaultName": "Storm Ruler",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/storm+ruler"
    },
    "pierce-shield": {
      "defaultName": "Pierce Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/pierce+shield"
    },
    "soul-of-the-dancer": {
      "defaultName": "Soul of the Dancer",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+the+dancer"
    },
    "claw": {
      "defaultName": "Claw",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/claw"
    },
    "shadow-set": {
      "defaultName": "Shadow Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/shadow+set"
    },
    "dragonscale-ring": {
      "defaultName": "Dragonscale Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragonscale+ring"
    },
    "oceiros--the-consumed-king": {
      "defaultName": "Oceiros, the Consumed King",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/oceiros,+the+consumed+king"
    },
    "soul-of-consumed-oceiros": {
      "defaultName": "Soul of Consumed Oceiros",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+consumed+oceiros"
    },
    "ashen-estus-ring": {
      "defaultName": "Ashen Estus Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ashen+estus+ring"
    },
    "daughter-of-crystal-kriemhild": {
      "defaultName": "Daughter of Crystal Kriemhild",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/daughter+of+crystal+kriemhild"
    },
    "hidden-blessing": {
      "defaultName": "Hidden Blessing",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/hidden+blessing"
    },
    "champion-gundyr": {
      "defaultName": "Champion Gundyr",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/champion+gundyr"
    },
    "soul-of-champion-gundyr": {
      "defaultName": "Soul of Champion Gundyr",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+champion+gundyr"
    },
    "black-knight-glaive": {
      "defaultName": "Black Knight Glaive",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/black+knight+glaive"
    },
    "hornet-ring": {
      "defaultName": "Hornet Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/hornet+ring"
    },
    "chaos-blade": {
      "defaultName": "Chaos Blade",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/chaos+blade"
    },
    "coiled-sword-fragment": {
      "defaultName": "Coiled Sword Fragment",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/coiled+sword+fragment"
    },
    "wolf-knight-set": {
      "defaultName": "Wolf Knight Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/wolf+knight+set"
    },
    "priestess-ring": {
      "defaultName": "Priestess Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/priestess+ring"
    },
    "blacksmith-hammer": {
      "defaultName": "Blacksmith Hammer",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/blacksmith+hammer"
    },
    "eyes-of-a-fire-keeper": {
      "defaultName": "Eyes of a Fire Keeper",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/eyes+of+a+fire+keeper"
    },
    "hollows-ashes": {
      "defaultName": "Hollow's Ashes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/hollow's+ashes"
    },
    "ancient-dragon-greatshield": {
      "defaultName": "Ancient Dragon Greatshield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ancient+dragon+greatshield"
    },
    "lightning-clutch-ring": {
      "defaultName": "Lightning Clutch Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lightning+clutch+ring"
    },
    "ancient-wyvern": {
      "defaultName": "Ancient Wyvern",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ancient+wyvern"
    },
    "dragon-head-stone": {
      "defaultName": "Dragon Head Stone",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragon+head+stone"
    },
    "stalk-dung-pie": {
      "defaultName": "Stalk Dung Pie",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/stalk+dung+pie"
    },
    "lightning-urn": {
      "defaultName": "Lightning Urn",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lightning+urn"
    },
    "drakeblood-knight": {
      "defaultName": "Drakeblood Knight",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/drakeblood+knight"
    },
    "drakeblood-greatsword": {
      "defaultName": "Drakeblood Greatsword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/drakeblood+greatsword"
    },
    "drakeblood-set": {
      "defaultName": "Drakeblood Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/drakeblood+set"
    },
    "calamity-ring": {
      "defaultName": "Calamity Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/calamity+ring"
    },
    "dragonslayer-spear": {
      "defaultName": "Dragonslayer Spear",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragonslayer+spear"
    },
    "rapier-champion": {
      "defaultName": "Rapier Champion",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/rapier+champion"
    },
    "ricards-rapier": {
      "defaultName": "Ricard's Rapier",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ricard's+rapier"
    },
    "havel-knight": {
      "defaultName": "Havel Knight",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/havel+knight"
    },
    "dragon-tooth": {
      "defaultName": "Dragon Tooth",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragon+tooth"
    },
    "havels-greatshield": {
      "defaultName": "Havel's Greatshield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/havel's+greatshield"
    },
    "large-soul-of-a-crestfallen-knight": {
      "defaultName": "Large Soul of a Crestfallen Knight",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/large+soul+of+a+crestfallen+knight"
    },
    "twinkling-dragon-torso-stone": {
      "defaultName": "Twinkling Dragon Torso Stone",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/twinkling+dragon+torso+stone"
    },
    "dragon-chasers-ashes": {
      "defaultName": "Dragon Chaser's Ashes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragon+chaser's+ashes"
    },
    "great-magic-barrier": {
      "defaultName": "Great Magic Barrier",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/great+magic+barrier"
    },
    "havels-set": {
      "defaultName": "Havel's Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/havel's+set"
    },
    "twinkling-dragon-head-stone": {
      "defaultName": "Twinkling Dragon Head Stone",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/twinkling+dragon+head+stone"
    },
    "nameless-king": {
      "defaultName": "Nameless King",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/nameless+king"
    },
    "soul-of-the-nameless-king": {
      "defaultName": "Soul of the Nameless King",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+the+nameless+king"
    },
    "dragonslayer-set": {
      "defaultName": "Dragonslayer Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragonslayer+set"
    },
    "greirats-ashes": {
      "defaultName": "Greirat's ashes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/greirat's+ashes"
    },
    "splintering-bolt": {
      "defaultName": "Splintering Bolt",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/splintering+bolt"
    },
    "prayer-set": {
      "defaultName": "Prayer Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/prayer+set"
    },
    "winged-knight-set": {
      "defaultName": "Winged Knight Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/winged+knight+set"
    },
    "sacred-bloom-shield": {
      "defaultName": "Sacred Bloom Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sacred+bloom+shield"
    },
    "greatlance": {
      "defaultName": "Greatlance",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/greatlance"
    },
    "lothric-wyvern": {
      "defaultName": "Lothric Wyvern",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lothric+wyvern"
    },
    "sniper-crossbow": {
      "defaultName": "Sniper Crossbow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sniper+crossbow"
    },
    "sniper-bolt": {
      "defaultName": "Sniper Bolt",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sniper+bolt"
    },
    "irithyll-rapier": {
      "defaultName": "Irithyll Rapier",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/irithyll+rapier"
    },
    "spirit-tree-crest-shield": {
      "defaultName": "Spirit Tree Crest Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/spirit+tree+crest+shield"
    },
    "sunlight-medal": {
      "defaultName": "Sunlight Medal",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sunlight+medal"
    },
    "red-tearstone-ring": {
      "defaultName": "Red Tearstone Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/red+tearstone+ring"
    },
    "caithas-chime": {
      "defaultName": "Caitha's Chime",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/caitha's+chime"
    },
    "sunlight-straight-sword": {
      "defaultName": "Sunlight Straight Sword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sunlight+straight+sword"
    },
    "braille-divine-tome-of-lothric": {
      "defaultName": "Braille Divine Tome of Lothric",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/braille+divine+tome+of+lothric"
    },
    "knights-ring": {
      "defaultName": "Knight's Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/knight's+ring"
    },
    "dragonslayer-armour": {
      "defaultName": "Dragonslayer Armour",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragonslayer+armour"
    },
    "soul-of-dragonslayer-armour": {
      "defaultName": "Soul of Dragonslayer Armour",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+dragonslayer+armour"
    },
    "mornes-great-hammer": {
      "defaultName": "Morne's Great Hammer",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/morne's+great+hammer"
    },
    "moaning-shield": {
      "defaultName": "Moaning Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/moaning+shield"
    },
    "mornes-set": {
      "defaultName": "Morne's Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/morne's+set"
    },
    "grand-archives-key": {
      "defaultName": "Grand Archives Key",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/grand+archives+key"
    },
    "gotthard-twinswords": {
      "defaultName": "Gotthard Twinswords",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/gotthard+twinswords"
    },
    "crystal-scroll": {
      "defaultName": "Crystal Scroll",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/crystal+scroll"
    },
    "crystal-chime": {
      "defaultName": "Crystal Chime",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/crystal+chime"
    },
    "witchs-locks": {
      "defaultName": "Witch's Locks",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/witch's+locks"
    },
    "power-within": {
      "defaultName": "Power Within",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/power+within"
    },
    "avelyn": {
      "defaultName": "Avelyn",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/avelyn"
    },
    "outrider-knight-set": {
      "defaultName": "Outrider Knight Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/outrider+knight+set"
    },
    "soul-stream": {
      "defaultName": "Soul Stream",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+stream"
    },
    "scholar-ring": {
      "defaultName": "Scholar Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/scholar+ring"
    },
    "black-hand-kamui": {
      "defaultName": "Black Hand Kamui",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/black+hand+kamui"
    },
    "onikiri-and-ubadachi": {
      "defaultName": "Onikiri and Ubadachi",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/onikiri+and+ubadachi"
    },
    "sages-crystal-staff": {
      "defaultName": "Sage's Crystal Staff",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sage's+crystal+staff"
    },
    "golden-wing-crest-shield": {
      "defaultName": "Golden Wing Crest Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/golden+wing+crest+shield"
    },
    "hunters-ring": {
      "defaultName": "Hunter's Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/hunter's+ring"
    },
    "divine-pillars-of-light": {
      "defaultName": "Divine Pillars of Light",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/divine+pillars+of+light"
    },
    "lothric--younger-prince": {
      "defaultName": "Lothric, Younger Prince",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lothric,+younger+prince"
    },
    "soul-of-the-twin-princes": {
      "defaultName": "Soul of the Twin Princes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+the+twin+princes"
    },
    "orbecks-ashes": {
      "defaultName": "Orbeck's Ashes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/orbeck's+ashes"
    },
    "morion-blade": {
      "defaultName": "Morion Blade",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/morion+blade"
    },
    "clandestine-coat": {
      "defaultName": "Clandestine Coat",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/clandestine+coat"
    },
    "sunless-talisman": {
      "defaultName": "Sunless Talisman",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sunless+talisman"
    },
    "sunless-set": {
      "defaultName": "Sunless Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sunless+set"
    },
    "black-eye-orb": {
      "defaultName": "Black Eye Orb",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/black+eye+orb"
    },
    "soul-of-rosaria": {
      "defaultName": "Soul of Rosaria",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+rosaria"
    },
    "crescent-moon-sword": {
      "defaultName": "Crescent Moon Sword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/crescent+moon+sword"
    },
    "silver-mask": {
      "defaultName": "Silver Mask",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/silver+mask"
    },
    "leonhards-set": {
      "defaultName": "Leonhard's Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/leonhard's+set"
    },
    "bountiful-sunlight": {
      "defaultName": "Bountiful Sunlight",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/bountiful+sunlight"
    },
    "skull-ring": {
      "defaultName": "Skull Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/skull+ring"
    },
    "darkdrift": {
      "defaultName": "Darkdrift",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/darkdrift"
    },
    "black-set": {
      "defaultName": "Black Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/black+set"
    },
    "soul-of-cinder": {
      "defaultName": "Soul of Cinder",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+cinder"
    },
    "soul-of-the-lords": {
      "defaultName": "Soul of the Lords",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+the+lords"
    },
    "endings": {
      "defaultName": "Endings",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/endings"
    },
    "trophy---achievement-guide": {
      "defaultName": "Trophy & Achievement Guide",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/trophy+&+achievement+guide"
    },
    "follower-javelin": {
      "defaultName": "Follower Javelin",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/follower+javelin"
    },
    "ethereal-oak-shield": {
      "defaultName": "Ethereal Oak Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ethereal+oak+shield"
    },
    "captains-ashes": {
      "defaultName": "Captain's Ashes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/captain's+ashes"
    },
    "millwood-set": {
      "defaultName": "Millwood Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/millwood+set"
    },
    "millwood-greatarrow": {
      "defaultName": "Millwood Greatarrow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/millwood+greatarrow"
    },
    "millwood-battle-axe": {
      "defaultName": "Millwood Battle Axe",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/millwood+battle+axe"
    },
    "millwood-greatbow": {
      "defaultName": "Millwood Greatbow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/millwood+greatbow"
    },
    "frozen-weapon": {
      "defaultName": "Frozen Weapon",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/frozen+weapon"
    },
    "sir-vilhelm": {
      "defaultName": "Sir Vilhelm",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sir+vilhelm"
    },
    "chillbite-ring": {
      "defaultName": "Chillbite Ring",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/chillbite+ring"
    },
    "follower-sabre": {
      "defaultName": "Follower Sabre",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/follower+sabre"
    },
    "snap-freeze": {
      "defaultName": "Snap Freeze",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/snap+freeze"
    },
    "crow-quills": {
      "defaultName": "Crow Quills",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/crow+quills"
    },
    "crow-talons": {
      "defaultName": "Crow Talons",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/crow+talons"
    },
    "slave-set": {
      "defaultName": "Slave Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/slave+set"
    },
    "way-of-white-corona": {
      "defaultName": "Way of White Corona",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/way+of+white+corona"
    },
    "contraption-key": {
      "defaultName": "Contraption Key",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/contraption+key"
    },
    "onyx-blade": {
      "defaultName": "Onyx Blade",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/onyx+blade"
    },
    "follower-shield": {
      "defaultName": "Follower Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/follower+shield"
    },
    "follower-torch": {
      "defaultName": "Follower Torch",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/follower+torch"
    },
    "earth-seeker": {
      "defaultName": "Earth Seeker",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/earth+seeker"
    },
    "quakestone-hammer": {
      "defaultName": "Quakestone Hammer",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/quakestone+hammer"
    },
    "vilhelms-set": {
      "defaultName": "Vilhelm's Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/vilhelm's+set"
    },
    "pyromancers-parting-flame": {
      "defaultName": "Pyromancer's Parting Flame",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/pyromancer's+parting+flame"
    },
    "floating-chaos": {
      "defaultName": "Floating Chaos",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/floating+chaos"
    },
    "champions-gravetender---gravetender-greatwolf": {
      "defaultName": "Champion's Gravetender & Gravetender Greatwolf",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/champion's+gravetender+&+gravetender+greatwolf"
    },
    "champions-bones": {
      "defaultName": "Champion's Bones",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/champion's+bones"
    },
    "valorheart": {
      "defaultName": "Valorheart",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/valorheart"
    },
    "slave-knight-gael": {
      "defaultName": "Slave Knight Gael",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/slave+knight+gael"
    },
    "sister-friede": {
      "defaultName": "Sister Friede",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sister+friede"
    },
    "soul-of-sister-friede": {
      "defaultName": "Soul of Sister Friede",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+sister+friede"
    },
    "aquamarine-dagger": {
      "defaultName": "Aquamarine Dagger",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/aquamarine+dagger"
    },
    "murky-hand-scythe": {
      "defaultName": "Murky Hand Scythe",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/murky+hand+scythe"
    },
    "murky-longstaff": {
      "defaultName": "Murky Longstaff",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/murky+longstaff"
    },
    "great-soul-dregs": {
      "defaultName": "Great Soul Dregs",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/great+soul+dregs"
    },
    "lapp": {
      "defaultName": "Lapp",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lapp"
    },
    "projected-heal": {
      "defaultName": "Projected Heal",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/projected+heal"
    },
    "lothric-war-banner": {
      "defaultName": "Lothric War Banner",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lothric+war+banner"
    },
    "desert-pyromancer-garb": {
      "defaultName": "Desert Pyromancer Garb",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/desert+pyromancer+garb"
    },
    "giant-door-shield": {
      "defaultName": "Giant Door Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/giant+door+shield"
    },
    "desert-pyromancer-gloves": {
      "defaultName": "Desert Pyromancer Gloves",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/desert+pyromancer+gloves"
    },
    "desert-pyromancer-skirt": {
      "defaultName": "Desert Pyromancer Skirt",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/desert+pyromancer+skirt"
    },
    "harald-curved-greatsword": {
      "defaultName": "Harald Curved Greatsword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/harald+curved+greatsword"
    },
    "desert-pyromancer-zoey": {
      "defaultName": "Desert Pyromancer Zoey",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/desert+pyromancer+zoey"
    },
    "flame-fan": {
      "defaultName": "Flame Fan",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/flame+fan"
    },
    "desert-pyromancer-hood": {
      "defaultName": "Desert Pyromancer Hood",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/desert+pyromancer+hood"
    },
    "demon-prince": {
      "defaultName": "Demon Prince",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/demon+prince"
    },
    "soul-of-the-demon-prince": {
      "defaultName": "Soul of the Demon Prince",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+the+demon+prince"
    },
    "small-envoy-banner": {
      "defaultName": "Small Envoy Banner",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/small+envoy+banner"
    },
    "ruin-set": {
      "defaultName": "Ruin Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ruin+set"
    },
    "shira": {
      "defaultName": "Shira",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/shira"
    },
    "sacred-chime-of-filianore": {
      "defaultName": "Sacred Chime of Filianore",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/sacred+chime+of+filianore"
    },
    "mossfruit": {
      "defaultName": "Mossfruit",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/mossfruit"
    },
    "seeker-of-the-spurned": {
      "defaultName": "Seeker of the Spurned",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/seeker+of+the+spurned"
    },
    "black-witch-set": {
      "defaultName": "Black Witch Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/black+witch+set"
    },
    "ringed-knight-spear": {
      "defaultName": "Ringed Knight Spear",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ringed+knight+spear"
    },
    "white-preacher-head": {
      "defaultName": "White Preacher Head",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/white+preacher+head"
    },
    "ringed-knight-straight-sword": {
      "defaultName": "Ringed Knight Straight Sword",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ringed+knight+straight+sword"
    },
    "preachers-right-arm": {
      "defaultName": "Preacher's Right Arm",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/preacher's+right+arm"
    },
    "black-witch-veil": {
      "defaultName": "Black Witch Veil",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/black+witch+veil"
    },
    "giant-humanity": {
      "defaultName": "Giant Humanity",
      "wikiUrl": "https://darksouls.wiki.fextralife.com/giant+humanity"
    },
    "purging-monument": {
      "defaultName": "Purging Monument",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/purging+monument"
    },
    "dragonhead-shield": {
      "defaultName": "Dragonhead Shield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragonhead+shield"
    },
    "silver-knight-ledo": {
      "defaultName": "Silver Knight Ledo",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/silver+knight+ledo"
    },
    "ledos-great-hammer": {
      "defaultName": "Ledo's Great Hammer",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ledo's+great+hammer"
    },
    "white-birch-bow": {
      "defaultName": "White Birch Bow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/white+birch+bow"
    },
    "church-guardian-shiv": {
      "defaultName": "Church Guardian Shiv",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/church+guardian+shiv"
    },
    "iron-dragonslayer-set": {
      "defaultName": "Iron Dragonslayer Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/iron+dragonslayer+set"
    },
    "dragonhead-greatshield": {
      "defaultName": "Dragonhead Greatshield",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/dragonhead+greatshield"
    },
    "blindfold-mask": {
      "defaultName": "Blindfold Mask",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/blindfold+mask"
    },
    "lapps-set": {
      "defaultName": "Lapp's Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lapp's+set"
    },
    "lightning-arrow": {
      "defaultName": "Lightning Arrow",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/lightning+arrow"
    },
    "filianores-spear-ornament": {
      "defaultName": "Filianore's Spear Ornament",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/filianore's+spear+ornament"
    },
    "antiquated-plain-set": {
      "defaultName": "Antiquated Plain Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/antiquated+plain+set"
    },
    "darkeater-midir": {
      "defaultName": "Darkeater Midir",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/darkeater+midir"
    },
    "spears-of-the-church": {
      "defaultName": "Spears of the Church",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/spears+of+the+church"
    },
    "soul-of-darkeater-midir": {
      "defaultName": "Soul of Darkeater Midir",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+darkeater+midir"
    },
    "ringed-knight": {
      "defaultName": "Ringed Knight",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ringed+knight"
    },
    "ringed-knight-paired-greatswords": {
      "defaultName": "Ringed Knight Paired Greatswords",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ringed+knight+paired+greatswords"
    },
    "ritual-spear-fragment": {
      "defaultName": "Ritual Spear Fragment",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/ritual+spear+fragment"
    },
    "halflight--spear-of-the-church": {
      "defaultName": "Halflight, Spear of the Church",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/halflight,+spear+of+the+church"
    },
    "crucifix-of-the-mad-king": {
      "defaultName": "Crucifix of the Mad King",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/crucifix+of+the+mad+king"
    },
    "shiras-set": {
      "defaultName": "Shira's Set",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/shira's+set"
    },
    "old-womans-ashes": {
      "defaultName": "Old Woman's Ashes",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/old+woman's+ashes"
    },
    "slave-knight-gael--boss-": {
      "defaultName": "Slave Knight Gael (Boss)",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/slave+knight+gael+(boss)"
    },
    "soul-of-slave-knight-gael": {
      "defaultName": "Soul of Slave Knight Gael",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/soul+of+slave+knight+gael"
    },
    "blood-of-the-dark-soul": {
      "defaultName": "Blood of the Dark Soul",
      "wikiUrl": "https://darksouls3.wiki.fextralife.com/blood+of+the+dark+soul"
    }
  }
}